local lang = LANGUAGE
local wep = LANGUAGE.WEAPONS

--[[-------------------------------------------------------------------------
Vests
---------------------------------------------------------------------------]]
local vest = {}
lang.VEST = vest

vest.guard = "Бронежилет Охоронця"
vest.heavyguard = "Бронежилет Важкого Охоронця"
vest.specguard = "Бронежилет Спеціального Охоронця"
vest.guard_medic = "Бронежилет Медика Охорони"
vest.ntf = "Бронежилет МОГ «ДХЛ»"
vest.mtf_medic = "Бронежилет Медика МОГ «ДХЛ»"
vest.ntfcom = "Бронежилет Командира МОГ «ДХЛ»"
vest.alpha1 = "Бронежилет МОГ Альфа-1"
vest.ci = "Бронежилет Повстанців Хаосу"
vest.cicom = "Бронежилет Командира ПХ"
vest.cimedic = "Бронежилет Медика ПХ"
vest.goc = "Бронежилет ГОК"
vest.gocmedic = "Бронежилет Медика ГОК"
vest.goccom = "Бронежилет Командира ГОК"
vest.fire = "Вогнестійкий бронежилет"
vest.electro = "Електростійкий бронежилет"
vest.hazmat = "Захисний костюм"

local dmg = {}
lang.DMG = dmg

dmg.BURN = "Шкода від вогню"
dmg.SHOCK = "Шкода від електрики"
dmg.BULLET = "Шкода від куль"
dmg.FALL = "Шкода від падіння"
dmg.POISON = "Шкода від отрути"

--[[-------------------------------------------------------------------------
Weapons
---------------------------------------------------------------------------]]
wep.SCP009 = {
	name = "SCP-009",
}

wep.SCP500 = {
	name = "SCP-500",
	death_info = "Ти подавився тим SCP-500.",
	text_used = "Як тільки ви проковтнули цю пігулку, ви відчули себе краще",
}

wep.SCP714 = {
	name = "SCP-714"
}

wep.SCP1025 = {
	name = "SCP-1025",
	diseases = {
		arrest = "Зупинка серця",
		mental = "Психічнt захворювання",
		asthma = "Астма",
		blindness = "Сліпота",
		hemo = "Гемофілія",
		oste = "Остеопороз",

		adhd = "СДУГ",
		throm = "Тромбоцитемія",
		urbach = "Хвороба Урбаха-Віте",

		gas = "Тимпаніти",
	},
	descriptions = {
		arrest = "Зупинка серця - це раптова втрата кровотоку внаслідок нездатності серця ефективно перекачувати кров. Ознаки включають втрату свідомості та ненормальне або відсутнє дихання. Деякі люди можуть відчувати біль у грудях, задишку або нудоту безпосередньо перед зупинкою серця. Поширеним симптомом є біль, що віддає в одну руку, а також тривале нездужання і загальна слабкість серця. Якщо не надати допомогу протягом декількох хвилин, це зазвичай призводить до смерті.",
		asthma = "Астма - це тривале запальне захворювання дихальних шляхів легенів. Вона характеризується мінливими та рецидивуючими симптомами, обструкцією повітряного потоку та бронхоспазмами, що легко провокуються. Симптоми включають епізоди хрипів, кашлю, відчуття стиснення в грудях і задишки. Вони можуть виникати кілька разів на день або кілька разів на тиждень.",
		blindness = "Порушення зору, також відоме як погіршення зору або втрата зору, - це зниження здатності бачити до такої міри, що викликає проблеми, які неможливо виправити за допомогою звичайних засобів, таких як окуляри. До таких людей також відносять тих, у кого знижена здатність бачити через те, що вони не мають доступу до окулярів або контактних лінз. Термін 'сліпота' використовується для повної або майже повної втрати зору.",
		hemo = "Гемофілія - це переважно успадковане генетичне захворювання, яке порушує здатність організму утворювати згустки крові - процес, необхідний для зупинки кровотечі. Це призводить до тривалої кровотечі після травми, легкого утворення синців і підвищеного ризику кровотечі в суглоби або мозок. Характерні симптоми залежать від ступеня тяжкості. Загалом симптоми - це епізоди внутрішньої або зовнішньої кровотечі.",
		oste = "Остеопороз - це системне захворювання скелета, що характеризується низькою кістковою масою, мікроархітектурним погіршенням кісткової тканини, що призводить до крихкості кісток і, як наслідок, підвищує ризик переломів. Це найпоширеніша причина переломів серед людей похилого віку. До кісток, які найчастіше ламаються, належать хребці хребта, кістки передпліччя та стегна. До моменту перелому кістки зазвичай немає жодних симптомів.",

		adhd = "Синдром дефіциту уваги та гіперактивності (СДУГ) - це розлад нейророзвитку, що характеризується неуважністю, нападами надмірної енергії, гіперфіксацією та імпульсивністю, які не відповідають віку людини. У деяких людей з СДУГ також спостерігаються труднощі з регулюванням емоцій або проблеми з виконавчою функцією. Крім того, він пов'язаний з іншими психічними розладами.",
		throm = "Тромбоцитемія - це стан підвищеної кількості тромбоцитів у крові. Високий рівень тромбоцитів не обов'язково свідчить про наявність клінічних проблем і може бути виявлений при звичайному загальному аналізі крові. Однак важливо зібрати повну історію хвороби, щоб переконатися, що підвищений рівень тромбоцитів не є наслідком вторинних процесів.",
		urbach = "Хвороба Урбаха-Віте - дуже рідкісне рецесивне генетичне захворювання. Симптоми захворювання сильно відрізняються у різних людей. Хвороба Урбаха-Віте проявляється двосторонніми симетричними кальцифікатами на медіальних скроневих частках. Ці кальцинати часто вражають мигдалину. Вважається, що мигдалеподібне тіло бере участь в обробці біологічно значущих стимулів і в емоційній довготривалій пам'яті, особливо пов'язаній зі страхом..",
	},
	death_info_arrest = "Ви померли через зупинку серця"
}

wep.HOLSTER = {
	name = "Руки",
	info = "Використовуйте, щоб приховати поточний предмет"
}

wep.ID = {
	name = "ID",
	pname = "Ім'я:",
	server = "Сервер:",
}

wep.CCTV = {
	name = "Система відеоспостереження",
	showname = "Камери",
	info = "Система відеоспостереження дозволяє бачити, що відбувається на об'єкті.\nВона також надає вам можливість виявляти SCP і передавати цю інформацію на ваш поточний радіоканал",
	scanning = "Сканування...",
	scan_info = "Натисніть [%s] для сканування SCPs",
	map_info = "Натисніть [%s] щоб відкрити карту",
	scan_cd = "Почекайте перед початком нового сканування...",
	no_signal = "Нема сигналу...",
}

wep.RADIO = {
	name = "Рація",
}

wep.NVG = {
	name = "ПНБ",
	info = "Пристрій нічного бачення - пристрій, який робить темні ділянки яскравішими, а світлі - ще яскравішими.\nІноді крізь них можна побачити аномальні сутності."
}

wep.NVGPLUS = {
	name = "Покращений ПНБ",
	showname = "ПНБ+",
	info = "Покращена версія ПНБ, що дозволяє використовувати його, тримаючи в руках інші предмети.\nНа жаль, батареї вистачає лише на 10 секунд"
}

wep.THERMAL = {
	showname = "Тепловізор",
	name = "Тепловізійний пристрій"
}

wep.ACCESS_CHIP = {
	name = "Чип доступу",
	cname = "Чип доступу - %s",
	showname = "ЧИП",
	pickupname = "ЧИП",
	clearance = "Рівень допуску: %i",
	clearance2 = "Рівень допуску: ",
	hasaccess = "Надає доступ до:",
	NAMES = {
		general = "Загальний",
		jan1 = "Прибиральник",
		jan = "Прибиральник",
		jan2 = "Старший Прибиральник",
		acc = "Бухгалтер",
		log = "Логіст",
		sci1 = "Дослідник 1 рівня",
		sci2 = "Дослідник 2 рівня",
		sci3 = "Дослідник 3 рівня",
		spec = "Спеціаліст із Стримування",
		guard = "Служба Безпеки",
		chief = "Голова СБ",
		mtf = "МОГ",
		com = "Командир МОГ",
		hacked3 = "Зламано 3",
		hacked4 = "Зламано 4",
		hacked5 = "Зламано 5",
		director = "Директор Об'єкту",
		o5 = "O5",
		goc = "ГОК зламано",
	},
	SHORT = {
		general = "Загальний",
		jan1 = "Прибиральник",
		jan = "Прибиральник",
		jan2 = "Ст. Прибиральник",
		acc = "Бухгалтер",
		log = "Логіст",
		sci1 = "Досл. 1 рів.",
		sci2 = "Досл. 2 рів.",
		sci3 = "Досл. 3 рів.",
		spec = "Спец. Стримування",
		guard = "СБ",
		chief = "ГСБ",
		mtf = "МОГ",
		com = "КМД МОГ",
		hacked3 = "Злам. 3",
		hacked4 = "Злам. 4",
		hacked5 = "Злам. 5",
		director = "Директор",
		o5 = "O5",
		goc = "ГОК злам.",
	},
	ACCESS = {
		GENERAL = "Загальний",
		SAFE = "Безпечні",
		EUCLID = "Євкліди",
		KETER = "Кетери",
		OFFICE = "Офіси",
		MEDBAY = "Медблок",
		CHECKPOINT_LCZ = "КПП LCZ-HCZ",
		CHECKPOINT_EZ = "КПП EZ-HCZ",
		WARHEAD_ELEVATOR = "Ліфт до боєголовки",
		EC = "Центр Керування",
		ARMORY = "Арсенал",
		GATE_A = "Ворота А",
		GATE_B = "Ворота B",
		GATE_C = "Ворота C",
		FEMUR = "Ламач Кісток",
		ALPHA = "АЛЬФА Боєголовка",
		OMEGA = "ОМЕГА Боєголовка",
		PARTICLE = "Макромолекулярна гармата",
	},
}

wep.OMNITOOL = {
	name = "Омнітул",
	cname = "Омнітул - %s",
	showname = "Омнітул",
	pickupname = "Омнітул",
	none = "НЕМА",
	chip = "Встановлений Чип: %s",
	chip2 = "Встановлений Чип: ",
	clearance = "Рівень допуску: %i",
	clearance2 = "Рівень допуску: ",
	SCREEN = {
		loading = "Завантаження",
		name = "Омнітул v4.78",
		installing = "Встановлення нового чипа...",
		ejecting = "Виймання чипа...",
		ejectwarn = "Ви точно хочете вийняти чип?",
		ejectconfirm = "Натисніть ще раз, щоб підтвердити...",
		chip = "Встановлений Чип:",
	},
}

wep.MEDKIT = {
	name = "Аптечка (Медикаментів залишилось: %d)",
	showname = "Аптечка",
	pickupname = "Аптечка",
}

wep.MEDKITPLUS = {
	name = "Велика Аптечка (Медикаментів залишилось: %d)",
	showname = "Аптечка+",
	pickupname = "Аптечка+",
}

wep.FLASHLIGHT = {
	name = "Ліхтарик"
}

wep.BATTERY = {
	name = "Батарейка"
}

wep.GASMASK = {
	name = "Протигаз"
}

wep.HEAVYMASK = {
	name = "Важкий Протигаз"
}

wep.FUSE = {
	name = "Запобіжник",
	name_f = "Запобіжник %iA",
}

wep.TURRET = {
	name = "Турель",
	placing_turret = "Встановлення турелі",
	pickup_turret = "Повернення турелі",
	pickup = "Підняти",
	MODES = {
		off = "Вимкнути",
		filter = "Не стріляти по персоналу",
		target = "Стріляти по персоналу",
		all = "Стріляти по всім",
		supp = "Придушувальний вогонь",
		scp = "Стріляти по SCP"
	}
}

wep.ALPHA_CARD1 = {
	name = "Коди для АЛЬФА Боєголовки #1"
}

wep.ALPHA_CARD2 = {
	name = "Коди для АЛЬФА Боєголовки #2"
}

wep.COM_TAB = {
	name = "Планшет МОГ",
	loading = "Завантаження",
	eta = "ETA: ",
	detected = "Виялені суб'єкти:",
	tesla_deactivated = "Деактивовані Тесли: ",
	change = "ПКМ - змінити",
	confirm = "ЛКМ - підтвердити",
	options = {
		scan = "Сканування комплексу",
		tesla = "Запит на Тесла ворота"
	},
	actions = {
		scan = "Сканування комплекс...",
		tesla = "Вимкнення Тесла воріт...",
	}
}

wep.GOC_TAB = {
	name = "Планшет ГОК",
	info = "Персональний планшет ГОК. Містить невелику вибухівку, яка знищує планшет у разі смерті користувача",
	loading = "Завантаження",
	status = "Статус:",
	dist = "Відстань до цілі",
	objectives = {
		failed = "Пристрій знищено",
		nothing = "Невідомо",
		find = "Знайти пристрій",
		deliver = "Доставити пристрій",
		escort = "Супровід пристрою",
		protect = "Захист пристрою",
		escape = "Втеча"
	}
}

wep.GOCDEVICE = {
	name = "Пристрій ГОК",
	placing = "Розміщення пристрою ГОК..."
}

wep.DOCUMENT = {
	name = "Документи",
	info = "Пакет з кількох документів, які можуть містити цінну інформацію про SCP, комплекс та персонал",
	types = {

	}
}

wep.BACKPACK = {
	name = "Рюкзак",
	info = "Дозволяє носити більше речей",
	size = "Розмір: ",
	NAMES = {
		small = "Малий Рюкзак",
		medium = "Середній Рюкзак",
		large = "Величезний Рюкзак",
		huge = "Гігантський Рюкзак",
	}
}

wep.ADRENALINE = {
	name = "Адреналін",
	info = "Забезпечує миттєве підвищення витривалості на короткий час",
}

wep.ADRENALINE_BIG = {
	name = "Велика доза Адреналіну",
	info = "Забезпечує миттєвий приріст витривалості на значний проміжок часу",
}

wep.MORPHINE = {
	name = "Морфін",
	info = "Забезпечує тимчасовий приріст здоров'я, яке з часом зменшується",
}

wep.MORPHINE_BIG = {
	name = "Велика доза Морфіну",
	info = "Забезпечує багато тимчасового здоров'я, яке з часом зменшується",
}

wep.TASER = {
	name = "Електрошокер"
}

wep.PIPE = {
	name = "Металева труба"
}

wep.GLASS_KNIFE = {
	name = "Ніж зі скла"
}

wep.CLOTHES_CHANGER = {
	name = "Маскувальний набір (Руки)",
	info = "Для інших це звичайні руки. Додатково дозволяє красти одяг з мертвих тіл. Дивіться на мертве тіло і утримуйте ЛКМ, щоб використати",
	skill = "Маскування",
	wait = "Почекайте",
	ready = "Готово",
	id_time = "Залишок часу викраденого ID",
	progress = "Перевдягання",
	vest = "Зніміть бронежилет, щоб переодягнутися"
}

wep.DOOR_BLOCKER = {
	name = "Блокувальник дверей",
	info = "Наведіть на кнопку та утримуйте ЛКМ для заряджання. Відпустіть ЛКМ, щоб розрядити і тимчасово заблокувати двері",
	skill = "Блокувальник дверей",
	wait = "Почекайте",
	ready = "Готово",
	progress = "Заряджання"
}

wep.SNAV = {
	name = "S-NAV",
	low_battery = "Низький заряд",
	no_signal = "Нема сигналу",
}

wep.SNAV_ULT = {
	name = "S-NAV ULTIMATE",
	showname = "S-NAV+",
	low_battery = "Низький заряд",
	no_signal = "Нема сигналу",
}

wep.__slc_ammo = "Набої"

wep.CROWBAR = {
	name = "Лом",
}
wep.STUNSTICK = {
	name = "Електро-Кийок",
}
