local lang = LANGUAGE

--[[-------------------------------------------------------------------------
NRegistry
---------------------------------------------------------------------------]]
lang.NRegistry = {
	scpready = "Ви можете стати SCP в наступному раунді",
	scpwait = "Вам необхідно почекати %i раундів щоб стати SCP",
	abouttostart = "Гра розпочнеться через %i секунд!",
	kill = "Ви отримали %d балів за вбивство %s: %s!",
	kill_n = "Ви вбили %s: %s!",
	assist = "Ви отримали %d балів за допомогу у вбивстві: %s!",
	rdm = "Ви втратили %d балів за вбивство %s: %s!",
	acc_denied = "У доступі відмовлено",
	acc_granted = "Доступ дозволено",
	acc_omnitool = "Вам потрібен Omnitool, щоб маніпулювати цими дверима",
	device_noomni = "Вам потрібен Omnitool, щоб маніпулювати цим пристроєм",
	elevator_noomni = "Вам потрібен Omnitool, щоб маніпулювати цим ліфтом",
	acc_wrong = "Потрібен вищий доступ для цієї дії",
	rxpspec = "Ви отримали %i досвіду за гру на цьому сервері!",
	rxpplay = "Ви отримали %i досвіду за те, що залишились живими в цьому раунді!",
	rxpplus = "Ви отримали %i досвіду за те, що залишились живими більше половини раунду!",
	roundxp = "Ви отримали %i досвіду за ваші бали",
	gateexplode = "Часу до детонації Воріт А: %i",
	explodeterminated = "Ворота А було рознесено вщент",
	r106used = "SCP-106 можна стримати тільки один раз за раунд",
	r106eloiid = "Вимкніть електромагніт ELO-IID щоб почати процедуру стримання SCP-106",
	r106sound = "Увімкніть передачу звуку щоб розпочати процедурустримання SCP-106",
	r106human = "В клітці повинна знаходитись жива людина щоб розпочати процедуру стримання SCP-106",
	r106already = "SCP-106 вже стримано",
	r106success = "Ви отримали %i балів за стримання SCP-106!",
	vestpickup = "Ви одягнули бронежилет",
	vestdrop = "Ви зняли бронежилет",
	hasvest = "У вас вже є бронежилет! Викиньте його через інвентар",
	escortpoints = "Ви отримали %i балів за супровід союзників",
	femur_act = "Ламач кісток активовано...",
	levelup = "Підвищення! Ваш новий рівень: %i",
	healplayer = "Ви отримали %i балів за лікування інших гравців",
	detectscp = "Ви отримали %i балів за виявлення SCP",
	winxp = "Ви отримали %i досвіду за перемогу вашої першої команди",
	winalivexp = "Ви отримали %i досвіду за перемогу вашої поточної команди",
	upgradepoints = "Ви отримали бали покращення! Натисніть '%s' щоб відкрити меню покращень SCP",
	omega_detonation = "Детонація боєголовки ОМЕГА через %i секунд. Негайно тікайте на поверхню або до сховища!",
	alpha_detonation = "Детонація боєголовки АЛЬФА через %i секунд. Повертайтесь в комплекс або пройдіть до зони евакуації!",
	alpha_card = "Ви вставили ядерний диск АЛЬФА боєголовки",
	destory_scp = "Ви отримали %i балів за ліквідацію SCP!",
	afk = "Ви в АФК. Ви не отримуватиме досвід та не зможете відродитись!",
	afk_end = "Ви більше не в АФК",
	overload_cooldown = "Почекайте %i секунд для перегрузки цих дверей!",
	advanced_overload = "Ці двері міцніші! Спробуйте знову через %i секунд",
    lockdown_once = "Блокування об'єкта може бути активовано лише один раз за раунд!",
	dailybonus = "Залишок щоденного бонусу: %i XP\nНаступне скидання через: %s",
	xp_goc_device = "Ви отримали %i XP за успішне розгортання пристрою GOC!",
	goc_device_destroyed = "Ви отримали %i очок за знищення пристрою GOC!",
	goc_detonation = "Детонація боєголовок OMEGA та ALPHA через %i секунд. Прямуйте до евакуації або негайно займіть місце в укритті!",
	fuserating = "Вам потрібен запобіжник з вищим рейтингом!",
	nofuse = "Вам потрібен запобіжник для використання цього пристрою",
	cantremfuse = "Запобіжник перегрівається – він занадто гарячий, щоб витягнути!",
	fusebroken = "Запобіжник зламаний і заварений на місці!",
	nopower = "Ви натиснули кнопку, але нічого не сталося...",
	nopower_omni = "Ви піднесли омнітул до зчитувача, але нічого не сталося...",
	docs = "Ви отримали %i очок за втечу з %i документами",
	docs_pick = "Ви знайшли цінні документи Фонду SCP – втечіть із ними, щоб отримати винагороду!",
	gaswarn = "%s дезактивація через 60 секунд",
	queue_alive = "Ви живі",
	queue_not = "Вас немає в черзі підтримки!",
	queue_low = "Ви у черзі підтримки з низьким пріоритетом!",
	queue_pos = "Ваша позиція в черзі підтримки: %i",
	support_optout = "Ви не з'явилися як підтримка, тому що відмовилися від цього. Ви можете змінити це в !settings",
	zombie_optout = "Ви не з'явилися як SCP-049-2, тому що відмовилися від цього. Ви можете змінити це в !settings",
	preparing_classd = "Ви були створені як Class D, оскільки приєдналися під час підготовки. Ви можете змінити це в !settings",
	property_dmg = "Ви втратили %d очок за знищення майна Фонду!",
	unknown_cmd = "Невідома команда: %s",
	tailor_success = "Ви успішно вкрали ID. Будьте обережні, він скоро втратить чинність!",
	tailor_fail = "Ви не змогли знайти дійсний ID на тілі!",
	tailor_end = "Ваш вкрадений ID втратив чинність!",
}

lang.NFailed = "Не вдалося отримати доступ до NRegistry за ключем: %s"

--[[-------------------------------------------------------------------------
NCRegistry
---------------------------------------------------------------------------]]
lang.NCRegistry = {
	escaped = "Ви втекли!",
	escapeinfo = "Гарна робота! Ви втекли за %s",
	escapexp = "Ви отримали %i досвіду",
	escort = "Вас супроводили!",
	roundend = "Раунд завершено!",
	nowinner = "У цьому раунді немає переможця!",
	roundnep = "Недостатньо гравців!",
	roundwin = "Переможець раунду: %s",
	roundwinmulti = "Переможці раунду: [RAW]",
	shelter_escape = "Ви вижили під час вибуху в укритті",
	alpha_escape = "Ви втекли до детонації боєголовки",

	mvp = "MVP: %s з рахунком: %i",
	stat_kill = "Вбито гравців: %i",
	stat_rdm = "RDM вбивства: %i",
	stat_rdmdmg = "RDM шкода: %i",
	stat_dmg = "Завдано шкоди: %i",
	stat_bleed = "Шкода від кровотечі: %i",
	stat_106recontain = "SCP-106 було стримано",
	stat_escapes = "Гравці, що втекли: %i",
	stat_escorts = "Супроводжено гравців: %i",
	stat_023 = "Гравців убито SCP-023: %i",
	stat_049 = "Гравців вилікувано SCP-049: %i",
	stat_0492 = "Гравців роздерли зомбі: %i",
	stat_058 = "Гравців убито SCP-058: %i",
	stat_066 = "Шедеври, зіграні SCP-066: %i",
	stat_096 = "Гравців убито SCP-096: %i",
	stat_106 = "Гравців телепортовано до Кишенькового Виміру: %i",
	stat_173 = "Переламані шиї: %i",
	stat_457 = "Гравців спалено живцем: %i",
	stat_682 = "Гравців убито перевищеним рептилієм: %i",
	stat_8602 = "Гравців убито SCP-860-2: %i",
	stat_939 = "Жертви SCP-939: %i",
	stat_966 = "Гравців приспано: %i",
	stat_3199 = "Убивства SCP-3199: %i",
	stat_24273 = "Людей засуджено SCP-2427-3: %i",
	stat_omega_warhead = "Боєголовка OMEGA була детонована",
	stat_alpha_warhead = "Боєголовка ALPHA була детонована",
	stat_goc_warhead = "Пристрій GOC був активований",
}

lang.NCFailed = "Не вдалося отримати доступ до NCRegistry за ключем: %s"

--[[-------------------------------------------------------------------------
Головне меню
---------------------------------------------------------------------------]]
local main_menu = {}
lang.MenuScreen = main_menu

main_menu.start = "Грати"
main_menu.settings = "Налаштування"
main_menu.precache = "Попереднє завантаження моделей"
main_menu.credits = "Автори"
main_menu.quit = "Вийти"

main_menu.quit_server = "Вийти з сервера?"
main_menu.quit_server_confirmation = "Ви впевнені?"
main_menu.model_precache = "Попереднє завантаження моделей"
main_menu.model_precache_text = "Моделі завантажуються автоматично за необхідності, але це відбувається під час гри, що може викликати підвисання. Щоб уникнути цього, ви можете завантажити їх зараз вручну.\nГра може зависнути під час цього процесу!"
main_menu.yes = "Так"
main_menu.no = "Ні"
main_menu.all = "Попереднє завантаження всіх моделей"
main_menu.cancel = "Скасувати"


main_menu.credits_text = [[Ігровий режим створений ZGFueDkx (aka danx91)
Режим заснований на SCP та випущений під ліцензією CC BY-SA 3.0

Анімації меню створив Madow

Моделі:
	Alski - охоронці, омнітул, турель та інше
	Slusher - SCP-689, двері, планшет та інше

Матеріали:
	Foer - логотип для майстерні та деякі інші графічні елементи
	SCP Containment Breach

Звуки:
	SCP Containment Breach

Основні перекладачі:
	Китайська - xiaobai
	Німецька - Justinnn
	Корейська - joon00
	Польська - Slusher, Alski
	Турецька - Akane

Особлива подяка:
	1000 Shells за допомогу з моделями
	PolishLizard за хостинг тестового сервера
]]

--[[-------------------------------------------------------------------------
HUD
---------------------------------------------------------------------------]]
local hud = {}
lang.HUD = hud

hud.pickup = "Підняти"
hud.class = "Клас"
hud.team = "Команда"
hud.class_points = "Бали відкриття класів"
hud.prestige_points = "Бали престижу"
hud.hp = "ЗДОРОВ'Я"
hud.stamina = "ВИТРИВАЛІСТЬ"
hud.sanity = "ЗДОРОВИЙ ГЛУЗД"
hud.xp = "ДОСВІД"
hud.extra_hp = "Додаткове здоров'я"

hud.escaping = "Втеча..."
hud.escape_blocked = "Вихід заблоковано!"
hud.waiting = "Очікування гравців"

--[[-------------------------------------------------------------------------
EQ
---------------------------------------------------------------------------]]
local eq = {}
lang.EQ = eq

eq.eq = "Інвентар"
eq.actions = "Дії"
eq.backpack = "Рюкзак"
eq.id = "Це ваше ID, покажіть його іншим, щоб розкрити свій клас і команду"
eq.no_id = "У вас немає ID"
eq.class = "Ваш клас: "
eq.team = "Ваша команда: "
eq.p_class = "Ваш підроблений клас: "
eq.p_team = "Ваша підроблена команда: "
eq.allies = "Ваші союзники:"
eq.durability = "Міцність: "
eq.mobility = "Мобільність: "
eq.weight = "Вага: "
eq.weight_unit = "КГ"
eq.multiplier = "Множник шкоди:"
eq.count = "Кількість"

lang.eq_unknown = "Невідомий предмет"
lang.durability = "Міцність"
lang.info = "Інформація"

lang.eq_buttons = {
	escort = "Супроводити",
	gatea = "Знищити Ворота A"
}

lang.pickup_msg = {
	max_eq = "Ваш інвентар заповнений!",
	cant_stack = "Ви не можете нести більше цього предмета!",
	has_already = "У вас вже є цей предмет!",
	same_type = "У вас вже є предмет цього типу!",
	one_weapon = "Ви можете носити лише одну вогнепальну зброю одночасно!",
	goc_only = "Це можуть підняти лише члени ГОК!"
}

--[[-------------------------------------------------------------------------
XP Bar
---------------------------------------------------------------------------]]
lang.XP_BAR = {
	general = "Загальний досвід",
	round = "Перебування на сервері",
	escape = "Втеча з об'єкта",
	score = "Досвід, зароблений під час раунду",
	win = "Перемога в раунді",
	vip = "Бонус VIP",
	daily = "Щоденний бонус",
	cmd = "Божественний бонус",
}

--[[-------------------------------------------------------------------------
AFK Warning
---------------------------------------------------------------------------]]
lang.AFK = {
	afk = "Ви у режимі AFK!",
	afk_warn = "Попередження AFK",
	slay_warn = "Вас скоро буде вбито і позначено як AFK!",
	afk_msg = "Ви не зможете відродитися або отримувати XP з часом!",
	afk_action = "-- Натисніть будь-яку кнопку, щоб повернутися до активності --",
}

--[[-------------------------------------------------------------------------
Effects
---------------------------------------------------------------------------]]
local effects = {}
lang.EFFECTS = effects

effects.permanent = "Постійний"
effects.bleeding = "Кровотеча"
effects.doorlock = "Блокування дверей"
effects.amnc227 = "AMN-C227"
effects.insane = "Божевілля"
effects.gas_choke = "Задуха"
effects.radiation = "Радіація"
effects.deep_wounds = "Глибокі рани"
effects.poison = "Отруєння"
effects.heavy_bleeding = "Сильна кровотеча"
effects.light_bleeding = "Легка кровотеча"
effects.spawn_protection = "Захист при появі"
effects.fracture = "Перелом"
effects.decay = "Розпад"
effects.scp_chase = "Переслідування"
effects.human_chase = "Переслідування"
effects.expd_all = "Експериментальний ефект"
effects.expd_recovery = "Відновлення"
effects.electrical_shock = "Електрошок"
effects.scp009 = "SCP-009"
effects.scp106_withering = "Згасання"
effects.scp966_effect = "Втома"
effects.scp966_mark = "Мітка смерті"

--[[-------------------------------------------------------------------------
Class viewer
---------------------------------------------------------------------------]]
lang.classviewer = "Перегляд класів"
lang.preview = "Попередній перегляд"
lang.random = "Випадковий"
lang.buy = "Купити"
lang.buy_prestige = "Купити - Престиж"
lang.refund = "Повернути"
lang.prestige = "Престиж"
lang.prestige_warn = "Ви збираєтеся підвищити престиж. Цей процес скине ваш рівень, XP, очки відкриття класів та розблоковані класи, а також ви отримаєте 1 очко престижу.\n\nУВАГА: Цю дію неможливо скасувати!"
lang.none = "Немає"
lang.refunded = "Усі видалені класи повернені. Ви отримали %d очок класу та %d очок престижу!"
lang.tierlocked = "Ви повинні купити всі класи з попередніх рівнів, щоб розблокувати класи цього рівня (а також класи з інших категорій)"
lang.xp = "Досвід (XP)"
lang.level = "Рівень"

lang.details = {
	details = "Деталі",
	prestige = "Нагорода за престиж",
	name = "Ім'я",
	tier = "Рівень",
	team = "Команда",
	walk_speed = "Швидкість ходьби",
	run_speed = "Швидкість бігу",
	chip = "Ключ доступу",
	persona = "Підроблене ID",
	loadout = "Основна зброя",
	weapons = "Предмети",
	class = "Клас",
	hp = "Здоров'я",
	speed = "Швидкість",
	health = "Здоров'я",
	sanity = "Глузд",
	slots = "Слоти підтримки",
	no_select = "Неможливо з'явитися в цьому раунді"
}

lang.headers = {
	support = "ПІДТРИМКА",
	classes = "КЛАСИ",
	scp = "SCP"
}

lang.view_cat = {
	classd = "Клас D",
	sci = "Вчені",
	guard = "Служба Безпеки",
	mtf_ntf = "МОГ Епсілон-11",
	mtf_alpha = "МОГ Альфа-1",
	ci = "Повстанці Хаосу",
	goc = "ГОК",
}

local l_weps = {
	pistol = "пістолет",
	smg = "ПК",
	rifle = "гвинтівка",
	shotgun = "дробовик",
	sniper = "снайперська гвинтівка",
}

local l_tiers = {
	low = "Низький рівень",
	mid = "Середній рівень",
	high = "Високий рівень",
}

lang.loadouts = {
	grenade = "Випадкова граната",
	pistol_all = "Випадковий пістолет",
	smg_all = "Випадковий ПК",
	rifle_all = "Випадкова гвинтівка",
	shotgun_all = "Випадковий дробовик",
}

for k_wep, wep in pairs( l_weps ) do
	for k_tier, tier in pairs( l_tiers ) do
		lang.loadouts[k_wep.."_"..k_tier] = tier.." "..wep
	end
end

--[[-------------------------------------------------------------------------
Settings
---------------------------------------------------------------------------]]
lang.settings = {
	settings = "Налаштування ігрового режиму",

	none = "НІЧОГО",
	press_key = "> Натисніть клавішу <",
	client_reset = "Скинути налаштування клієнта",
	server_reset = "Скинути налаштування сервера",

	client_reset_desc = "Ви збираєтеся скинути УСІ свої налаштування у цьому ігровому режимі.\nЦю дію неможливо скасувати!",
	server_reset_desc = "З міркувань безпеки ви не можете скинути налаштування сервера тут.\nЩоб скинути сервер до стандартних налаштувань, введіть 'slc_factory_reset' у консолі сервера і дотримуйтесь інструкцій.\nБудьте уважні, ця дія незворотна і скине ВСЕ!",

	popup_ok = "ГАРАЗД",
	popup_cancel = "СКАСУВАТИ",
	popup_continue = "ПРОДОВЖИТИ",

	enabled = "Увімкнено",
	resource_warn = "Через особливості роботи матеріалів у Garry's Mod, зміни будуть застосовані після повторного підключення до сервера.",

	panels = {
		binds = "Прив'язки клавіш",
		general_config = "Загальні налаштування",
		hud_config = "Налаштування HUD",
		performance_config = "Продуктивність",
		scp_config = "Налаштування SCP",
		skins = "Скіни інтерфейсу",
		resource_packs = "Пакети ресурсів",
		reset = "Скидання режиму",
		cvars = "Редактор ConVar",
	},

	binds = {
		eq_button = "Екіпірування",
		upgrade_tree_button = "Дерево покращень SCP",
		ppshop_button = "Перегляд класів",
		settings_button = "Налаштування ігрового режиму",
		scp_special = "Особлива здатність SCP"
	},

	config = {
		search_indicator = "Показувати індикатор пошуку",
		scp_hud_skill_time = "Показувати перезарядку здібностей SCP",
		smooth_blink = "Увімкнути плавне моргання",
		scp_hud_overload_cd = "Показувати перезарядку перевантаження",
		any_button_close_search = "Будь-яка кнопка закриває меню пошуку",
		hud_hitmarker = "Показувати хитмаркери",
		hud_hitmarker_mute = "Вимкнути звук хітмаркерів",
		hud_damage_indicator = "Показувати індикатор отриманої шкоди",
		scp_hud_dmg_mod = "Показувати множник отриманої шкоди SCP",
		scp_nvmod = "Збільшувати яскравість екрана при грі за SCP",
		dynamic_fov = "Динамічний FOV",
		hud_draw_crosshair = "Малювати приціл",
		hud_hl2_crosshair = "Класичний приціл HL2",
		hud_lq = "Зображення та полігони низької якості (якщо можливо)",
		hud_image_poly = "Зображення замість полігонів (якщо можливо)",
		hud_windowed_mode = "Зсув HUD (для віконного режиму)",
		hud_avoid_roman = "Уникати римських цифр",
		hud_escort = "Показувати зони супроводу",
		hud_timer_always = "Завжди показувати таймер",
		hud_stamina_always = "Завжди показувати витривалість",
		eq_instant_desc = "Миттєвий опис предметів у екіпіруванні",
		scp106_spots = "Завжди показувати точки телепортації SCP-106",

		cvar_slc_support_optout = "Відмова від ролі підтримки",
		cvar_slc_zombie_optout = "Відмова від ролі SCP-049-2",
		cvar_slc_preparing_classd = "З'являтися як Class D при підключенні під час підготовки",
		cvar_slc_language = "Мова",
		cvar_slc_language_options = {
			default = "За замовчуванням",
		},
		cvar_slc_hud_scale = "Масштаб HUD",
		cvar_slc_hud_scale_options = {
			normal = "Звичайний",
			big = "Великий",
			vbig = "Дуже великий",
			small = "Малий",
			vsmall = "Дуже малий",
			imretard = "Мікроскопічний",
		},

		hud_skin_main = "Основний",
		hud_skin_scoreboard = "Табло рахунку",
		hud_skin_hud = "HUD",
		hud_skin_eq = "Екіпірування",

		hud_skin_main_options = {
			custom = "Користувацький",
			default = "За замовчуванням",
			legacy = "Класичний",
		}
	},
}

lang.gamemode_config = {
	loading = "Завантаження...",

	categories = {
		general = "Загальне",
		round = "Раунд",
		xp = "XP",
		support = "Підтримка",
		warheads = "Боєголовки",
		afk = "AFK",
		time = "Час",
		premium = "Преміум",
		scp = "SCP",
		gas = "Газ",
		feature = "Особливості",
		minigames = "Міні-ігри",
	}
}

--[[-------------------------------------------------------------------------
Scoreboard
---------------------------------------------------------------------------]]
lang.unconnected = "Не підключений"

lang.scoreboard = {
	name = "Таблиця рахунку",
	playername = "Ім'я",
	ping = "Пінг",
	level = "Рівень",
	score = "Досвід",
	ranks = "Ранги",
	badges = "Значки",
}

lang.scoreboard_actions = {
	copy_name = "Копіювати ім'я",
	copy_sid = "Копіювати SteamID",
	copy_sid64 = "Копіювати SteamID64",
	open_profile = "Відкрити профіль Steam",
}

lang.ranks = {
	superadmin = "Суперадмін",
	admin = "Адміністратор",
	author = "Автор",
	vip = "VIP",
	contributor = "Спонсор",
	translator = "Перекладач",
	tester = "Тестувальник",
	patron = "Патрон",
	hunter = "Мисливець за багами",
}

--[[-------------------------------------------------------------------------
Покращення
---------------------------------------------------------------------------]]
lang.upgrades = {
	tree = "%s ДЕРЕВО ПОКРАЩЕНЬ",
	points = "Очки",
	cost = "Вартість",
	owned = "Придбано",
	requiresall = "Потрібно",
	requiresany = "Потрібно хоча б одне",
	blocked = "Заблоковано через",
}

--[[-------------------------------------------------------------------------
SCP HUD
---------------------------------------------------------------------------]]
lang.SCPHUD = {
	skill_not_ready = "Здібність на перезарядці!",
	skill_cant_use = "Здібність зараз неможливо використати!",
	overload_cd = "Наступне перевантаження: ",
	overload_ready = "Перевантаження готове!",
	damage_scale = "Отримана шкода",
}

--[[-------------------------------------------------------------------------
Екран інформації
---------------------------------------------------------------------------]]
lang.info_screen = {
	subject = "Суб'єкт",
	class = "Клас",
	team = "Команда",
	status = "Статус",
	objectives = "Завдання",
	details = "Деталі",
	registry_failed = "Помилка отримання даних info_screen_registry",
}

lang.info_screen_registry = {
	escape_time = "Ви втекли за %s хвилин",
	escape_xp = "Ви отримали %s досвіду",
	escape1 = "Ви втекли з об'єкта",
	escape2 = "Ви втекли під час зворотного відліку Альфа боєголовки",
	escape3 = "Ви вижили в укритті",
	escorted = "Вас супроводили",
	killed_by = "Вас убив: %s",
	suicide = "Ви вчинили самогубство",
	unknown = "Причина вашої смерті невідома",
	hazard = "Вас убила небезпека",
	alpha_mia = "Останнє відоме місцезнаходження: Поверхня",
	omega_mia = "Останнє відоме місцезнаходження: Комплекс",
	scp914_death = "Ваше серце зупинилося через SCP-914",
	killer_t = "Команда вашого вбивці: %s",
}

lang.info_screen_type = {
	alive = "Живий",
	escaped = "Втік",
	dead = "Загиблий",
	mia = "Зник безвісти",
	unknown = "Невідомий",
}

--[[-------------------------------------------------------------------------
Загальні фрази
---------------------------------------------------------------------------]]
lang.nothing = "Нічого"
lang.exit = "Вийти"
lang.default = "За замовчуванням"
lang.yes = "Так"
lang.no = "Ні"

--[[-------------------------------------------------------------------------
Різне
---------------------------------------------------------------------------]]
local misc = {}
lang.MISC = misc

misc.escort_zone = "Зона супроводу"

misc.content_checker = {
	title = "Контент ігрового режиму",
	status = "Статус",
	auto_check = "Перевіряти автоматично",
	slist = {
		"Вимкнено",
		"Перевірка",
		"Монтування",
		"Завантаження",
		"Готово",
	},
	btn_workshop = "Колекція в Мастерні",
	btn_download = "Завантажити",
	btn_check = "Перевірити та завантажити",
	allok = "Усі додатки встановлені!",
	nsub_warn = "У вас немає деяких необхідних додатків! Ми завантажили та змонтували їх, але будь ласка, завантажте їх через Steam Workshop. Перевірте консоль, щоб побачити, яких додатків бракує.",
	disabled_warn = "Деякі з необхідних додатків вимкнено! Ігровий режим змонтував їх для вас, але деякий контент все ще може бути відсутнім. Перейдіть у меню та увімкніть вимкнені додатки (список у консолі).",
	missing = "Відсутні додатки",
	disabled = "Вимкнені додатки",
}

misc.omega_warhead = {
	idle = "Боєголовка OMEGA в очікуванні\n\nОчікування введення...",
	waiting = "Боєголовка OMEGA в очікуванні\n\nВведення прийнято!\nОчікування другого введення...",
	failed = "Боєголовка OMEGA заблокована\n\nДругий ввід не виявлено!\nЗачекайте %is",
	no_remote = "Помилка активації OMEGA\n\nНе вдалося встановити зв'язок з боєголовкою!\t",
	active = "Боєголовка OMEGA активована\n\nНегайно евакуюйтеся!\nДетонація через %.2fs",
}

misc.alpha_warhead = {
	idle = "Боєголовка ALPHA в очікуванні\n\nОчікування ядерних кодів...",
	ready = "Боєголовка ALPHA в очікуванні\n\nКоди прийняті!\nОчікування активації...",
	no_remote = "Помилка активації ALPHA\n\nНе вдалося встановити зв'язок з боєголовкою!\t",
	active = "Боєголовка ALPHA активована\n\nНегайно евакуюйтеся!\nДетонація через %.2fs",
}

misc.intercom = {
	name = "Інтерком",
	idle = "Інтерком неактивний",
	active = "Інтерком активний\n\nЗалишок часу: %is",
	cooldown = "Інтерком на перезарядці\n\nЗалишок часу: %is",
}

misc.zones = {
	lcz = "ЛЗС",
	hcz = "ТЗС",
	ez = "ОЗ",
}

misc.buttons = {
	MOUSE1 = "ЛКМ",
	MOUSE2 = "ПКМ",
	MOUSE3 = "СКМ",
}

misc.inventory = {
	unsearched = "Не обшукано",
	search = "Натисніть [%s], щоб обшукати",
	unknown_chip = "Невідомий чіп",
	name = "Ім'я",
	team = "Команда",
	death_time = "Час смерті",
	time = {
		[0] = "Щойно",
		"Близько хвилини тому",
		"Близько двох хвилин тому",
		"Близько трьох хвилин тому",
		"Близько чотирьох хвилин тому",
		"Близько п’яти хвилин тому",
		"Близько шести хвилин тому",
		"Близько семи хвилин тому",
		"Близько восьми хвилин тому",
		"Близько дев’яти хвилин тому",
		"Близько десяти хвилин тому",
		long = "Більше десяти хвилин тому",
	},
}

misc.font = {
	name = "Шрифти",
	content = [[
Користувацький шрифт ігрового режиму не вдалося завантажити! Використовується системний шрифт...
Це проблема Garry's Mod, і я не можу її виправити. Щоб вирішити її самостійно, потрібно вручну видалити кілька файлів.
Перейдіть у 'steamapps/common/GarrysMod/garrysmod/cache/workshop/resource/fonts' і видаліть наступні файли: 'impacted.ttf', 'ds-digital.ttf' та 'unispace.ttf']],
	ok = "Гаразд",
}

misc.commands_aliases = {
	["admin"] = "adminmode",
	["daily"] = "bonus",
	["mute"] = "muteall",
	["unmute"] = "unmuteall",
	["config"] = "settings",
	["cfg"] = "settings",
	["mines"] = "minigames",
}

--[[-------------------------------------------------------------------------
Minigames - Global
---------------------------------------------------------------------------]]
local minigames = {}
lang.minigames = minigames

--[[-------------------------------------------------------------------------
Snake
---------------------------------------------------------------------------]]
local snake = {}
minigames.snake = snake

snake.score = "Рахунок"
snake.high_score = "Рекорд"
snake.game_over = "Гру закінчено!"
snake.paused = "Приготуйтесь!"
snake.info = "Натисніть W, A, S або D, щоб почати"
snake.restart = "Натисніть пробіл для рестарту"
