local lang = LANGUAGE
local wep = LANGUAGE.WEAPONS

--[[-------------------------------------------------------------------------
SCPs
---------------------------------------------------------------------------]]
lang.GenericUpgrades = {
	outside_buff = {
		name = "Любитель почіпати траву.",
		info = "Отримайте додатковий захист від куль і можливість регенерації на поверхні.\n\t• Додатковий захист від куль: [%def]\n\t• Додатковий захист від пласких куль: [flat] dmg\n\t• Опинившись на поверхні, за короткий час зцілює на [buff_hp] HP\n\t• Коли не в бою швидко відновлює [%regen_min] - [%regen_max] (в масштабі часу) отриманої шкоди від куль\n\t• Нанесення шкоди зцілює вас протягом [%heal_min] - [%heal_max] (в масштабі часу) від нанесеної шкоди\n\t• Повернення до комплексу анулює всі активні зцілення"
	}
}

lang.CommonSkills = {
	c_button_overload = {
		name = "Перевантаження",
		dsc = "Дозволяє перевантажити більшість замкнених дверей. Перевантажені двері відчиняються (або зачиняються) на короткий проміжок часу"
	},
	c_dmg_mod = {
		name = "Захист від пошкоджень",
		dsc = "Поточний захист: [mod]\nПоточний захист: [flat]\n\nЦе захист від отриманої непрямої шкоди. Він враховує лише модифікатори часу та зовнішнє покращення. Специфічні модифікатори SCP не включені!\n\nЗовнішнє покращення: [buff]",
		dmg = "ШКОДА",
		not_bought = "Не куплено.",
		not_surface = "Не працює всередині комплексу",
		buff = "\n   • Поточне відновлення: %s від отриманих кульових пошкоджень\n   • Поточне зцілення: %s від завданої шкоди",
	},
}

wep.SCP023 = {
	skills = {
		_overview = { "passive", "drain", "clone", "hunt" },
		drain = {
			name = "Виснаження витривалості",
			dsc = "Почніть виснажувати найближчих гравців. Якщо всі гравці залишають зону, здатність миттєво йде на перезарядку",
		},
		clone = {
			name = "Мімік",
			dsc = "Розмістіть міміка, який імітуватиме роботу вашої пасивки (включаючи покращення). Він буде блукати і переслідувати гравців поблизу",
		},
		hunt = {
			name = "Полювання",
			dsc = "Миттєво вбиває вашу здобич або людей поруч із нею, і переміщає вас до її тіла",
		},
		passive = {
			name = "Пасивна здібність",
			dsc = "Зіткнення з гравцями підпалює їх. Ви також не можете зіткнутися з дверима",
		},
		drain_bar = {
			name = "Виснаження",
			dsc = "Залишковий час виснаження",
		},
	},

	upgrades = {
		parse_description = true,

		passive = {
			name = "Розпечене Вугілля",
			info = "Покращує вашу пасивну здатність, збільшуючи шкоду від горіння на [+burn_power]",
		},
		invis1 = {
			name = "Невидиме Полум'я I",
			info = "Покращує вашу пасивну здібність\n\t• Ви зникаєте для віддалених гравців\n\t• Гравці, які не бачать вас, не будуть додані до списку здобичі\n\t• Це оновлення також застосовується до вашого міміка\n\t• Ви стаєте повністю невидимим на відстані [invis_range] одиниць від вас",
		},
		invis2 = {
			name = "Невидиме Полум'я II",
			info = "Покращує вашу невидимість\n\t• Ви стаєте повністю невидимим на відстані [invis_range] одиниць",
		},
		prot1 = {
			name = "Безсмертний Вогонь I",
			info = "Посилює вашу пасивну здатність, надаючи [-prot] захист від куль",
		},
		prot2 = {
			name = "Безсмертний Вогонь II",
			info = "Підвищує захист від куль до [-prot]",
		},
		drain1 = {
			name = "Виснаження Сил I",
			info = "Покращує вашу здатність виснажувати\n\t• Тривалість збільшена на [+drain_dur]\n\t• Максимальна відстань збільшена на [+drain_dist]",
		},
		drain2 = {
			name = "Виснаження Сил II",
			info = "Покращує вашу здатність виснажувати\n\t• Тривалість збільшена в [/drain_rate]\n\t• Зцілити на [%drain_heal] вкрадену витривалість",
		},
		drain3 = {
			name = "Виснаження Сил III",
			info = "Покращує вашу здатність виснажувати\n\t• Тривалість збільшена на [+drain_dur]\n\t• Максимальна відстань збільшена на [+drain_dist]",
		},
		drain4 = {
			name = "Виснаження Сил IV",
			info = "Покращує вашу здатність виснажувати\n\t• Тривалість збільшена в [/drain_rate]\n\t• Зцілити на [%drain_heal] вкрадену витривалість",
		},
		hunt1 = {
			name = "Вічний Вогонь I",
			info = "Посилює вашу мисливську здібність\n\t• КД зменшено на [-hunt_cd]",
		},
		hunt2 = {
			name = "Вічний Вогонь II",
			info = "Посилює вашу мисливську здібність\n\t• КД зменшено на [-hunt_cd]\n\t• Радіус пошуку випадкової здобичі збільшено на [+hunt_range]",
		},
	}
}

wep.SCP049 = {
	zombies = {
		normal = "Стандартний Зомбі",
		assassin = "Зомбі-Марафонець",
		boomer = "Зомбі-Камікадзе",
		heavy = "Зомбі-Плювака",
	},
	zombies_desc = {
		normal = "Стандартний зомбі\n\t• Має як легку, так і важку атаки\n\t• Гідний вибір зі збалансованою статистикою",
		assassin = "Зомбі-Марафонець\n\t• Має швидшу легку атаку \n\t• Найшвидший, але має найнижчий рівень здоров'я та шкоди",
		boomer = "Важкий зомбі-камікадзе\n\t• Має потужну атаку та здатність до вибуху\n\t• Низька швидкість пересування, але високі показники здоров'я та шкоди",
		heavy = "Важкий зомбі-плювака\n\t• Має потужну атаку та здатність плюватися\n\t• Найповільніший тип зомбі, але має високу шкоду і найбільше здоров'я",
	},
	skills = {
		_overview = { "passive", "choke", "surgery", "boost" },
		surgery_failed = "Операція не вдалася!",

		choke = {
			name = "Лікарський Дотик",
			dsc = "Душить пацієнта до смерті. Ця здатність може бути перервана при отриманні достатньої кількості пошкоджень",
		},
		surgery = {
			name = "Хірургічна Операція",
			dsc = "Виконує операцію на тілі, перетворюючи його на екземпляр SCP-049-2. Отримання шкоди перериває операцію",
		},
		boost = {
			name = "Вставай!",
			dsc = "Забезпечує прискорення для вас і всіх прилеглих екземплярів SCP-049-2",
		},
		passive = {
			name = "Пасивна здібність",
			dsc = "Зомбі поблизу вас отримують захист від куль",
		},
		choke_bar = {
			name = "Лікарський Дотик",
			dsc = "Коли шкала заповнена, пацієнт гине",
		},
		surgery_bar = {
			name = "Хірургічна Операція",
			dsc = "Час, що залишився до завершення операції",
		},
		boost_bar = {
			name = "Вставай!",
			dsc = "Час, що залишився до завершення прискорення",
		},
	},

	upgrades = {
		parse_description = true,

		choke1 = {
			name = "Лікарський Дотик I",
			info = "Покращує удушення\n\t• КД зменшено на [-choke_cd]\n\t• Поріг пошкодження збільшено на [+choke_dmg]",
		},
		choke2 = {
			name = "Лікарський Дотик II",
			info = "Покращує удушення\n\t• Швидкість удушення збільшена на [+choke_rate]\n\t• Сповільнення після удушення зменшується на [-choke_slow]",
		},
		choke3 = {
			name = "Лікарський Дотик III",
			info = "Покращує удушення\n\t• КД зменшено на [-choke_cd]\n\t• Поріг пошкодження збільшено на [+choke_dmg]\n\t• Швидкість удушення збільшено на [+choke_rate]",
		},
		buff1 = {
			name = "Вставай I",
			info = "Покращує прискорення\n\t• КД зменшено на [-buff_cd]\n\t• Тривалість прискорення збільшено на [+buff_dur]",
		},
		buff2 = {
			name = "Вставай II",
			info = "Покращує прискорення\n\t• Радіус дії збільшено на [+buff_radius]\n\t• Потужність здібності збільшена на [+buff_power]",
		},
		surgery_cd1 = {
			name = "Хірургічна Точність I",
			info = "Скорочує час операції на [surgery_time]секунд\n\t• Це покращення зберігається",
		},
		surgery_cd2 = {
			name = "Хірургічна Точність II",
			info = "Скорочує час операції на [surgery_time] секунд\n\t• Це покращення зберігається",
		},
		surgery_heal = {
			name = "Трансплантація",
			info = "Покращує ваші хірургічні здібності\n\t• Після операції ви зцілюєтесь на [surgery_heal] HP\n\t• Після операції всі зомбі поблизу зцілюються на [surgery_zombie_heal] HP",
		},
		surgery_dmg = {
			name = "Нестримний Хірург",
			info = "Отримання шкоди більше не зупиняє операцію",
		},
		surgery_prot = {
			name = "Тверда Рука",
			info = "Під час операції отримує [-surgery_prot] захисту від куль",
		},
		zombie_prot = {
			name = "Медбрат",
			info = "Кожен SCP-049-2 поблизу отримує захист від куль\n\t• Захист для кожного зомбі поблизу: [%zombie_prot]\n\t• Максимальний захист: [%zombie_prot_max]",
		},
		zombie_lifesteal = {
			name = "Переливання Крові I",
			info = "Зомбі отримують [%zombie_ls] здоров'я від нанесення базових атак",
		},
		stacks_hp = {
			name = "Ін'єкція Стероїдів",
			info = "При створенні зомбі їхнє здоров'я збільшується на [%stacks_hp] за кожну попередню операцію",
		},
		stacks_dmg = {
			name = "Радикальна Терапія",
			info = "При створенні зомбі їхня шкода збільшується на [%stacks_dmg] за кожну попередню операцію",
		},
		zombie_heal = {
			name = "Переливання Крові II",
			info = "Ви зцілюєтеся на [%zombie_heal] від будь-якої шкоди, завданої зомбі поблизу",
		}
	}
}

wep.SCP0492 = {
	skills = {
		prot = {
			name = "Захист",
			dsc = "Ви отримуєте певний захист від пошкоджень, перебуваючи поблизу SCP-049",
		},
		boost = {
			name = "Прискорення",
			dsc = "Показує, коли у вас активне прискорення SCP-049",
		},
		light_attack = {
			name = "Легка Атака",
			dsc = "Здійснює легку атаку",
		},
		heavy_attack = {
			name = "Важка Атака",
			dsc = "Здійснює важку атаку",
		},
		rapid = {
			name = "Швидка Атака",
			dsc = "Здійснює швидку атаку",
		},
		shot = {
			name = "Плювок",
			dsc = "Здійснює плювок",
		},
		explode = {
			name = "Банзай!",
			dsc = "Можна активувати, коли у вас 50 HP або менше. Надає тимчасове безсмертя і прискорення. Через деякий час ви вибухнете, завдавши шкоди в невеликому радіусі",
		},
		boost_bar = {
			name = "Прискорення",
			dsc = "Залишок прискорення",
		},
		explode_bar = {
			name = "Банзай!",
			dsc = "Час, що залишився до вибуху",
		},
	},

	upgrades = {
		parse_description = true,

		primary1 = {
			name = "Первинна Атака I",
			info = "Покращує вашу основну атаку\n\t• КД зменшено на [-primary_cd]",
		},
		primary2 = {
			name = "Первинна Атака II",
			info = "Покращує вашу основну атаку\n\t• КД зменшено на [-primary_cd]\n\t• Шкоду збільшено на [+primary_dmg]",
		},
		secondary1 = {
			name = "Вторинна Атака I",
			info = "Покращує вашу вторинну атаку\n\t• Шкоду збільшено на [+secondary_dmg]",
		},
		secondary2 = {
			name = "Вторинна Атака II",
			info = "Покращує вашу вторинну атаку\n\t• Шкоду збільшено на [+secondary_dmg]\n\t• КД зменшено на [-secondary_cd]",
		},
		overload = {
			name = "Перевантаження",
			info = "Надає додаткові [overloads] перевантаження дверей",
		},
		buff = {
			name = "Вставай!",
			info = "Посилює ваш захист і прискорення SCP-049\n\t• Потужність захисту: [%+prot_power]\n\t• Покращення прискорення: [++buff_power]",
		},
	}
}

wep.SCP058 = {
	skills = {
		_overview = { "primary_attack", "shot", "explosion" },
		primary_attack = {
			name = "Основна Атака",
			dsc = "Атакує своїм жалом. Застосовується отрута, якщо придбано відповідне покращення",
		},
		shot = {
			name = "Постріл",
			dsc = "Стріляє снарядом у напрямку вашої цілі. Снаряд має балістичну фізику. Покращення, пов'язані з пострілом, впливають на перезарядку, швидкість, розмір та ефекти цієї здатності",
		},
		explosion = {
			name = "Кривавий Вибух",
			dsc = "Здійснює вибух зіпсованої крові, що завдає величезної шкоди цілям поблизу",
		},
		shot_stacks = {
			name = "Пострілів залишилось",
			dsc = "Показує збережену кількість пострілів. Різні оновлення впливають на максимальну кількість і час охолодження",
		},
	},

	upgrades = {
		parse_description = true,

		attack1 = {
			name = "Отруйне Жало I",
			info = "Додає отруту до основних атак"
		},
		attack2 = {
			name = "Отруйне Жало II",
			info = "Посилює шкоду атаки, отрути та зменшує час перезарядки\n\t• Додає [prim_dmg] шкоди до атак\n\t• Отрута від атаки завдає [pp_dmg] шкоди\n\t• Час перезарядки зменшується на [prim_cd] сек"
		},
		attack3 = {
			name = "Отруйне Жало III",
			info = "Посилює шкоду отрути та зменшує час перезарядки\n\t• Якщо ціль не отруєна, миттєво застосовує 2 рівні отрути\n\t• Отрута від атаки завдає [pp_dmg] шкоди\n\t• Час перезарядки зменшується на [prim_cd] сек"
		},
		shot = {
			name = "Заражена Кров",
			info = "Додає отруту до атак пострілами"
		},
		shot11 = {
			name = "Сплеск I",
			info = "Збільшує шкоду та розмір снаряда, але також збільшує час перезарядки та уповільнює снаряд\n\t• Шкода снаряда збільшена на [+shot_damage]\n\t• Зміна розміру снаряда: [++shot_size]\n\t• Зміна швидкості снаряда: [++shot_speed]\n\t• Час перезарядки збільшено на [shot_cd] сек"
		},
		shot12 = {
			name = "Сплеск II",
			info = "Збільшує шкоду та розмір снаряда, але також збільшує час перезарядки та уповільнює снаряд\n\t• Шкода снаряда збільшена на [+shot_damage]\n\t• Зміна розміру снаряда: [++shot_size]\n\t• Зміна швидкості снаряда: [++shot_speed]\n\t• Час перезарядки збільшено на [shot_cd] сек"
		},
		shot21 = {
			name = "Кривава Мла I",
			info = "Постріл залишає туман при зіткненні, який завдає шкоди та отруює всіх, хто його торкається.\n\t• Пряма та вибухова шкода прибрана\n\t• Хмара завдає [cloud_damage] шкоди при контакті\n\t• Отрута від хмари завдає [sp_dmg] шкоди\n\t• Ліміт стосів пострілу: [stacks]\n\t• Час перезарядки збільшено на [shot_cd] сек\n\t• Швидкість набору стосів: [/+regen_rate]"
		},
		shot22 = {
			name = "Кривава Мла II",
			info = "Посилює туман, залишений після пострілів.\n\t• Хмара завдає [cloud_damage] шкоди при контакті\n\t• Отрута від хмари завдає [sp_dmg] шкоди\n\t• Швидкість набору стосів: [/+regen_rate]"
		},
		shot31 = {
			name = "Мультипостріл I",
			info = "Дозволяє стріляти з високою швидкістю при утриманні кнопки атаки\n\t• Відкриває можливість швидкісної стрільби\n\t• Пряма та вибухова шкода прибрана\n\t• Ліміт стосів пострілу: [stacks]\n\t• Швидкість набору стосів: [/+regen_rate]\n\t• Зміна розміру снаряда: [++shot_size]\n\t• Зміна швидкості снаряда: [++shot_speed]"
		},
		shot32 = {
			name = "Мультипостріл II",
			info = "Збільшує максимальну кількість стосів та покращує швидкість пострілів\n\t• Ліміт стосів пострілу: [stacks]\n\t• Швидкість набору стосів: [/+regen_rate]\n\t• Зміна розміру снаряда: [++shot_size]\n\t• Зміна швидкості снаряда: [++shot_speed]"
		},
		exp1 = {
			name = "Аортальний Вибух",
			info = "Розблоковує вибухову здатність, яка завдає величезної шкоди всім цілям поруч. Ця здатність активується, коли ваше здоров'я вперше падає нижче кожного кратного 1000 HP. Якщо придбано при здоров’ї менше 1000 HP, перше отримане ушкодження активує цю здатність. Попередні пороги більше не можуть бути досягнуті (навіть при зціленні)."
		},
		exp2 = {
			name = "Отруйний Вибух",
			info = "Підсилює вашу вибухову здатність\n\t• Накладає 2 рівні отрути\n\t• Радіус вибуху збільшений на [+explosion_radius]"
		},
	}
}

wep.SCP066 = {
	skills = {
		_overview = { "eric", "music", "dash", "boost" },
		not_threatened = "Ви не відчуваєте достатньої загрози для атаки!",

		music = {
			name = "Симфонія №2",
			dsc = "Якщо ви відчуваєте загрозу, ви можете випромінювати гучну музику",
		},
		dash = {
			name = "Ривок",
			dsc = "Ривок вперед. Якщо ви вдарите гравця, то прикріпитеся до нього на короткий час. Використовуйте знову, щоб від'єднатися",
		},
		boost = {
			name = "Підсилення",
			dsc = "Отримайте один із трьох підсилень, які зараз активні. Після використання воно буде замінене наступним. Сила всіх підсилень зростає з кожним пасивним рівнем (обмеження — [cap] рівнів).\n\nПоточне підсилення: [boost]\n\nПрискорення: [speed]\nЗахист від куль: [def]\nРегенерація: [regen]",
			buffs = {
				"Швидкість",
				"Захист від куль",
				"Регенерація",
			},
		},
		eric = {
			name = "Ерік?",
			dsc = "Ви запитуєте неозброєних гравців, чи вони Ерік. Отримуєте один пасивний рівень кожного разу",
		},
		music_bar = {
			name = "Симфонія №2",
			dsc = "Час, що залишився для цієї здібності",
		},
		dash_bar = {
			name = "Час прикріплення",
			dsc = "Час, що залишився для перебування на цілі",
		},
		boost_bar = {
			name = "Підсилення",
			dsc = "Час, що залишився для цієї здібності",
		},
	},

	upgrades = {
		parse_description = true,

		eric1 = {
			name = "Ерік? I",
			info = "Зменшує час перезарядки пасивної здібності на [-eric_cd]",
		},
		eric2 = {
			name = "Ерік? II",
			info = "Зменшує час перезарядки пасивної здібності на [-eric_cd]",
		},
		music1 = {
			name = "Симфонія №2 I",
			info = "Покращує вашу основну атаку\n\t• Час перезарядки зменшено на [-music_cd]\n\t• Дальність збільшено на [+music_range]",
		},
		music2 = {
			name = "Симфонія №2 II",
			info = "Покращує вашу основну атаку\n\t• Час перезарядки зменшено на [-music_cd]\n\t• Дальність збільшено на [+music_range]",
		},
		music3 = {
			name = "Симфонія №2 III",
			info = "Покращує вашу основну атаку\n\t• Шкода збільшена на [+music_damage]",
		},
		dash1 = {
			name = "Ривок I",
			info = "Покращує вашу здатність ривка\n\t• Час перезарядки зменшено на [-dash_cd]\n\t• Ви можете залишатися на цілі довше на [+detach_time]",
		},
		dash2 = {
			name = "Ривок II",
			info = "Покращує вашу здатність ривка\n\t• Час перезарядки зменшено на [-dash_cd]\n\t• Ви можете залишатися на цілі довше на [+detach_time]",
		},
		dash3 = {
			name = "Ривок III",
			info = "Покращує вашу здатність ривка\n\t• При повторному використанні ви відштовхнетеся, замість від'єднання\n\t• Під час відштовхування ви можете прикріпитися до іншого гравця\n\t• Ви не можете прикріпитися до того ж гравця, від якого тільки що відштовхнулися",
		},
		boost1 = {
			name = "Підсилення I",
			info = "Покращує вашу здатність підсилення\n\t• Час перезарядки зменшено на [-boost_cd]\n\t• Тривалість збільшена на [+boost_dur]",
		},
		boost2 = {
			name = "Підсилення II",
			info = "Покращує вашу здатність підсилення\n\t• Час перезарядки зменшено на [-boost_cd]\n\t• Сила збільшена на [+boost_power]",
		},
		boost3 = {
			name = "Підсилення III",
			info = "Покращує вашу здатність підсилення\n\t• Тривалість збільшена на [+boost_dur]\n\t• Сила збільшена на [+boost_power]",
		},
	}
}

wep.SCP096 = {
	skills = {
		_overview = { "passive", "lunge", "regen", "special" },
		lunge = {
			name = "Стрибок",
			dsc = "Стрибок вперед під час люті. Миттєво завершує лють. Після стрибка ви не з'їсте тіло",
		},
		regen = {
			name = "Регенерація",
			dsc = "Сядьте на місце та перетворюйте стоси регенерації на здоров'я",
		},
		special = {
			name = "Полювання Закінчено",
			dsc = "Зупиняє лють. Отримуйте стоси регенерації за кожну активну ціль",
		},
		passive = {
			name = "Пасивна Здібність",
			dsc = "Якщо хтось подивиться на вас, ви впадаєте в лють. Ви миттєво вбиваєте гравців, які вас розлютили",
		},
	},

	upgrades = {
		parse_description = true,

		rage = {
			name = "Гнів",
			info = "Отримання [rage_dmg] шкоди за [rage_time] секунд від одного гравця змусить вас впасти в лють",
		},
		heal1 = {
			name = "Пожирання I",
			info = "Після вбивства цілі з'їжте її тіло та отримайте захист від куль на деякий час\n\t• Зцілення за такт: [heal]\n\t• Кількість тактів: [heal_ticks]\n\t• Захист від куль: [-prot]",
		},
		heal2 = {
			name = "Пожирання II",
			info = "Покращує вашу здатність пожирання\n\t• Зцілення за такт: [heal]\n\t• Кількість тактів: [heal_ticks]\n\t• Захист від куль: [-prot]",
		},
		multi1 = {
			name = "Нескінченна Лють I",
			info = "Дозволяє вбивати кілька цілей під час люті протягом обмеженого часу після першого вбивства\n\t• Максимальна кількість цілей: [multi]\n\t• Ліміт часу: [multi_time] сек\n\t• Отримана шкода від куль після першого вбивства збільшена на [+prot]",
		},
		multi2 = {
			name = "Нескінченна Лють II",
			info = "Дозволяє вбивати ще більше цілей під час люті\n\t• Максимальна кількість цілей: [multi]\n\t• Ліміт часу: [multi_time] сек\n\t• Отримана шкода від куль після першого вбивства збільшена на [+prot]",
		},
		regen1 = {
			name = "Крик Відчаю I",
			info = "Покращує вашу здатність регенерації\n\t• Зцілення збільшене на [+regen_mult]",
		},
		regen2 = {
			name = "Крик Відчаю II",
			info = "Покращує вашу здатність регенерації\n\t• Швидкість отримання стосів збільшена на [/regen_stacks]",
		},
		regen3 = {
			name = "Крик Відчаю III",
			info = "Покращує вашу здатність регенерації\n\t• Зцілення збільшене на [+regen_mult]\n\t• Швидкість отримання стосів збільшена на [/regen_stacks]",
		},
		spec1 = {
			name = "Милосердя I",
			info = "Покращує вашу особливу здатність та додає зменшення розуму\n\t• Отримуйте на [+spec_mult] більше стосів\n\t• Втрата розуму: [sanity]",
		},
		spec2 = {
			name = "Милосердя II",
			info = "Покращує вашу особливу здатність\n\t• Отримуйте на [+spec_mult] більше стосів\n\t• Втрата розуму: [sanity]",
		},
	}
}

wep.SCP106 = {
	cancel = "Натисніть [%s], щоб скасувати",

	skills = {
		_overview = { "passive", "withering", "teleport", "trap" },
		withering = {
			name = "Згасання",
			dsc = "Накладає ефект згасання на ціль. Згасання поступово сповільнює ціль із часом. Атака по цілі, яка знаходиться в Кишеньковому Вимірі, миттєво її вбиває\n\nТривалість ефекту: [dur]\nМаксимальне сповільнення: [slow]",
		},
		trap = {
			name = "Пастка",
			dsc = "Розміщує пастку на стіні. Коли пастка активується, ціль сповільнюється, і ви можете використати цю здатність ще раз, щоб миттєво телепортуватися до пастки",
		},
		teleport = {
			name = "Телепорт",
			dsc = "Використовуйте для встановлення точки телепортації. Якщо утримувати цю здатність біля вже існуючої точки телепортації, можна вибрати місце призначення, відпустіть кнопку, щоб телепортуватися",
		},
		passive = {
			name = "Колекція Зубів",
			dsc = "Кулі не можуть вас убити, але можуть тимчасово збити з ніг. Ви також можете проходити крізь двері. Торкання гравця телепортує його в Кишеньковий Вимір. Кожен гравець, телепортований туди, дає один зуб. Зібрані зуби посилюють вашу здатність згасання",
		},
		teleport_cd = {
			name = "Телепорт",
			dsc = "Показує час перезарядки точки телепортації",
		},
		passive_bar = {
			name = "Колекція Зубів",
			dsc = "Коли ця шкала досягне нуля, вас зіб'ють з ніг",
		},
		trap_bar = {
			name = "Пастка",
			dsc = "Показує, скільки часу пастка залишатиметься активною",
		}
	},

	upgrades = {
		parse_description = true,

		passive1 = {
			name = "Колекція Зубів I",
			info = "Покращує вашу пасивну здатність\n\t• Збільшує шкоду, необхідну для того, щоб збити вас з ніг, на [+passive_dmg]\n\t• Скорочує оглушення після збиття на [-passive_cd]",
		},
		passive2 = {
			name = "Колекція Зубів II",
			info = "Покращує вашу пасивну здатність\n\t• Збільшує шкоду, необхідну для того, щоб збити вас з ніг, на [+passive_dmg]\n\t• Шкода, завдана гравцям, збільшена на [+teleport_dmg]",
		},
		passive3 = {
			name = "Колекція Зубів III",
			info = "Покращує вашу пасивну здатність\n\t• Збільшує шкоду, необхідну для того, щоб збити вас з ніг, на [+passive_dmg]\n\t• Скорочує оглушення після збиття на [-passive_cd]\n\t• Шкода, завдана гравцям, збільшена на [+teleport_dmg]",
		},
		withering1 = {
			name = "Згасання I",
			info = "Покращує вашу здатність згасання\n\t• Час перезарядки зменшений на [-attack_cd]\n\t• Базова тривалість ефекту збільшена на [+withering_dur]",
		},
		withering2 = {
			name = "Згасання II",
			info = "Покращує вашу здатність згасання\n\t• Час перезарядки зменшений на [-attack_cd]\n\t• Базова величина сповільнення збільшена на [+withering_slow]",
		},
		withering3 = {
			name = "Згасання III",
			info = "Покращує вашу здатність згасання\n\t• Час перезарядки зменшений на [-attack_cd]\n\t• Базова тривалість ефекту збільшена на [+withering_dur]\n\t• Базова величина сповільнення збільшена на [+withering_slow]",
		},
		tp1 = {
			name = "Телепорт I",
			info = "Покращує вашу здатність телепортації\n\t• Максимальна кількість точок збільшена до [spot_max]\n\t• Час перезарядки точки зменшено на [-spot_cd]",
		},
		tp2 = {
			name = "Телепорт II",
			info = "Покращує вашу здатність телепортації\n\t• Максимальна кількість точок збільшена до [spot_max]\n\t• Час перезарядки телепортації зменшено на [-tp_cd]",
		},
		tp3 = {
			name = "Телепорт III",
			info = "Покращує вашу здатність телепортації\n\t• Максимальна кількість точок збільшена до [spot_max]\n\t• Час перезарядки точки зменшено на [-spot_cd]\n\t• Час перезарядки телепортації зменшено на [-tp_cd]",
		},
		trap1 = {
			name = "Пастка I",
			info = "Покращує вашу здатність встановлення пастки\n\t• Час перезарядки пастки зменшено на [-trap_cd]\n\t• Час існування пастки збільшений на [+trap_life]",
		},
		trap2 = {
			name = "Пастка II",
			info = "Покращує вашу здатність встановлення пастки\n\t• Час перезарядки пастки зменшено на [-trap_cd]\n\t• Час існування пастки збільшений на [+trap_life]",
		},
	}
}

local scp173_prot = {
	name = "Зміцнений Бетон",
	info = "• Отримуйте [%prot] зменшення шкоди від куль\n• Ця здатність складається з іншими подібними вміннями",
}

wep.SCP173 = {
	restricted = "Обмежено!",

	skills = {
		_overview = { "gas", "decoy", "stealth" },
		gas = {
			name = "Газ",
			dsc = "Випускає хмару подразнюючого газу, яка сповільнює, затуманює зір і прискорює моргання гравців поблизу",
		},
		decoy = {
			name = "Приманка",
			dsc = "Розміщує приманку, яка відволікає і виснажує розум гравців",
		},
		stealth = {
			name = "Непомітність",
			dsc = "Активує режим непомітності. У цьому режимі ви невидимі та можете проходити крізь двері. Також ви стаєте невразливими до шкоди (зональна шкода, наприклад вибухи, все ще можуть вас вразити), але при цьому ви не можете завдавати шкоди гравцям і взаємодіяти зі світом",
		},
		looked_at = {
			name = "Замри!",
			dsc = "Показує, якщо хтось дивиться на вас",
		},
		next_decoy = {
			name = "Запас приманок",
			dsc = "Кількість доступних приманок",
		},
		stealth_bar = {
			name = "Непомітність",
			dsc = "Час, що залишився для здібності непомітності",
		},
	},

	upgrades = {
		parse_description = true,

		horror_a = {
			name = "Переважна Присутність",
			info = "Радіус жаху збільшений на [+horror_dist]",
		},
		horror_b = {
			name = "Тривожна Присутність",
			info = "Виснаження розуму від жаху збільшене на [+horror_sanity]",
		},
		attack_a = {
			name = "Швидкий Вбивця",
			info = "Радіус вбивства збільшений на [+snap_dist]",
		},
		attack_b = {
			name = "Маневрений Вбивця",
			info = "Радіус пересування збільшений на [+move_dist]",
		},
		gas1 = {
			name = "Газ I",
			info = "Радіус газу збільшений на [+gas_dist]",
		},
		gas2 = {
			name = "Газ II",
			info = "Радіус газу збільшений на [+gas_dist], а час перезарядки газу зменшений на [-gas_cd]",
		},
		decoy1 = {
			name = "Приманка I",
			info = "Час перезарядки приманки зменшений на [-decoy_cd]",
		},
		decoy2 = {
			name = "Приманка II",
			info = "• Час перезарядки приманки зменшений до 0.5 с\n• Початковий час перезарядки тепер застосовується до запасу приманок\n• Ліміт приманок збільшений до [decoy_max]",
		},
		stealth1 = {
			name = "Непомітність I",
			info = "Час перезарядки непомітності зменшений на [-stealth_cd]",
		},
		stealth2 = {
			name = "Непомітність II",
			info = "• Час перезарядки непомітності зменшений на [-stealth_cd]\n• Тривалість непомітності збільшена на [+stealth_dur]",
		},
		prot1 = scp173_prot,
		prot2 = scp173_prot,
		prot3 = scp173_prot,
		prot4 = scp173_prot,
	},
}

wep.SCP457 = {
	skills = {
		_overview = { "passive", "fireball", "trap", "ignite" },
		fireball = {
			name = "Вогняна Куля",
			dsc = "Витрати пального: [cost]\nЗапускає вогняну кулю, яка летітиме вперед, поки не зіткнеться з чимось",
		},
		trap = {
			name = "Пастка",
			dsc = "Витрати пального: [cost]\nВстановлює пастку, яка підпалює гравців, що її торкаються",
		},
		ignite = {
			name = "Внутрішня Лють",
			dsc = "Витрати пального: [cost] за кожне створене полум'я\nВипускає хвилі вогню навколо вас. Радіус цієї здібності необмежений, і кожне наступне кільце полум'я споживає більше пального. Цю здібність неможливо перервати",
		},
		passive = {
			name = "Пасивна Здібність",
			dsc = "Ви підпалюєте всіх, кого торкаєтесь. Підпалювання гравців додає пальне",
		},
	},

	upgrades = {
		parse_description = true,

		passive1 = {
			name = "Живий Факел I",
			info = "Покращує вашу пасивну здібність\n\t• Радіус вогню збільшений на [+fire_radius]\n\t• Отримання пального збільшене на [+fire_fuel]",
		},
		passive2 = {
			name = "Живий Факел II",
			info = "Покращує вашу пасивну здібність\n\t• Радіус вогню збільшений на [+fire_radius]\n\t• Шкода від вогню збільшена на [+fire_dmg]",
		},
		passive3 = {
			name = "Живий Факел III",
			info = "Покращує вашу пасивну здібність\n\t• Отримання пального збільшене на [+fire_fuel]\n\t• Шкода від вогню збільшена на [+fire_dmg]",
		},
		passive_heal1 = {
			name = "Полум'я Життя I",
			info = "Ви зцілюєтесь на [%fire_heal] від шкоди, завданої вогнем будь-якої вашої здібності",
		},
		passive_heal2 = {
			name = "Полум'я Життя II",
			info = "Ви зцілюєтесь на [%fire_heal] від шкоди, завданої вогнем будь-якої вашої здібності",
		},
		fireball1 = {
			name = "Гарячий М'яч I",
			info = "Покращує вашу здібність вогняної кулі\n\t• Час перезарядки зменшений на [-fireball_cd]\n\t• Швидкість збільшена на [+fireball_speed]\n\t• Витрати пального зменшені на [-fireball_cost]",
		},
		fireball2 = {
			name = "Гарячий М'яч II",
			info = "Покращує вашу здібність вогняної кулі\n\t• Шкода збільшена на [+fireball_dmg]\n\t• Розмір збільшений на [+fireball_size]\n\t• Витрати пального зменшені на [-fireball_cost]",
		},
		fireball3 = {
			name = "Гарячий М'яч III",
			info = "Покращує вашу здібність вогняної кулі\n\t• Час перезарядки зменшений на [-fireball_cd]\n\t• Шкода збільшена на [+fireball_dmg]\n\t• Швидкість збільшена на [+fireball_speed]",
		},
		trap1 = {
			name = "Це Пастка! I",
			info = "Покращує вашу здібність пастки\n\t• Додаткові пастки: [trap_max]\n\t• Витрати пального зменшені на [-trap_cost]\n\t• Час існування збільшений на [+trap_time]",
		},
		trap2 = {
			name = "Це Пастка! II",
			info = "Покращує вашу здібність пастки\n\t• Додаткові пастки: [trap_max]\n\t• Шкода збільшена на [+trap_dmg]\n\t• Час існування збільшений на [+trap_time]",
		},
		trap3 = {
			name = "Це Пастка! III",
			info = "Покращує вашу здібність пастки\n\t• Витрати пального зменшені на [-trap_cost]\n\t• Шкода збільшена на [+trap_dmg]\n\t• Час існування збільшений на [+trap_time]",
		},
		ignite1 = {
			name = "Внутрішня Лють I",
			info = "Покращує вашу здібність внутрішньої люті\n\t• Частота хвиль збільшена на [/ignite_rate]\n\t• Перше кільце створює [ignite_flames] додаткових вогнів",
		},
		ignite2 = {
			name = "Внутрішня Лють II",
			info = "Покращує вашу здібність внутрішньої люті\n\t• Витрати пального зменшені на [-ignite_cost]\n\t• Перше кільце створює [ignite_flames] додаткових вогнів",
		},
		fuel = {
			name = "Доставка Пального!",
			info = "Миттєво отримайте [fuel] пального",
		},
	}
}

wep.SCP682 = {
	skills = {
		_overview = { "primary", "secondary", "charge", "shield" },
		primary = {
			name = "Базова атака",
			dsc = "Атакуйте рукою прямо перед собою, завдаючи незначної шкоди",
		},
		secondary = {
			name = "Укус",
			dsc = "Утримуйте кнопку, щоб підготувати потужну атаку, яка завдасть великої шкоди в конусоподібній області перед вами",
		},
		charge = {
			name = "Ривок",
			dsc = "Після короткої затримки зробіть ривок вперед та станьте незупинним. На повній швидкості ви вбиваєте всіх на своєму шляху та отримуєте можливість пробивати більшість дверей. Ця здібність має бути розблокована у дереві покращень",
		},
		shield = {
			name = "Щит",
			dsc = "Щит поглинає всю непряму шкоду та шкоду від падіння. Ця здібність покращується відповідно до придбаних оновлень у вашому дереві навичок",
		},
		shield_bar = {
			name = "Щит",
			dsc = "Поточний рівень щита, що поглинатиме всю непряму шкоду та шкоду від падіння",
		},
	},

	upgrades = {
		parse_description = true,

		shield_a = {
			name = "Посилений Щит",
			info = "Посилює ваш щит\n\t• Потужність щита: [%shield]\n\t• Час перезарядки: [%shield_cd]",
		},
		shield_b = {
			name = "Регенеруючий Щит",
			info = "Змінює характеристики вашого щита\n\t• Потужність щита: [%shield]\n\t• Час перезарядки: [%shield_cd]\n\t• Час перезарядки починається після повного руйнування щита\n\t• Під час перезарядки щита ви відновлюєте [shield_regen] HP/с",
		},
		shield_c = {
			name = "Щит Жертви",
			info = "Змінює характеристики вашого щита\n\t• Час перезарядки: [%shield_cd]\n\t• Час перезарядки починається після повного руйнування щита\n\t• Потужність щита дорівнює вашому максимальному здоров'ю\n\t• Після руйнування ви втрачаєте [shield_hp] максимального HP",
		},
		shield_d = {
			name = "Відбивний Щит",
			info = "Змінює характеристики вашого щита\n\t• Потужність щита: [%shield]\n\t• Час перезарядки: [%shield_cd]\n\t• Час перезарядки починається після повного руйнування щита\n\t• Ваш щит блокує лише [%shield_pct] вхідної шкоди\n\t• [%reflect_pct] заблокованої шкоди відбивається назад у нападника",
		},

		shield_1 = {
			name = "Щит I",
			info = "Додає ефекти до вашого щита. Після повного руйнування щита ви отримуєте додаткову швидкість руху [+shield_speed_pow] на [shield_speed_dur] секунд",
		},
		shield_2 = {
			name = "Щит II",
			info = "Додає ефекти до вашого щита. Після повного руйнування щита ви отримуєте додаткову швидкість руху [+shield_speed_pow] на [shield_speed_dur] секунд. Додатково, кожен 1 пункт отриманої шкоди скорочує час перезарядки щита на [shield_cdr] секунд",
		},

		attack_1 = {
			name = "Посилений Удар",
			info = "Покращує вашу базову атаку\n\t• Час перезарядки зменшений на [-prim_cd]\n\t• Шкода збільшена на [prim_dmg]",
		},
		attack_2 = {
			name = "Посилений Укус",
			info = "Покращує вашу атаку укусом\n\t• Дальність збільшена на [+sec_range]\n\t• Швидкість руху під час підготовки атаки збільшена на [+sec_speed]",
		},
		attack_3 = {
			name = "Безжальний Удар",
			info = "Покращує як базову атаку, так і укус\n\t• Обидві атаки накладають ефект кровотечі\n\t• Укус при повному заряді викликає перелом",
		},

		charge_1 = {
			name = "Ривок",
			info = "Розблоковує здібність ривка",
		},
		charge_2 = {
			name = "Безжальний Ривок",
			info = "Посилює здібність ривка\n\t• Час перезарядки зменшений на [-charge_cd]\n\t• Тривалість оглушення та уповільнення зменшена на [-charge_stun]",
		},
	}
}

wep.SCP8602 = {
	skills = {
		_overview = { "passive", "primary", "defense", "charge" },
		primary = {
			name = "Атака",
			dsc = "Виконує базову атаку",
		},
		defense = {
			name = "Захисна Стойка",
			dsc = "Утримуйте для активації. Під час утримання ви поступово отримуєте захист, але також сповільнюєтесь. Відпустіть, щоб зробити ривок вперед і завдати шкоди, рівної [dmg_ratio] від поглиненої шкоди. Ця здібність не має обмеження за тривалістю",
		},
		charge = {
			name = "Ривок",
			dsc = "З часом збільшує швидкість і завдає шкоди першому гравцеві перед вами. Якщо атакований гравець знаходиться близько до стіни, він буде пришпилений до неї, і ви виконаєте потужну атаку",
		},
		passive = {
			name = "Пасивна Здібність",
			dsc = "Ви бачите гравців всередині вашого лісу і протягом певного часу після того, як вони його покинули. Гравці всередині лісу втрачають розум, а якщо у них немає розуму — вони втрачають здоров'я. Ви зцілюєтесь за рахунок відібраного розуму/здоров'я у гравців всередині лісу. Це зцілення може перевищувати ваш максимальний рівень здоров'я",
		},
		overheal_bar = {
			name = "Надлишкове Здоров'я",
			dsc = "Кількість перевищеного здоров'я",
		},
		defense_bar = {
			name = "Захист",
			dsc = "Поточний рівень захисту",
		},
		charge_bar = {
			name = "Ривок",
			dsc = "Час, що залишився для здібності ривка",
		},
	},

	upgrades = {
		parse_description = true,

		passive1 = {
			name = "Густий Ліс I",
			info = "Покращує вашу пасивну здібність\n\t• Максимальне надлишкове здоров'я збільшене на [+overheal]\n\t• Швидкість дії пасивної здібності збільшена на [/passive_rate]\n\t• Час виявлення гравців збільшений на [+detect_time]",
		},
		passive2 = {
			name = "Густий Ліс II",
			info = "Покращує вашу пасивну здібність\n\t• Максимальне надлишкове здоров'я збільшене на [+overheal]\n\t• Швидкість дії пасивної здібності збільшена на [/passive_rate]\n\t• Час виявлення гравців збільшений на [+detect_time]",
		},
		primary = {
			name = "Простий, але Небезпечний",
			info = "Покращує вашу базову атаку\n\t• Час перезарядки зменшений на [-primary_cd]\n\t• Шкода збільшена на [+primary_dmg]",
		},
		def1a = {
			name = "Швидка Броня",
			info = "Змінює вашу здібність захисної стойки\n\t• Час активації зменшений на [-def_time]\n\t• Час перезарядки збільшений на [+def_cooldown]",
		},
		def1b = {
			name = "Швидка Активація",
			info = "Змінює вашу здібність захисної стойки\n\t• Час активації збільшений на [+def_time]\n\t• Час перезарядки зменшений на [-def_cooldown]",
		},
		def2a = {
			name = "Довгий Ривок",
			info = "Змінює вашу здібність захисної стойки\n\t• Максимальна дистанція ривка збільшена на [+def_range]\n\t• Ширина ривка зменшена на [-def_width]",
		},
		def2b = {
			name = "Незграбний Ривок",
			info = "Змінює вашу здібність захисної стойки\n\t• Максимальна дистанція ривка зменшена на [-def_range]\n\t• Ширина ривка збільшена на [+def_width]",
		},
		def3a = {
			name = "Важка Броня",
			info = "Змінює вашу здібність захисної стойки\n\t• Максимальний рівень захисту збільшений на [+def_prot]\n\t• Максимальне сповільнення збільшене на [+def_slow]",
		},
		def3b = {
			name = "Легка Броня",
			info = "Змінює вашу здібність захисної стойки\n\t• Максимальний рівень захисту зменшений на [-def_prot]\n\t• Максимальне сповільнення зменшене на [-def_slow]",
		},
		def4 = {
			name = "Ефективна Броня",
			info = "Покращує вашу здібність захисної стойки\n\t• Множник конверсії шкоди збільшений на [+def_mult]",
		},
		charge1 = {
			name = "Ривок I",
			info = "Покращує вашу здібність ривка\n\t• Час перезарядки зменшений на [-charge_cd]\n\t• Тривалість збільшена на [+charge_time]\n\t• Базова шкода збільшена на [+charge_dmg]",
		},
		charge2 = {
			name = "Ривок II",
			info = "Покращує вашу здібність ривка\n\t• Дальність збільшена на [+charge_range]\n\t• Тривалість збільшена на [+charge_time]\n\t• Шкода від пришпилення до стіни збільшена на [+charge_pin_dmg]",
		},
		charge3 = {
			name = "Ривок III",
			info = "Покращує вашу здібність ривка\n\t• Швидкість збільшена на [+charge_speed]\n\t• Якщо рівень ривка перевищує 80%, будь-який удар вважається потужною атакою\n\t• Пришпилення гравця до стіни ламає йому кістки",
		},
	}
}

wep.SCP939 = {
	skills = {
		_overview = { "passive", "primary", "trail", "special" },
		primary = {
			name = "Атака",
			dsc = "Кусає всіх у конусоподібній зоні перед вами",
		},
		trail = {
			name = "ANM-C227",
			dsc = "Утримуйте кнопку, щоб залишати слід ANM-C227 позаду себе",
		},
		special = {
			name = "Виявлення",
			dsc = "Починає виявлення гравців навколо вас",
		},
		passive = {
			name = "Пасивна Здібність",
			dsc = "Ви не бачите гравців, але бачите звукові хвилі. Навколо вас є аура ANM-C227",
		},
		special_bar = {
			name = "Виявлення",
			dsc = "Залишковий час виявлення",
		},
	},

	upgrades = {
		parse_description = true,

		passive1 = {
			name = "Аура I",
			info = "Покращує вашу пасивну здібність\n\t• Радіус аури збільшений на [+aura_radius]\n\t• Шкода аури збільшена на [aura_damage]",
		},
		passive2 = {
			name = "Аура II",
			info = "Покращує вашу пасивну здібність\n\t• Радіус аури збільшений на [+aura_radius]\n\t• Шкода аури збільшена на [aura_damage]",
		},
		passive3 = {
			name = "Аура III",
			info = "Покращує вашу пасивну здібність\n\t• Радіус аури збільшений на [+aura_radius]\n\t• Шкода аури збільшена на [aura_damage]",
		},
		attack1 = {
			name = "Укус I",
			info = "Покращує вашу здібність атаки\n\t• Час перезарядки зменшений на [-attack_cd]\n\t• Шкода збільшена на [+attack_dmg]",
		},
		attack2 = {
			name = "Укус II",
			info = "Покращує вашу здібність атаки\n\t• Час перезарядки зменшений на [-attack_cd]\n\t• Дальність збільшена на [+attack_range]",
		},
		attack3 = {
			name = "Укус III",
			info = "Покращує вашу здібність атаки\n\t• Шкода збільшена на [+attack_dmg]\n\t• Дальність збільшена на [+attack_range]\n\t• Ваші атаки мають шанс викликати кровотечу",
		},
		trail1 = {
			name = "Амнезія I",
			info = "Покращує вашу здібність ANM-C227\n\t• Радіус збільшений на [+trail_radius]\n\t• Швидкість генерації зарядів збільшена на [/trail_rate]",
		},
		trail2 = {
			name = "Амнезія II",
			info = "Покращує вашу здібність ANM-C227\n\t• Шкода збільшена на [trail_dmg]\n\t• Максимальна кількість зарядів збільшена на [+trail_stacks]",
		},
		trail3a = {
			name = "Амнезія III A",
			info = "Покращує вашу здібність ANM-C227\n\t• Час існування сліду збільшений на [+trail_life]\n\t• Радіус збільшений на [+trail_radius]",
		},
		trail3b = {
			name = "Амнезія III B",
			info = "Покращує вашу здібність ANM-C227\n\t• Максимальна кількість зарядів збільшена на [+trail_stacks]",
		},
		trail3c = {
			name = "Амнезія III C",
			info = "Покращує вашу здібність ANM-C227\n\t• Швидкість генерації зарядів збільшена на [/trail_rate]",
		},
		special1 = {
			name = "Ехолокація I",
			info = "Покращує вашу спеціальну здібність\n\t• Час перезарядки зменшений на [-special_cd]\n\t• Радіус збільшений на [+special_radius]",
		},
		special2 = {
			name = "Ехолокація II",
			info = "Покращує вашу спеціальну здібність\n\t• Час перезарядки зменшений на [-special_cd]\n\t• Тривалість збільшена на [+special_times]",
		},
	}
}

wep.SCP966 = {
	fatigue = "Рівень втоми:",

	skills = {
		_overview = { "passive", "attack", "channeling", "mark" },
		attack = {
			name = "Базова атака",
			dsc = "Виконує базову атаку. Ви можете атакувати лише гравців, які мають щонайменше 10 рівнів втоми. Атаковані гравці втрачають частину рівнів втоми. Ефекти цієї атаки залежать від покращень у дереві навичок",
		},
		channeling = {
			name = "Направлення",
			dsc = "Активує здібність, вибрану в дереві навичок",
		},
		mark = {
			name = "Мітка Смерті",
			dsc = "Позначає гравця. Позначені гравці будуть отримувати рівні втоми від інших гравців поблизу",
		},
		passive = {
			name = "Втома",
			dsc = "Час від часу ви додаєте рівні втоми гравцям поблизу. Ви також отримуєте пасивні заряди за кожен доданий рівень втоми",
		},
		channeling_bar = {
			name = "Направлення",
			dsc = "Час, що залишився для здібності направлення",
		},
		mark_bar = {
			name = "Мітка Смерті",
			dsc = "Час, що залишився до зникнення мітки на гравцеві",
		},
	},

	upgrades = {
		parse_description = true,

		passive1 = {
			name = "Втома I",
			info = "Покращує вашу пасивну здібність\n\t• Швидкість дії пасиву збільшена на [/passive_rate]",
		},
		passive2 = {
			name = "Втома II",
			info = "Покращує вашу пасивну здібність\n\t• Швидкість дії пасиву збільшена на [/passive_rate]\n\t• Радіус пасиву збільшений на [+passive_radius]",
		},
		basic1 = {
			name = "Гострі Кігті I",
			info = "Покращує вашу базову атаку, збільшуючи шкоду на [%basic_dmg] за кожні [basic_stacks] пасивних зарядів. Також, накопичення пасивних зарядів відкриває:\n\t• [bleed1_thr] зарядів: Викликає кровотечу, якщо ціль не страждає від неї\n\t• [drop1_thr] зарядів: Зменшує втрату рівнів втоми у цілі до [%drop1]\n\t• [slow_thr] зарядів: Уповільнює ціль на [-slow_power] протягом [slow_dur] секунд",
		},
		basic2 = {
			name = "Гострі Кігті II",
			info = "Покращує вашу базову атаку, збільшуючи шкоду на [%basic_dmg] за кожні [basic_stacks] пасивних зарядів. Також, накопичення пасивних зарядів відкриває:\n\t• [bleed2_thr] зарядів: Викликає кровотечу при ударі\n\t• [drop2_thr] зарядів: Зменшує втрату рівнів втоми у цілі до [%drop2]\n\t• [hb_thr] зарядів: Викликає сильну кровотечу замість звичайної",
		},
		heal = {
			name = "Поглинання Крові",
			info = "Відновлює [%heal_rate] здоров'я за кожен пасивний заряд на кожен рівень втоми цілі при ударі",
		},
		channeling_a = {
			name = "Нескінченна Втома",
			info = "Розблоковує здібність направлення, що дозволяє фокусуватися на одній цілі\n\t• Пасивна здібність вимикається під час направлення\n\t• Час перезарядки: [channeling_cd] секунд\n\t• Максимальна тривалість: [channeling_time] секунд\n\t• Ціль отримуватиме 1 рівень втоми кожні [channeling_rate] секунд",
		},
		channeling_b = {
			name = "Поглинання Енергії",
			info = "Розблоковує здібність направлення, що дозволяє поглинати рівні втоми у гравців поблизу\n\t• Пасивна здібність вимикається під час направлення\n\t• Час перезарядки: [channeling_cd] секунд\n\t• Максимальна тривалість: [channeling_time] секунд\n\t• Кожні [channeling_rate] секунд забирає 1 рівень втоми у всіх гравців поблизу та додає їх до ваших пасивних зарядів",
		},
		channeling = {
			name = "Посилене Направлення",
			info = "Покращує вашу здібність направлення\n\t• Радіус направлення збільшений на [+channeling_range_mul]\n\t• Тривалість направлення збільшена на [+channeling_time_mul]",
		},
		mark1 = {
			name = "Смертоносна Мітка I",
			info = "Покращує здібність мітки:\n\t• Швидкість передачі рівнів втоми збільшена на [/mark_rate]",
		},
		mark2 = {
			name = "Смертоносна Мітка II",
			info = "Покращує здібність мітки:\n\t• Швидкість передачі рівнів втоми збільшена на [/mark_rate]\n\t• Радіус передачі рівнів втоми збільшений на [+mark_range]",
		},
	}
}

wep.SCP24273 = {
	skills = {
		_overview = { "change", "primary", "secondary", "special" },
		primary = {
			name = "Ривок / Камуфляж",
			dsc = "\nСуддя:\nРивок вперед, завдаючи шкоди всім на шляху\n\nПрокурор:\nАктивує камуфляж. Під час камуфляжу ви менш помітні. Використання здібностей, рух або отримання шкоди перериває його",
		},
		secondary = {
			name = "Екзамен / Спостереження",
			dsc = "\nСуддя:\nПочинає фокусування на цілі. Після завершення уповільнює ціль і завдає шкоди. Якщо зірвано пряму видимість, здібність переривається, і ви самі уповільнюєтесь\n\nПрокурор:\nЗалишаєте своє тіло та спостерігаєте з перспективи випадкового гравця поблизу. Ваша пасивна здібність також працює з його точки зору",
		},
		special = {
			name = "Суд / Примара",
			dsc = "\nСуддя:\nЗалишаєтесь на місці та змушуєте всіх поблизу рухатися до вас. Після завершення гравці, які знаходяться поруч, отримують шкоду та відкидаються\n\nПрокурор:\nВходите в форму примари. У цьому стані ви не отримуєте шкоди (за винятком вибухів і прямої атаки)",
		},
		change = {
			name = "Суддя / Прокурор",
			dsc = "\nПеремикається між режимами Судді та Прокурора\n\nСуддя:\nЗавдана вами шкода збільшується відповідно до рівня доказів проти цілі. Атакуючи ціль, ви знижуєте рівень її доказів. Атака гравця з повним рівнем доказів миттєво вбиває його\n\nПрокурор:\nВи уповільнені та отримуєте захист від куль. Дивлячись на гравців, ви збираєте докази проти них",
		},
		camo_bar = {
			name = "Камуфляж",
			dsc = "Залишковий час камуфляжу",
		},
		spectate_bar = {
			name = "Спостереження",
			dsc = "Залишковий час спостереження",
		},
		drain_bar = {
			name = "Екзамен",
			dsc = "Залишковий час екзамену",
		},
		ghost_bar = {
			name = "Примара",
			dsc = "Залишковий час у формі примари",
		},
		special_bar = {
			name = "Суд",
			dsc = "Залишковий час суду",
		},
	},

	upgrades = {
		parse_description = true,

		j_passive1 = {
			name = "Суворий Суддя I",
			info = "Покращує вашу пасивну здібність судді\n\t• Докази збільшують шкоду до додаткових [%j_mult]\n\t• Втрата доказів при атаці зменшена до [%j_loss]",
		},
		j_passive2 = {
			name = "Суворий Суддя II",
			info = "Покращує вашу пасивну здібність судді\n\t• Докази збільшують шкоду до додаткових [%j_mult]\n\t• Втрата доказів при атаці зменшена до [%j_loss]",
		},
		p_passive1 = {
			name = "Окружний Прокурор I",
			info = "Покращує вашу пасивну здібність прокурора\n\t• Захист від куль збільшено до [%p_prot]\n\t• Уповільнення збільшене до [%p_slow]\n\t• Швидкість збору доказів збільшена до [%p_rate] за секунду",
		},
		p_passive2 = {
			name = "Окружний Прокурор II",
			info = "Покращує вашу пасивну здібність прокурора\n\t• Захист від куль збільшено до [%p_prot]\n\t• Уповільнення збільшене до [%p_slow]\n\t• Швидкість збору доказів збільшена до [%p_rate] за секунду",
		},
		dash1 = {
			name = "Ривок I",
			info = "Покращує вашу здібність ривка\n\t• Час перезарядки зменшений на [-dash_cd]\n\t• Шкода збільшена на [+dash_dmg]",
		},
		dash2 = {
			name = "Ривок II",
			info = "Покращує вашу здібність ривка\n\t• Час перезарядки зменшений на [-dash_cd]\n\t• Шкода збільшена на [+dash_dmg]",
		},
		camo1 = {
			name = "Камуфляж I",
			info = "Покращує вашу здібність камуфляжу\n\t• Час перезарядки зменшений на [-camo_cd]\n\t• Тривалість збільшена на [+camo_dur]\n\t• Ви можете пройти [camo_limit] одиниць без переривання цієї здібності",
		},
		camo2 = {
			name = "Камуфляж II",
			info = "Покращує вашу здібність камуфляжу\n\t• Час перезарядки зменшений на [-camo_cd]\n\t• Тривалість збільшена на [+camo_dur]\n\t• Ви можете пройти [camo_limit] одиниць без переривання цієї здібності",
		},
		drain1 = {
			name = "Екзамен I",
			info = "Покращує вашу здібність екзамену\n\t• Час перезарядки зменшений на [-drain_cd]\n\t• Тривалість зменшена на [-drain_dur]",
		},
		drain2 = {
			name = "Екзамен II",
			info = "Покращує вашу пасивну здібність екзамену\n\t• Час перезарядки зменшений на [-drain_cd]\n\t• Тривалість зменшена на [-drain_dur]",
		},
		spect1 = {
			name = "Спостереження I",
			info = "Покращує вашу здібність спостереження\n\t• Час перезарядки зменшений на [-spect_cd]\n\t• Тривалість збільшена на [+spect_dur]\n\t• Захист від куль збільшено до [%spect_prot]",
		},
		spect2 = {
			name = "Спостереження II",
			info = "Покращує вашу здібність спостереження\n\t• Час перезарядки зменшений на [-spect_cd]\n\t• Тривалість збільшена на [+spect_dur]\n\t• Захист від куль збільшено до [%spect_prot]",
		},
		combo = {
			name = "Верховний Суд",
			info = "Покращує ваші здібності суду та примари\n\t• Захист під час суду збільшений до [%special_prot]\n\t• Тривалість примари збільшена на [+ghost_dur]",
		},
		spec = {
			name = "Суд",
			info = "Покращує вашу здібність суду\n\t• Час перезарядки зменшений на [-special_cd]\n\t• Тривалість збільшена на [+special_dur]\n\t• Захист збільшений до [%special_prot]",
		},
		ghost1 = {
			name = "Примара I",
			info = "Покращує вашу здібність примари\n\t• Час перезарядки зменшений на [-ghost_cd]\n\t• Тривалість збільшена на [+ghost_dur]\n\t• Зцілення збільшено до [ghost_hel] за 1 спожитий доказ",
		},
		ghost2 = {
			name = "Примара II",
			info = "Покращує вашу здібність примари\n\t• Час перезарядки зменшений на [-ghost_cd]\n\t• Тривалість збільшена на [+ghost_dur]\n\t• Зцілення збільшено до [ghost_hel] за 1 спожитий доказ",
		},
		change1 = {
			name = "Зміна I",
			info = "Час перезарядки зміни зменшено на [-change_cd]",
		},
		change2 = {
			name = "Зміна II",
			info = "Час перезарядки зміни зменшено на [-change_cd]. Крім того, зміна режиму більше не перериває камуфляж",
		},
	}
}

wep.SCP3199 = {
	skills = {
		_overview = { "passive", "primary", "special", "egg" },
		eggs_max = "У вас вже максимальна кількість яєць!",

		primary = {
			name = "Атака",
			dsc = "Виконуєте базову атаку. Влучання в ціль активує (або оновлює) стан люті, накладає ефект глибоких ран та надає пасивний і лютневий заряд.\nАтаки завдають зменшену шкоду цілям із глибокими ранами. Промах перериває лють. Якщо влучити лише в ціль із глибокими ранами, лють припиняється та застосовується штраф до зарядів.",
		},
		special = {
			name = "Атака з-за меж",
			dsc = "Активується після [tokens] успішних атак підряд. Використання миттєво припиняє лють і завдає шкоди всім гравцям із глибокими ранами. Уражені гравці також уповільнюються.",
		},
		egg = {
			name = "Яйця",
			dsc = "Після вбивства гравця ви можете відкласти яйце. Якщо ви отримаєте смертельне поранення, ви відродитесь у випадковому яйці. Відродження споживає яйце. Крім того, кожне яйце надає [prot] захисту від куль (з обмеженням у [cap]).\n\nПоточні яйця: [eggs] / [max]",
		},
		passive = {
			name = "Пасивна здібність",
			dsc = "Під час люті ви бачите розташування гравців поблизу, які не мають глибоких ран. Отримання лютневих зарядів також надає пасивні заряди. Якщо ваша атака влучає лише в гравця з глибокими ранами, ви втрачаєте [penalty] зарядів. Пасивні заряди покращують ваші інші здібності.\n\nВідновлення [heal] HP за секунду під час люті.\nБонус до шкоди від атак: [dmg]\nБонус до швидкості під час люті: [speed]\nДодаткове уповільнення від спеціальної атаки: [slow]\nСпеціальні атаки викликають [bleed] рівень(і) кровотечі.",
		},
		frenzy_bar = {
			name = "Лють",
			dsc = "Залишковий час люті",
		},
		egg_bar = {
			name = "Яйце",
			dsc = "Залишковий час до появи яйця",
		},
	},

	upgrades = {
		parse_description = true,

		frenzy1 = {
			name = "Лють I",
			info = "Покращує вашу здібність люті\n\t• Тривалість збільшена на [+frenzy_duration]\n\t• Максимальна кількість зарядів збільшена на [frenzy_max]",
		},
		frenzy2 = {
			name = "Лють II",
			info = "Покращує вашу здібність люті\n\t• Максимальна кількість зарядів збільшена на [frenzy_max]\n\t• Швидкість під час люті збільшується на [%frenzy_speed_stacks] за кожен пасивний заряд",
		},
		frenzy3 = {
			name = "Лють III",
			info = "Покращує вашу здібність люті\n\t• Тривалість збільшена на [+frenzy_duration]\n\t• Швидкість під час люті збільшується на [%frenzy_speed_stacks] за кожен пасивний заряд",
		},
		attack1 = {
			name = "Гострі кігті I",
			info = "Покращує вашу атаку\n\t• Час перезарядки зменшено на [-attack_cd]\n\t• Шкода збільшена на [+attack_dmg]",
		},
		attack2 = {
			name = "Гострі кігті II",
			info = "Покращує вашу атаку\n\t• Час перезарядки зменшено на [-attack_cd]\n\t• Шкода збільшена на [%attack_dmg_stacks] за кожен пасивний заряд",
		},
		attack3 = {
			name = "Гострі кігті III",
			info = "Покращує вашу атаку\n\t• Шкода збільшена на [+attack_dmg]\n\t• Шкода збільшена на [%attack_dmg_stacks] за кожен пасивний заряд",
		},
		special1 = {
			name = "Атака з-за меж I",
			info = "Покращує вашу спеціальну здібність\n\t• Шкода збільшена на [+special_dmg]\n\t• Уповільнення збільшене на [%special_slow] за кожен пасивний заряд\n\t• Тривалість уповільнення збільшена на [+special_slow_duration]",
		},
		special2 = {
			name = "Атака з-за меж II",
			info = "Покращує вашу спеціальну здібність\n\t• Шкода збільшена на [+special_dmg]\n\t• Уповільнення збільшене на [%special_slow] за кожен пасивний заряд\n\t• Тривалість уповільнення збільшена на [+special_slow_duration]",
		},
		passive = {
			name = "Кривавий Зір",
			info = "Радіус пасивного виявлення збільшено на [+passive_radius]",
		},
		egg = {
			name = "Великоднє яйце",
			info = "Миттєво створює нове яйце. Ця здібність дозволяє перевищувати ліміт яєць.",
		},
	}
}
