--[[-------------------------------------------------------------------------
Language: Ukrainian
Date: 25.02.2025
Translated by: Nicholas (https://steamcommunity.com/profiles/76561198876144862)
---------------------------------------------------------------------------]]

local lang = {}

lang.self = "Українська" --Language name (not translated)
lang.self_en = "Ukrainian" --Language name (in english)

--[[-------------------------------------------------------------------------
NRegistry
---------------------------------------------------------------------------]]
lang.NRegistry = {
	scpready = "Ви можете стати SCP в наступному раунді",
	scpwait = "Вам необхідно почекати %i раундів щоб стати SCP",
	abouttostart = "Гра розпочнеться через %i секунд!",
	kill = "Ви отримали %d балів за вбивство %s: %s!",
	kill_n = "Ви вбили %s: %s!",
	assist = "Ви отримали %d балів за допомогу у вбивстві: %s!",
	rdm = "Ви втратили %d балів за вбивство %s: %s!",
	acc_denied = "У доступі відмовлено",
	acc_granted = "Доступ дозволено",
	acc_omnitool = "Вам потрібен Omnitool, щоб маніпулювати цими дверима",
	device_noomni = "Вам потрібен Omnitool, щоб маніпулювати цим пристроєм",
	elevator_noomni = "Вам потрібен Omnitool, щоб маніпулювати цим ліфтом",
	acc_wrong = "Потрібен вищий доступ для цієї дії",
	rxpspec = "Ви отримали %i досвіду за гру на цьому сервері!",
	rxpplay = "Ви отримали %i досвіду за те, що залишились живими в цьому раунді!",
	rxpplus = "Ви отримали %i досвіду за те, що залишились живими більше половини раунду!",
	roundxp = "Ви отримали %i досвіду за ваші бали",
	gateexplode = "Часу до детонації Воріт А: %i",
	explodeterminated = "Ворота А було рознесено вщент",
	r106used = "SCP-106 можна стримати тільки один раз за раунд",
	r106eloiid = "Вимкніть електромагніт ELO-IID щоб почати процедуру стримання SCP-106",
	r106sound = "Увімкніть передачу звуку щоб розпочати процедурустримання SCP-106",
	r106human = "В клітці повинна знаходитись жива людина щоб розпочати процедуру стримання SCP-106",
	r106already = "SCP-106 вже стримано",
	r106success = "Ви отримали %i балів за стримання SCP-106!",
	vestpickup = "Ви одягнули бронежилет",
	vestdrop = "Ви зняли бронежилет",
	hasvest = "У вас вже є бронежилет! Викиньте його через інвентар",
	escortpoints = "Ви отримали %i балів за супровід союзників",
	femur_act = "Ламач кісток активовано...",
	levelup = "Підвищення! Ваш новий рівень: %i",
	healplayer = "Ви отримали %i балів за лікування інших гравців",
	detectscp = "Ви отримали %i балів за виявлення SCP",
	winxp = "Ви отримали %i досвіду за перемогу вашої першої команди",
	winalivexp = "Ви отримали %i досвіду за перемогу вашої поточної команди",
	upgradepoints = "Ви отримали бали покращення! Натисніть '%s' щоб відкрити меню покращень SCP",
	omega_detonation = "Детонація боєголовки ОМЕГА через %i секунд. Негайно тікайте на поверхню або до сховища!",
	alpha_detonation = "Детонація боєголовки АЛЬФА через %i секунд. Повертайтесь в комплекс або пройдіть до зони евакуації!",
	alpha_card = "Ви вставили ядерний диск АЛЬФА боєголовки",
	destory_scp = "Ви отримали %i балів за ліквідацію SCP!",
	afk = "Ви в АФК. Ви не отримуватиме досвід та не зможете відродитись!",
	afk_end = "Ви більше не в АФК",
	overload_cooldown = "Почекайте %i секунд для перегрузки цих дверей!",
	advanced_overload = "Ці двері міцніші! Спробуйте знову через %i секунд",
    lockdown_once = "Блокування об'єкта може бути активовано лише один раз за раунд!",
	dailybonus = "Залишок щоденного бонусу: %i XP\nНаступне скидання через: %s",
	xp_goc_device = "Ви отримали %i XP за успішне розгортання пристрою GOC!",
	goc_device_destroyed = "Ви отримали %i очок за знищення пристрою GOC!",
	goc_detonation = "Детонація боєголовок OMEGA та ALPHA через %i секунд. Прямуйте до евакуації або негайно займіть місце в укритті!",
	fuserating = "Вам потрібен запобіжник з вищим рейтингом!",
	nofuse = "Вам потрібен запобіжник для використання цього пристрою",
	cantremfuse = "Запобіжник перегрівається – він занадто гарячий, щоб витягнути!",
	fusebroken = "Запобіжник зламаний і заварений на місці!",
	nopower = "Ви натиснули кнопку, але нічого не сталося...",
	nopower_omni = "Ви піднесли омнітул до зчитувача, але нічого не сталося...",
	docs = "Ви отримали %i очок за втечу з %i документами",
	docs_pick = "Ви знайшли цінні документи Фонду SCP – втечіть із ними, щоб отримати винагороду!",
	gaswarn = "%s дезактивація через 60 секунд",
	queue_alive = "Ви живі",
	queue_not = "Вас немає в черзі підтримки!",
	queue_low = "Ви у черзі підтримки з низьким пріоритетом!",
	queue_pos = "Ваша позиція в черзі підтримки: %i",
	support_optout = "Ви не з'явилися як підтримка, тому що відмовилися від цього. Ви можете змінити це в !settings",
	zombie_optout = "Ви не з'явилися як SCP-049-2, тому що відмовилися від цього. Ви можете змінити це в !settings",
	preparing_classd = "Ви були створені як Class D, оскільки приєдналися під час підготовки. Ви можете змінити це в !settings",
	property_dmg = "Ви втратили %d очок за знищення майна Фонду!",
	unknown_cmd = "Невідома команда: %s",
	tailor_success = "Ви успішно вкрали ID. Будьте обережні, він скоро втратить чинність!",
	tailor_fail = "Ви не змогли знайти дійсний ID на тілі!",
	tailor_end = "Ваш вкрадений ID втратив чинність!",
}

lang.NFailed = "Не вдалося отримати доступ до NRegistry за ключем: %s"

--[[-------------------------------------------------------------------------
NCRegistry
---------------------------------------------------------------------------]]
lang.NCRegistry = {
	escaped = "Ви втекли!",
	escapeinfo = "Гарна робота! Ви втекли за %s",
	escapexp = "Ви отримали %i досвіду",
	escort = "Вас супроводили!",
	roundend = "Раунд завершено!",
	nowinner = "У цьому раунді немає переможця!",
	roundnep = "Недостатньо гравців!",
	roundwin = "Переможець раунду: %s",
	roundwinmulti = "Переможці раунду: [RAW]",
	shelter_escape = "Ви вижили під час вибуху в укритті",
	alpha_escape = "Ви втекли до детонації боєголовки",

	mvp = "MVP: %s з рахунком: %i",
	stat_kill = "Вбито гравців: %i",
	stat_rdm = "RDM вбивства: %i",
	stat_rdmdmg = "RDM шкода: %i",
	stat_dmg = "Завдано шкоди: %i",
	stat_bleed = "Шкода від кровотечі: %i",
	stat_106recontain = "SCP-106 було стримано",
	stat_escapes = "Гравці, що втекли: %i",
	stat_escorts = "Супроводжено гравців: %i",
	stat_023 = "Гравців убито SCP-023: %i",
	stat_049 = "Гравців вилікувано SCP-049: %i",
	stat_0492 = "Гравців роздерли зомбі: %i",
	stat_058 = "Гравців убито SCP-058: %i",
	stat_066 = "Шедеври, зіграні SCP-066: %i",
	stat_096 = "Гравців убито SCP-096: %i",
	stat_106 = "Гравців телепортовано до Кишенькового Виміру: %i",
	stat_173 = "Переламані шиї: %i",
	stat_457 = "Гравців спалено живцем: %i",
	stat_682 = "Гравців убито перевищеним рептилієм: %i",
	stat_8602 = "Гравців убито SCP-860-2: %i",
	stat_939 = "Жертви SCP-939: %i",
	stat_966 = "Гравців приспано: %i",
	stat_3199 = "Убивства SCP-3199: %i",
	stat_24273 = "Людей засуджено SCP-2427-3: %i",
	stat_omega_warhead = "Боєголовка OMEGA була детонована",
	stat_alpha_warhead = "Боєголовка ALPHA була детонована",
	stat_goc_warhead = "Пристрій GOC був активований",
}

lang.NCFailed = "Не вдалося отримати доступ до NCRegistry за ключем: %s"

--[[-------------------------------------------------------------------------
Головне меню
---------------------------------------------------------------------------]]
local main_menu = {}
lang.MenuScreen = main_menu

main_menu.start = "Грати"
main_menu.settings = "Налаштування"
main_menu.precache = "Попереднє завантаження моделей"
main_menu.credits = "Автори"
main_menu.quit = "Вийти"

main_menu.quit_server = "Вийти з сервера?"
main_menu.quit_server_confirmation = "Ви впевнені?"
main_menu.model_precache = "Попереднє завантаження моделей"
main_menu.model_precache_text = "Моделі завантажуються автоматично за необхідності, але це відбувається під час гри, що може викликати підвисання. Щоб уникнути цього, ви можете завантажити їх зараз вручну.\nГра може зависнути під час цього процесу!"
main_menu.yes = "Так"
main_menu.no = "Ні"
main_menu.all = "Попереднє завантаження всіх моделей"
main_menu.cancel = "Скасувати"


main_menu.credits_text = [[Ігровий режим створений ZGFueDkx (aka danx91)
Режим заснований на SCP та випущений під ліцензією CC BY-SA 3.0

Анімації меню створив Madow

Моделі:
	Alski - охоронці, омнітул, турель та інше
	Slusher - SCP-689, двері, планшет та інше

Матеріали:
	Foer - логотип для майстерні та деякі інші графічні елементи
	SCP Containment Breach

Звуки:
	SCP Containment Breach

Основні перекладачі:
	Китайська - xiaobai
	Німецька - Justinnn
	Корейська - joon00
	Польська - Slusher, Alski
	Турецька - Akane

Особлива подяка:
	1000 Shells за допомогу з моделями
	PolishLizard за хостинг тестового сервера
]]

--[[-------------------------------------------------------------------------
HUD
---------------------------------------------------------------------------]]
local hud = {}
lang.HUD = hud

hud.pickup = "Підняти"
hud.class = "Клас"
hud.team = "Команда"
hud.class_points = "Бали відкриття класів"
hud.prestige_points = "Бали престижу"
hud.hp = "ЗДОРОВ'Я"
hud.stamina = "ВИТРИВАЛІСТЬ"
hud.sanity = "ЗДОРОВИЙ ГЛУЗД"
hud.xp = "ДОСВІД"
hud.extra_hp = "Додаткове здоров'я"

hud.escaping = "Втеча..."
hud.escape_blocked = "Вихід заблоковано!"
hud.waiting = "Очікування гравців"

--[[-------------------------------------------------------------------------
EQ
---------------------------------------------------------------------------]]
local eq = {}
lang.EQ = eq

eq.eq = "Інвентар"
eq.actions = "Дії"
eq.backpack = "Рюкзак"
eq.id = "Це ваше ID, покажіть його іншим, щоб розкрити свій клас і команду"
eq.no_id = "У вас немає ID"
eq.class = "Ваш клас: "
eq.team = "Ваша команда: "
eq.p_class = "Ваш підроблений клас: "
eq.p_team = "Ваша підроблена команда: "
eq.allies = "Ваші союзники:"
eq.durability = "Міцність: "
eq.mobility = "Мобільність: "
eq.weight = "Вага: "
eq.weight_unit = "КГ"
eq.multiplier = "Множник шкоди:"
eq.count = "Кількість"

lang.eq_unknown = "Невідомий предмет"
lang.durability = "Міцність"
lang.info = "Інформація"

lang.eq_buttons = {
	escort = "Супроводити",
	gatea = "Знищити Ворота A"
}

lang.pickup_msg = {
	max_eq = "Ваш інвентар заповнений!",
	cant_stack = "Ви не можете нести більше цього предмета!",
	has_already = "У вас вже є цей предмет!",
	same_type = "У вас вже є предмет цього типу!",
	one_weapon = "Ви можете носити лише одну вогнепальну зброю одночасно!",
	goc_only = "Це можуть підняти лише члени ГОК!"
}

--[[-------------------------------------------------------------------------
XP Bar
---------------------------------------------------------------------------]]
lang.XP_BAR = {
	general = "Загальний досвід",
	round = "Перебування на сервері",
	escape = "Втеча з об'єкта",
	score = "Досвід, зароблений під час раунду",
	win = "Перемога в раунді",
	vip = "Бонус VIP",
	daily = "Щоденний бонус",
	cmd = "Божественний бонус",
}

--[[-------------------------------------------------------------------------
AFK Warning
---------------------------------------------------------------------------]]
lang.AFK = {
	afk = "Ви у режимі AFK!",
	afk_warn = "Попередження AFK",
	slay_warn = "Вас скоро буде вбито і позначено як AFK!",
	afk_msg = "Ви не зможете відродитися або отримувати XP з часом!",
	afk_action = "-- Натисніть будь-яку кнопку, щоб повернутися до активності --",
}

--[[-------------------------------------------------------------------------
Effects
---------------------------------------------------------------------------]]
local effects = {}
lang.EFFECTS = effects

effects.permanent = "Постійний"
effects.bleeding = "Кровотеча"
effects.doorlock = "Блокування дверей"
effects.amnc227 = "AMN-C227"
effects.insane = "Божевілля"
effects.gas_choke = "Задуха"
effects.radiation = "Радіація"
effects.deep_wounds = "Глибокі рани"
effects.poison = "Отруєння"
effects.heavy_bleeding = "Сильна кровотеча"
effects.light_bleeding = "Легка кровотеча"
effects.spawn_protection = "Захист при появі"
effects.fracture = "Перелом"
effects.decay = "Розпад"
effects.scp_chase = "Переслідування"
effects.human_chase = "Переслідування"
effects.expd_all = "Експериментальний ефект"
effects.expd_recovery = "Відновлення"
effects.electrical_shock = "Електрошок"
effects.scp009 = "SCP-009"
effects.scp106_withering = "Згасання"
effects.scp966_effect = "Втома"
effects.scp966_mark = "Мітка смерті"

--[[-------------------------------------------------------------------------
Class viewer
---------------------------------------------------------------------------]]
lang.classviewer = "Перегляд класів"
lang.preview = "Попередній перегляд"
lang.random = "Випадковий"
lang.buy = "Купити"
lang.buy_prestige = "Купити - Престиж"
lang.refund = "Повернути"
lang.prestige = "Престиж"
lang.prestige_warn = "Ви збираєтеся підвищити престиж. Цей процес скине ваш рівень, XP, очки відкриття класів та розблоковані класи, а також ви отримаєте 1 очко престижу.\n\nУВАГА: Цю дію неможливо скасувати!"
lang.none = "Немає"
lang.refunded = "Усі видалені класи повернені. Ви отримали %d очок класу та %d очок престижу!"
lang.tierlocked = "Ви повинні купити всі класи з попередніх рівнів, щоб розблокувати класи цього рівня (а також класи з інших категорій)"
lang.xp = "Досвід (XP)"
lang.level = "Рівень"

lang.details = {
	details = "Деталі",
	prestige = "Нагорода за престиж",
	name = "Ім'я",
	tier = "Рівень",
	team = "Команда",
	walk_speed = "Швидкість ходьби",
	run_speed = "Швидкість бігу",
	chip = "Ключ доступу",
	persona = "Підроблене ID",
	loadout = "Основна зброя",
	weapons = "Предмети",
	class = "Клас",
	hp = "Здоров'я",
	speed = "Швидкість",
	health = "Здоров'я",
	sanity = "Глузд",
	slots = "Слоти підтримки",
	no_select = "Неможливо з'явитися в цьому раунді"
}

lang.headers = {
	support = "ПІДТРИМКА",
	classes = "КЛАСИ",
	scp = "SCP"
}

lang.view_cat = {
	classd = "Клас D",
	sci = "Вчені",
	guard = "Служба Безпеки",
	mtf_ntf = "МОГ Епсілон-11",
	mtf_alpha = "МОГ Альфа-1",
	ci = "Повстанці Хаосу",
	goc = "ГОК",
}

local l_weps = {
	pistol = "пістолет",
	smg = "ПК",
	rifle = "гвинтівка",
	shotgun = "дробовик",
	sniper = "снайперська гвинтівка",
}

local l_tiers = {
	low = "Низький рівень",
	mid = "Середній рівень",
	high = "Високий рівень",
}

lang.loadouts = {
	grenade = "Випадкова граната",
	pistol_all = "Випадковий пістолет",
	smg_all = "Випадковий ПК",
	rifle_all = "Випадкова гвинтівка",
	shotgun_all = "Випадковий дробовик",
}

for k_wep, wep in pairs( l_weps ) do
	for k_tier, tier in pairs( l_tiers ) do
		lang.loadouts[k_wep.."_"..k_tier] = tier.." "..wep
	end
end

--[[-------------------------------------------------------------------------
Settings
---------------------------------------------------------------------------]]
lang.settings = {
	settings = "Налаштування ігрового режиму",

	none = "НІЧОГО",
	press_key = "> Натисніть клавішу <",
	client_reset = "Скинути налаштування клієнта",
	server_reset = "Скинути налаштування сервера",

	client_reset_desc = "Ви збираєтеся скинути УСІ свої налаштування у цьому ігровому режимі.\nЦю дію неможливо скасувати!",
	server_reset_desc = "З міркувань безпеки ви не можете скинути налаштування сервера тут.\nЩоб скинути сервер до стандартних налаштувань, введіть 'slc_factory_reset' у консолі сервера і дотримуйтесь інструкцій.\nБудьте уважні, ця дія незворотна і скине ВСЕ!",

	popup_ok = "ГАРАЗД",
	popup_cancel = "СКАСУВАТИ",
	popup_continue = "ПРОДОВЖИТИ",

	enabled = "Увімкнено",
	resource_warn = "Через особливості роботи матеріалів у Garry's Mod, зміни будуть застосовані після повторного підключення до сервера.",

	panels = {
		binds = "Прив'язки клавіш",
		general_config = "Загальні налаштування",
		hud_config = "Налаштування HUD",
		performance_config = "Продуктивність",
		scp_config = "Налаштування SCP",
		skins = "Скіни інтерфейсу",
		resource_packs = "Пакети ресурсів",
		reset = "Скидання режиму",
		cvars = "Редактор ConVar",
	},

	binds = {
		eq_button = "Екіпірування",
		upgrade_tree_button = "Дерево покращень SCP",
		ppshop_button = "Перегляд класів",
		settings_button = "Налаштування ігрового режиму",
		scp_special = "Особлива здатність SCP"
	},

	config = {
		search_indicator = "Показувати індикатор пошуку",
		scp_hud_skill_time = "Показувати перезарядку здібностей SCP",
		smooth_blink = "Увімкнути плавне моргання",
		scp_hud_overload_cd = "Показувати перезарядку перевантаження",
		any_button_close_search = "Будь-яка кнопка закриває меню пошуку",
		hud_hitmarker = "Показувати хитмаркери",
		hud_hitmarker_mute = "Вимкнути звук хітмаркерів",
		hud_damage_indicator = "Показувати індикатор отриманої шкоди",
		scp_hud_dmg_mod = "Показувати множник отриманої шкоди SCP",
		scp_nvmod = "Збільшувати яскравість екрана при грі за SCP",
		dynamic_fov = "Динамічний FOV",
		hud_draw_crosshair = "Малювати приціл",
		hud_hl2_crosshair = "Класичний приціл HL2",
		hud_lq = "Зображення та полігони низької якості (якщо можливо)",
		hud_image_poly = "Зображення замість полігонів (якщо можливо)",
		hud_windowed_mode = "Зсув HUD (для віконного режиму)",
		hud_avoid_roman = "Уникати римських цифр",
		hud_escort = "Показувати зони супроводу",
		hud_timer_always = "Завжди показувати таймер",
		hud_stamina_always = "Завжди показувати витривалість",
		eq_instant_desc = "Миттєвий опис предметів у екіпіруванні",
		scp106_spots = "Завжди показувати точки телепортації SCP-106",

		cvar_slc_support_optout = "Відмова від ролі підтримки",
		cvar_slc_zombie_optout = "Відмова від ролі SCP-049-2",
		cvar_slc_preparing_classd = "З'являтися як Class D при підключенні під час підготовки",
		cvar_slc_language = "Мова",
		cvar_slc_language_options = {
			default = "За замовчуванням",
		},
		cvar_slc_hud_scale = "Масштаб HUD",
		cvar_slc_hud_scale_options = {
			normal = "Звичайний",
			big = "Великий",
			vbig = "Дуже великий",
			small = "Малий",
			vsmall = "Дуже малий",
			imretard = "Мікроскопічний",
		},

		hud_skin_main = "Основний",
		hud_skin_scoreboard = "Табло рахунку",
		hud_skin_hud = "HUD",
		hud_skin_eq = "Екіпірування",

		hud_skin_main_options = {
			custom = "Користувацький",
			default = "За замовчуванням",
			legacy = "Класичний",
		}
	},
}

lang.gamemode_config = {
	loading = "Завантаження...",

	categories = {
		general = "Загальне",
		round = "Раунд",
		xp = "XP",
		support = "Підтримка",
		warheads = "Боєголовки",
		afk = "AFK",
		time = "Час",
		premium = "Преміум",
		scp = "SCP",
		gas = "Газ",
		feature = "Особливості",
		minigames = "Міні-ігри",
	}
}

--[[-------------------------------------------------------------------------
Scoreboard
---------------------------------------------------------------------------]]
lang.unconnected = "Не підключений"

lang.scoreboard = {
	name = "Таблиця рахунку",
	playername = "Ім'я",
	ping = "Пінг",
	level = "Рівень",
	score = "Досвід",
	ranks = "Ранги",
	badges = "Значки",
}

lang.scoreboard_actions = {
	copy_name = "Копіювати ім'я",
	copy_sid = "Копіювати SteamID",
	copy_sid64 = "Копіювати SteamID64",
	open_profile = "Відкрити профіль Steam",
}

lang.ranks = {
	superadmin = "Суперадмін",
	admin = "Адміністратор",
	author = "Автор",
	vip = "VIP",
	contributor = "Спонсор",
	translator = "Перекладач",
	tester = "Тестувальник",
	patron = "Патрон",
	hunter = "Мисливець за багами",
}

--[[-------------------------------------------------------------------------
Покращення
---------------------------------------------------------------------------]]
lang.upgrades = {
	tree = "%s ДЕРЕВО ПОКРАЩЕНЬ",
	points = "Очки",
	cost = "Вартість",
	owned = "Придбано",
	requiresall = "Потрібно",
	requiresany = "Потрібно хоча б одне",
	blocked = "Заблоковано через",
}

--[[-------------------------------------------------------------------------
SCP HUD
---------------------------------------------------------------------------]]
lang.SCPHUD = {
	skill_not_ready = "Здібність на перезарядці!",
	skill_cant_use = "Здібність зараз неможливо використати!",
	overload_cd = "Наступне перевантаження: ",
	overload_ready = "Перевантаження готове!",
	damage_scale = "Отримана шкода",
}

--[[-------------------------------------------------------------------------
Екран інформації
---------------------------------------------------------------------------]]
lang.info_screen = {
	subject = "Суб'єкт",
	class = "Клас",
	team = "Команда",
	status = "Статус",
	objectives = "Завдання",
	details = "Деталі",
	registry_failed = "Помилка отримання даних info_screen_registry",
}

lang.info_screen_registry = {
	escape_time = "Ви втекли за %s хвилин",
	escape_xp = "Ви отримали %s досвіду",
	escape1 = "Ви втекли з об'єкта",
	escape2 = "Ви втекли під час зворотного відліку Альфа боєголовки",
	escape3 = "Ви вижили в укритті",
	escorted = "Вас супроводили",
	killed_by = "Вас убив: %s",
	suicide = "Ви вчинили самогубство",
	unknown = "Причина вашої смерті невідома",
	hazard = "Вас убила небезпека",
	alpha_mia = "Останнє відоме місцезнаходження: Поверхня",
	omega_mia = "Останнє відоме місцезнаходження: Комплекс",
	scp914_death = "Ваше серце зупинилося через SCP-914",
	killer_t = "Команда вашого вбивці: %s",
}

lang.info_screen_type = {
	alive = "Живий",
	escaped = "Втік",
	dead = "Загиблий",
	mia = "Зник безвісти",
	unknown = "Невідомий",
}

--[[-------------------------------------------------------------------------
Загальні фрази
---------------------------------------------------------------------------]]
lang.nothing = "Нічого"
lang.exit = "Вийти"
lang.default = "За замовчуванням"
lang.yes = "Так"
lang.no = "Ні"

--[[-------------------------------------------------------------------------
Різне
---------------------------------------------------------------------------]]
local misc = {}
lang.MISC = misc

misc.escort_zone = "Зона супроводу"

misc.content_checker = {
	title = "Контент ігрового режиму",
	status = "Статус",
	auto_check = "Перевіряти автоматично",
	slist = {
		"Вимкнено",
		"Перевірка",
		"Монтування",
		"Завантаження",
		"Готово",
	},
	btn_workshop = "Колекція в Мастерні",
	btn_download = "Завантажити",
	btn_check = "Перевірити та завантажити",
	allok = "Усі додатки встановлені!",
	nsub_warn = "У вас немає деяких необхідних додатків! Ми завантажили та змонтували їх, але будь ласка, завантажте їх через Steam Workshop. Перевірте консоль, щоб побачити, яких додатків бракує.",
	disabled_warn = "Деякі з необхідних додатків вимкнено! Ігровий режим змонтував їх для вас, але деякий контент все ще може бути відсутнім. Перейдіть у меню та увімкніть вимкнені додатки (список у консолі).",
	missing = "Відсутні додатки",
	disabled = "Вимкнені додатки",
}

misc.omega_warhead = {
	idle = "Боєголовка OMEGA в очікуванні\n\nОчікування введення...",
	waiting = "Боєголовка OMEGA в очікуванні\n\nВведення прийнято!\nОчікування другого введення...",
	failed = "Боєголовка OMEGA заблокована\n\nДругий ввід не виявлено!\nЗачекайте %is",
	no_remote = "Помилка активації OMEGA\n\nНе вдалося встановити зв'язок з боєголовкою!\t",
	active = "Боєголовка OMEGA активована\n\nНегайно евакуюйтеся!\nДетонація через %.2fs",
}

misc.alpha_warhead = {
	idle = "Боєголовка ALPHA в очікуванні\n\nОчікування ядерних кодів...",
	ready = "Боєголовка ALPHA в очікуванні\n\nКоди прийняті!\nОчікування активації...",
	no_remote = "Помилка активації ALPHA\n\nНе вдалося встановити зв'язок з боєголовкою!\t",
	active = "Боєголовка ALPHA активована\n\nНегайно евакуюйтеся!\nДетонація через %.2fs",
}

misc.intercom = {
	name = "Інтерком",
	idle = "Інтерком неактивний",
	active = "Інтерком активний\n\nЗалишок часу: %is",
	cooldown = "Інтерком на перезарядці\n\nЗалишок часу: %is",
}

misc.zones = {
	lcz = "ЛЗС",
	hcz = "ТЗС",
	ez = "ОЗ",
}

misc.buttons = {
	MOUSE1 = "ЛКМ",
	MOUSE2 = "ПКМ",
	MOUSE3 = "СКМ",
}

misc.inventory = {
	unsearched = "Не обшукано",
	search = "Натисніть [%s], щоб обшукати",
	unknown_chip = "Невідомий чіп",
	name = "Ім'я",
	team = "Команда",
	death_time = "Час смерті",
	time = {
		[0] = "Щойно",
		"Близько хвилини тому",
		"Близько двох хвилин тому",
		"Близько трьох хвилин тому",
		"Близько чотирьох хвилин тому",
		"Близько п’яти хвилин тому",
		"Близько шести хвилин тому",
		"Близько семи хвилин тому",
		"Близько восьми хвилин тому",
		"Близько дев’яти хвилин тому",
		"Близько десяти хвилин тому",
		long = "Більше десяти хвилин тому",
	},
}

misc.font = {
	name = "Шрифти",
	content = [[
Користувацький шрифт ігрового режиму не вдалося завантажити! Використовується системний шрифт...
Це проблема Garry's Mod, і я не можу її виправити. Щоб вирішити її самостійно, потрібно вручну видалити кілька файлів.
Перейдіть у 'steamapps/common/GarrysMod/garrysmod/cache/workshop/resource/fonts' і видаліть наступні файли: 'impacted.ttf', 'ds-digital.ttf' та 'unispace.ttf']],
	ok = "Гаразд",
}

misc.commands_aliases = {
	["admin"] = "adminmode",
	["daily"] = "bonus",
	["mute"] = "muteall",
	["unmute"] = "unmuteall",
	["config"] = "settings",
	["cfg"] = "settings",
	["mines"] = "minigames",
}
--[[-------------------------------------------------------------------------
Vests
---------------------------------------------------------------------------]]
local vest = {}
lang.VEST = vest

vest.guard = "Бронежилет Охоронця"
vest.heavyguard = "Бронежилет Важкого Охоронця"
vest.specguard = "Бронежилет Спеціального Охоронця"
vest.guard_medic = "Бронежилет Медика Охорони"
vest.ntf = "Бронежилет МОГ «ДХЛ»"
vest.mtf_medic = "Бронежилет Медика МОГ «ДХЛ»"
vest.ntfcom = "Бронежилет Командира МОГ «ДХЛ»"
vest.alpha1 = "Бронежилет МОГ Альфа-1"
vest.ci = "Бронежилет Повстанців Хаосу"
vest.cicom = "Бронежилет Командира ПХ"
vest.cimedic = "Бронежилет Медика ПХ"
vest.goc = "Бронежилет ГОК"
vest.gocmedic = "Бронежилет Медика ГОК"
vest.goccom = "Бронежилет Командира ГОК"
vest.fire = "Вогнестійкий бронежилет"
vest.electro = "Електростійкий бронежилет"
vest.hazmat = "Захисний костюм"

local dmg = {}
lang.DMG = dmg

dmg.BURN = "Шкода від вогню"
dmg.SHOCK = "Шкода від електрики"
dmg.BULLET = "Шкода від куль"
dmg.FALL = "Шкода від падіння"
dmg.POISON = "Шкода від отрути"

--[[-------------------------------------------------------------------------
Команди
---------------------------------------------------------------------------]]
local teams = {}
lang.TEAMS = teams

teams.unknown = "Невідомо"

teams.SPEC = "Спостерігачі"
teams.CLASSD = "Клас D"
teams.SCI = "Вчені"
teams.GUARD = "СБ"
teams.MTF = "МОГ"
teams.CI = "Повстанці Хаосу"
teams.GOC = "ГОК"
teams.SCP = "SCP"

--[[-------------------------------------------------------------------------
Класи
---------------------------------------------------------------------------]]
lang.UNK_CLASSES = {
	CLASSD = "Невідомий Клас D",
	SCI = "Невідомий Вчений",
	GUARD = "Невідомий Охоронець",
	MTF = "Невідомий МОГ",
	CI = "Невідомий Повстанець Хаосу",
	GOC = "Невідомий Солдат ГОК",
}

local classes = {}
lang.CLASSES = classes

classes.unknown = "Невідомо"
classes.spectator = "Спостерігач"

classes.SCP023 = "SCP-023"
classes.SCP049 = "SCP-049"
classes.SCP0492 = "SCP-049-2"
classes.SCP058 = "SCP-058"
classes.SCP066 = "SCP-066"
classes.SCP096 = "SCP-096"
classes.SCP106 = "SCP-106"
classes.SCP173 = "SCP-173"
classes.SCP457 = "SCP-457"
classes.SCP682 = "SCP-682"
classes.SCP8602 = "SCP-860-2"
classes.SCP939 = "SCP-939"
classes.SCP966 = "SCP-966"
classes.SCP3199 = "SCP-3199"
classes.SCP24273 = "SCP-2427-3"

classes.classd = "Клас D"
classes.veterand = "Ветеран Класу D"
classes.kleptod = "Клептоман Класу D"
classes.contrad = "Клас D із контрабандою"
classes.ciagent = "Агент Повстанців Хаосу"
classes.expd = "Експериментальний Клас D"
classes.classd_prestige = "Маскувальник Класу D"

classes.sciassistant = "Асистент Вченого"
classes.sci = "Вчений"
classes.seniorsci = "Старший Вчений"
classes.headsci = "Головний Вчений"
classes.contspec = "Спеціаліст із Стримування"
classes.sci_prestige = "Утікач Класу D"

classes.guard = "Охоронець"
classes.chief = "Головний Охоронець"
classes.lightguard = "Легкий Охоронець"
classes.heavyguard = "Важкий Охоронець"
classes.specguard = "Спеціаліст Охорони"
classes.guardmedic = "Медик Охорони"
classes.tech = "Технік Охорони"
classes.cispy = "Шпигун ПХ"
classes.lightcispy = "Легкий Шпигун ПХ"
classes.heavycispy = "Важкий Шпигун ПХ"
classes.guard_prestige = "Інженер Охорони"

classes.ntf_1 = "МОГ «ДХЛ» - ПК"
classes.ntf_2 = "МОГ «ДХЛ» - Дробовик"
classes.ntf_3 = "МОГ «ДХЛ» - Гвинтівка"
classes.ntfcom = "Командир МОГ «ДХЛ»"
classes.ntfsniper = "Снайпер МОГ «ДХЛ»"
classes.ntfmedic = "Медик МОГ «ДХЛ»"
classes.alpha1 = "МОГ Альфа-1"
classes.alpha1sniper = "Снайпер МОГ Альфа-1"
classes.alpha1medic = "Медик МОГ Альфа-1"
classes.alpha1com = "Командир МОГ Альфа-1"
classes.ci = "Повстанці Хаосу"
classes.cisniper = "Снайпер Повстанців Хаосу"
classes.cicom = "Командир Повстанців Хаосу"
classes.cimedic = "Медик Повстанців Хаосу"
classes.cispec = "Спеціаліст Повстанців Хаосу"
classes.ciheavy = "Важкий Повстанець Хаосу"
classes.goc = "Солдат ГОК"
classes.gocmedic = "Медик ГОК"
classes.goccom = "Командир ГОК"

local classes_id = {}
lang.CLASSES_ID = classes_id

classes_id.ntf_1 = "MTF NTF"
classes_id.ntf_2 = "MTF NTF"
classes_id.ntf_3 = "MTF NTF"

--[[-------------------------------------------------------------------------
Class Info - NOTE: Each line is limited to 48 characters!
Screen is designed to hold max of 5 lines of text and THERE IS NO internal protection!
Note that last (5th) line should be shorter to prevent text overlapping (about 38 characters)
---------------------------------------------------------------------------]]
local generic_classd = [[- Втечіть з об'єкта
- Уникайте персоналу та об'єктів SCP
- Співпрацюйте з іншими]]

local generic_sci = [[- Втечіть з об'єкта
- Уникайте Класу D та об'єктів SCP
- Співпрацюйте з охороною та МОГ]]

local generic_guard = [[- Рятуйте вчених
- Знищуйте всіх Клас D та SCP
- Слухайтеся свого керівника]]

local generic_cispy = [[- Видавайте себе за охоронця
- Допомагайте Класу D, що вижив
- Саботуйте дії охорони, РІЗНЯЯЯЯ!!!]]

local generic_ntf = [[- Висадіться на об'єкт
- Допомагайте персоналу, що вижив
- Не дозволяйте Класу D та SCP втекти]]

local generic_scp = [[- Втечіть з об'єкта
- Вбивайте всіх, кого зустрінете
- Співпрацюйте з іншими SCP]]

local generic_scp_friendly = [[- Втечіть з об'єкта
- Ви можете співпрацювати з людьми
- Співпрацюйте з іншими SCP]]

lang.CLASS_OBJECTIVES = {
	classd = generic_classd,

	veterand = generic_classd,

	kleptod = generic_classd,

	contrad = generic_classd,

	ciagent = [[- Супроводжуйте Клас D
- Уникайте персоналу та SCP
- Співпрацюйте з іншими]],

	expd = [[- Втечіть з об'єкта
- Уникайте персоналу та SCP
- Ви піддалися дивним експериментам]],

	classd_prestige = [[- Втечіть з об'єкта
- Уникайте персоналу та SCP
- Ви можете красти одяг з мертвих тіл]],

	sciassistant = generic_sci,

	sci = generic_sci,

	seniorsci = generic_sci,

	headsci = generic_sci,

	contspec = generic_sci,

	sci_prestige = [[- Втечіть з об'єкта
- Уникайте персоналу та SCP
- Ви вкрали одяг та ID вченого]],

	guard = generic_guard,

	lightguard = generic_guard,

	heavyguard = generic_guard,

	specguard = generic_guard,

	chief = [[- Рятуйте вчених
- Знищуйте всіх Клас D та SCP
- Віддавайте накази іншим охоронцям]],

	guardmedic = [[- Рятуйте вчених
- Знищуйте всіх Клас D та SCP
- Підтримуйте охоронців за допомогою аптечки]],

	tech = [[- Рятуйте вчених
- Знищуйте всіх Клас D та SCP
- Підтримуйте охоронців своєю туреллю]],

	cispy = generic_cispy,

	lightcispy = generic_cispy,

	heavycispy = generic_cispy,

	guard_prestige = [[- Рятуйте вчених
- Знищуйте всіх Клас D та SCP
- Ви можете тимчасово блокувати двері]],

	ntf_1 = generic_ntf,

	ntf_2 = generic_ntf,

	ntf_3 = generic_ntf,

	ntfmedic = [[- Допомагайте персоналу, що вижив
- Підтримуйте інших МОГ своєю аптечкою
- Не дозволяйте Класу D та SCP втекти]],

	ntfcom = [[- Допомагайте персоналу, що вижив
- Не дозволяйте Класу D та SCP втекти
- Віддавайте накази іншим МОГ]],

	ntfsniper = [[- Допомагайте персоналу, що вижив
- Не дозволяйте Класу D та SCP втекти
- Прикривайте команду з відстані]],

	alpha1 = [[- Захищайте Фонд будь-якою ціною
- Зупиняйте SCP та Клас D
- Вам дозволено ]].."[ЗАСЕКРЕЧЕНО]",

	alpha1sniper = [[- Захищайте Фонд будь-якою ціною
- Зупиняйте SCP та Клас D
- Вам дозволено ]].."[ЗАСЕКРЕЧЕНО]",

	alpha1medic = [[- Захищайте Фонд будь-якою ціною
- Лікуйте свою команду
- Вам дозволено ]].."[ЗАСЕКРЕЧЕНО]",

	alpha1com = [[- Захищайте Фонд будь-якою ціною
- Віддавайте накази своїй команді
- Вам дозволено ]].."[ЗАСЕКРЕЧЕНО]",

	ci = [[- Допомагайте Класу D
- Знищуйте всіх співробітників об'єкта
- Слухайтеся свого керівника]],

	cisniper = [[- Допомагайте Класу D
- Знищуйте всіх співробітників об'єкта
- Прикривайте команду з відстані]],

	cicom = [[- Допомагайте Класу D
- Знищуйте всіх співробітників об'єкта
- Віддавайте накази іншим ПХ]],

	cimedic = [[- Допомагайте Класу D
- Лікуйте інших ПХ своєю аптечкою
- Слухайтеся свого керівника]],

	cispec = [[- Допомагайте Класу D
- Підтримуйте ПХ своєю туреллю
- Слухайтеся свого керівника]],

	ciheavy = [[- Допомагайте Класу D
- Забезпечуйте вогневу підтримку
- Слухайтеся свого керівника]],

	goc = [[- Знищуйте всіх SCP
- Знайдіть та активуйте пристрій ГОК
- Слухайтеся свого керівника]],

	gocmedic = [[- Знищуйте всіх SCP
- Лікуйте солдатів ГОК своєю аптечкою
- Слухайтеся свого керівника]],

	goccom = [[- Знищуйте всіх SCP
- Знайдіть та активуйте пристрій ГОК
- Віддавайте накази солдатам ГОК]],

	SCP023 = generic_scp,

	SCP049 = [[- Втечіть з об'єкта
- Співпрацюйте з іншими SCP
- "Лікуйте" людей]],

	SCP0492 = [[]],

	SCP066 = generic_scp_friendly,

	SCP058 = generic_scp,

	SCP096 = generic_scp,

	SCP106 = generic_scp,

	SCP173 = generic_scp,

	SCP457 = generic_scp,

	SCP682 = generic_scp,

	SCP8602 = generic_scp,

	SCP939 = generic_scp,

	SCP966 = generic_scp,

	SCP24273 = generic_scp,

	SCP3199 = generic_scp,
}

lang.CLASS_DESCRIPTION = {
	classd = [[Складність: Легка
Витривалість: Нормальна
Швидкість: Нормальна
Бойовий потенціал: Низький
Може втекти: Так
Може супроводжувати: Ні
Супроводжується: ПХ

Опис:
Базовий клас. Співпрацюйте з іншими, щоб вижити серед SCP та персоналу об'єкта. Вас можуть супроводжувати члени ПХ.
]],

	veterand = [[Складність: Легка
Витривалість: Висока
Швидкість: Висока
Бойовий потенціал: Низький
Може втекти: Так
Може супроводжувати: Ні
Супроводжується: ПХ

Опис:
Просунутий клас. Має базовий рівень доступу на об'єкті. Співпрацюйте з іншими, щоб вижити серед SCP та персоналу об'єкта. Вас можуть супроводжувати члени ПХ.
]],

	kleptod = [[Складність: Висока
Витривалість: Низька
Швидкість: Дуже висока
Бойовий потенціал: Низький
Може втекти: Так
Може супроводжувати: Ні
Супроводжується: ПХ

Опис:
Дуже корисний клас. Починає з одним випадковим предметом. Співпрацюйте з іншими, щоб вижити серед SCP та персоналу об'єкта. Вас можуть супроводжувати члени ПХ.
]],

	contrad = [[Складність: Середня
Витривалість: Нормальна
Швидкість: Нормальна
Бойовий потенціал: Нормальний
Може втекти: Так
Може супроводжувати: Ні
Супроводжується: ПХ

Опис:
Клас, що має контрабандну зброю. Використовуйте її розумно, оскільки вона недовговічна.
]],

	ciagent = [[Складність: Середня
Витривалість: Дуже висока
Швидкість: Висока
Бойовий потенціал: Нормальний
Може втекти: Ні
Може супроводжувати: Клас D
Супроводжується: Ні

Опис:
Озброєний електрошокером агент CI. Допомагайте Класу D та співпрацюйте з ними. Ви можете супроводжувати Клас D.
]],

	expd = [[Складність: ?
Витривалість: ?
Швидкість: ?
Бойовий потенціал: ?
Може втекти: Так
Може супроводжувати: Ні
Супроводжується: ПХ

Опис:
Клас, який зазнав дивних експериментів на об'єкті. Хто знає, що саме на ньому випробовували...
]],

	classd_prestige = [[Складність: Висока
Витривалість: Нормальна
Швидкість: Нормальна
Бойовий потенціал: Високий
Може втекти: Так
Може супроводжувати: Ні
Супроводжується: ПХ

Опис:
Зовні виглядає як звичайний Клас D, але має здатність красти одяг з мертвих тіл. Співпрацюйте з іншими, щоб вижити серед SCP та персоналу об'єкта. Вас можуть супроводжувати члени ПХ.

Ідея від: Mr.Kiełbasa (переможець конкурсу)
]],

	sciassistant = [[Складність: Середня  
Витривалість: Низька  
Швидкість: Низька  
Бойовий потенціал: Низький  
Може втекти: Так  
Може супроводжувати: Ні  
Супроводжується: Охорона, МОГ

Опис:  
Базовий клас. Співпрацюйте з персоналом об'єкта та уникайте SCP. Вас можуть супроводжувати члени МОГ.
]],

	sci = [[Складність: Середня  
Витривалість: Нормальна  
Швидкість: Нормальна  
Бойовий потенціал: Низький  
Може втекти: Так  
Може супроводжувати: Ні  
Супроводжується: Охорона, МОГ

Опис:  
Один із вчених. Співпрацюйте з персоналом об'єкта та уникайте SCP. Вас можуть супроводжувати члени МОГ.
]],

	seniorsci = [[Складність: Легка  
Витривалість: Висока  
Швидкість: Висока  
Бойовий потенціал: Нормальний  
Може втекти: Так  
Може супроводжувати: Ні  
Супроводжується: Охорона, МОГ  

Опис:  
Один із вчених. Має вищий рівень доступу. Також має примітивну зброю. Співпрацюйте з персоналом об'єкта та уникайте SCP. Вас можуть супроводжувати члени МОГ.
]],

	headsci = [[Складність: Легка  
Витривалість: Дуже висока  
Швидкість: Дуже висока  
Бойовий потенціал: Низький  
Може втекти: Так  
Може супроводжувати: Ні  
Супроводжується: Охорона, МОГ

Опис:  
Найкращий серед вчених. Має більше корисних предметів та більше HP. Співпрацюйте з персоналом об'єкта та уникайте SCP. Вас можуть супроводжувати члени МОГ.
]],

	contspec = [[Складність: Середня  
Витривалість: Дуже висока  
Швидкість: Дуже висока  
Бойовий потенціал: Низький  
Може втекти: Так  
Може супроводжувати: Ні  
Супроводжується: Охорона, МОГ

Опис:  
Вчений із високим рівнем доступу, додатковими ресурсами та високою витривалістю. Співпрацюйте з персоналом об'єкта та уникайте SCP. Вас можуть супроводжувати члени МОГ.
]],

	sci_prestige = [[Складність: Висока  
Витривалість: Нормальна  
Швидкість: Нормальна  
Бойовий потенціал: Середній  
Може втекти: Так  
Може супроводжувати: Ні  
Супроводжується: ПХ 

Опис:  
Клас D, що пробрався у шафу вченого та вкрав його одяг і ID. Видавайте себе за вченого та співпрацюйте з Класом D та ПХ.  

Ідея від: Artieusz (переможець конкурсу)
]],

	guard = [[Складність: Легка  
Витривалість: Нормальна  
Швидкість: Нормальна  
Бойовий потенціал: Нормальний  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Базовий охоронець. Використовуйте свою зброю та спорядження для допомоги персоналу та знищення SCP та Класу D. Ви можете супроводжувати вчених.
]],

	lightguard = [[Складність: Висока  
Витривалість: Низька  
Швидкість: Висока  
Бойовий потенціал: Низький  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Легкий охоронець. Має високу мобільність, але низьку броню та менше HP. Використовуйте свою зброю та спорядження для допомоги персоналу та знищення SCP та Класу D. Ви можете супроводжувати вчених.
]],

	heavyguard = [[Складність: Середня  
Витривалість: Висока  
Швидкість: Низька  
Бойовий потенціал: Високий  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Важкий охоронець. Має менше корисних предметів, але кращу броню та більше HP. Використовуйте свою зброю та спорядження для допомоги персоналу та знищення SCP та Класу D. Ви можете супроводжувати вчених.
]],

	specguard = [[Складність: Висока  
Витривалість: Висока  
Швидкість: Низька  
Бойовий потенціал: Дуже високий  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Спеціаліст охорони. Має менше корисних предметів, більше HP та високу бойову ефективність. Використовуйте свою зброю та спорядження для допомоги персоналу та знищення SCP та Класу D. Ви можете супроводжувати вчених.
]],

	chief = [[Складність: Легка  
Витривалість: Нормальна  
Швидкість: Нормальна  
Бойовий потенціал: Нормальний  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Головний охоронець. Має трохи кращі бойові можливості та електрошокер. Використовуйте свою зброю та спорядження для допомоги персоналу та знищення SCP та Класу D. Ви можете супроводжувати вчених.
]],

	guardmedic = [[Складність: Висока  
Витривалість: Висока  
Швидкість: Висока  
Бойовий потенціал: Низький  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Медик охорони. Озброєний пістолетом, має аптечку та електрошокер. Використовуйте свою зброю та спорядження для допомоги персоналу та знищення SCP та Класу D. Ви можете супроводжувати вчених.
]],

	tech = [[Складність: Висока  
Витривалість: Нормальна  
Швидкість: Нормальна  
Бойовий потенціал: Високий  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Технік охорони. Озброєний пістолетом, має турель із трьома режимами стрільби (утримуйте E на турелі, щоб відкрити меню). Використовуйте свою зброю та спорядження для допомоги персоналу та знищення SCP та Класу D. Ви можете супроводжувати вчених.
]],

	cispy = [[Складність: Дуже висока  
Витривалість: Нормальна  
Швидкість: Нормальна  
Бойовий потенціал: Нормальний  
Може втекти: Ні  
Може супроводжувати: Клас D  
Супроводжується: Ні  

Опис:  
Шпигун ПХ. Видавайте себе за охоронця та допомагайте Класу D.
]],

	lightcispy = [[Складність: Дуже висока  
Витривалість: Низька  
Швидкість: Висока  
Бойовий потенціал: Низький  
Може втекти: Ні  
Може супроводжувати: Клас D  
Супроводжується: Ні  

Опис:  
Легкий шпигун ПХ. Має високу утилітарність. Видавайте себе за охоронця та допомагайте Класу D.
]],

	heavycispy = [[Складність: Дуже висока  
Витривалість: Висока  
Швидкість: Низька  
Бойовий потенціал: Високий  
Може втекти: Ні  
Може супроводжувати: Клас D  
Супроводжується: Ні  

Опис:  
Важкий шпигун ПХ. Має менше корисних предметів, кращу броню та більше здоров’я. Видавайте себе за охоронця та допомагайте Класу D.
]],

	guard_prestige = [[Складність: Висока  
Витривалість: Нормальна  
Швидкість: Нормальна  
Бойовий потенціал: Високий  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Один з охоронців. Має пристрій, який може тимчасово блокувати двері у їхньому поточному стані. Використовуйте свою зброю та спорядження для допомоги персоналу та знищення SCP та Класу D. Ви можете супроводжувати вчених.  

Ідея від: F"$LAYER (переможець конкурсу)
]],

	ntf_1 = [[Складність: Середня  
Витривалість: Нормальна  
Швидкість: Висока  
Бойовий потенціал: Нормальний  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Боєць МОГ «ДХЛ», озброєний Пістолетом-Кулеметом. Прибувайте на об'єкт та забезпечуйте його безпеку. Допомагайте персоналу та знищуйте SCP та Клас D.
]],

	ntf_2 = [[Складність: Середня  
Витривалість: Нормальна  
Швидкість: Висока  
Бойовий потенціал: Нормальний  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Боєць МОГ «ДХЛ», озброєний дробовиком. Прибувайте на об'єкт та забезпечуйте його безпеку. Допомагайте персоналу та знищуйте SCP та Клас D.
]],

	ntf_3 = [[Складність: Середня  
Витривалість: Нормальна  
Швидкість: Висока  
Бойовий потенціал: Нормальний  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Боєць МОГ «ДХЛ», озброєний гвинтівкою. Прибувайте на об'єкт та забезпечуйте його безпеку. Допомагайте персоналу та знищуйте SCP та Клас D.
]],

	ntfmedic = [[Складність: Висока  
Витривалість: Висока  
Швидкість: Висока  
Бойовий потенціал: Низький  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Медик МОГ «ДХЛ», озброєний пістолетом та аптечкою. Прибувайте на об'єкт та забезпечуйте його безпеку. Допомагайте персоналу та знищуйте SCP та Клас D.
]],

	ntfcom = [[Складність: Висока  
Витривалість: Висока  
Швидкість: Дуже висока  
Бойовий потенціал: Високий  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Командир МОГ «ДХЛ», озброєний марксманською гвинтівкою. Прибувайте на об'єкт та забезпечуйте його безпеку. Допомагайте персоналу та знищуйте SCP та Клас D.
]],

	ntfsniper = [[Складність: Висока  
Витривалість: Нормальна  
Швидкість: Нормальна  
Бойовий потенціал: Високий  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Снайпер МОГ «ДХЛ», озброєний снайперською гвинтівкою. Прибувайте на об'єкт та забезпечуйте його безпеку. Допомагайте персоналу та знищуйте SCP та Клас D.
]],

	alpha1 = [[Складність: Середня  
Витривалість: Екстремальна  
Швидкість: Дуже висока  
Бойовий потенціал: Високий  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Боєць МОГ Альфа-1. Має важку броню, високу утилітарність, озброєний гвинтівкою. Прибувайте на об'єкт та забезпечуйте його безпеку. Допомагайте персоналу та знищуйте SCP та Клас D.
]],

	alpha1sniper = [[Складність: Висока  
Витривалість: Дуже висока  
Швидкість: Висока  
Бойовий потенціал: Дуже високий  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Снайпер МОГ Альфа-1. Озброєний снайперською гвинтівкою, має високу точність та бойову ефективність. Підтримуйте команду та усувайте загрози.
]],

	alpha1medic = [[Складність: Висока  
Витривалість: Дуже висока  
Швидкість: Висока  
Бойовий потенціал: Високий  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Медик МОГ Альфа-1. Використовуйте аптечку для підтримки команди, забезпечуйте виживання союзників під час місій.
]],

	alpha1com = [[Складність: Висока  
Витривалість: Дуже висока  
Швидкість: Висока  
Бойовий потенціал: Високий  
Може втекти: Ні  
Може супроводжувати: Вчених  
Супроводжується: Ні  

Опис:  
Командир МОГ Альфа-1. Віддавайте накази, координуйте операції та забезпечуйте виконання місій Фонду.
]],

	ci = [[Складність: Середня  
Витривалість: Висока  
Швидкість: Висока  
Бойовий потенціал: Нормальний  
Може втекти: Ні  
Може супроводжувати: Клас D  
Супроводжується: Ні  

Опис:  
Боєць Повстанців Хаосу. Проникайте на об'єкт, допомагайте Класу D та знищуйте персонал об'єкта.
]],

	cisniper = [[Складність: Середня  
Витривалість: Нормальна  
Швидкість: Висока  
Бойовий потенціал: Високий  
Може втекти: Ні  
Може супроводжувати: Клас D  
Супроводжується: Ні  

Опис:  
Снайпер Повстанців Хаосу. Проникайте на об'єкт, підтримуйте команду та знищуйте ворогів на дистанції.
]],

	cicom = [[Складність: Середня  
Витривалість: Дуже висока  
Швидкість: Висока  
Бойовий потенціал: Високий  
Може втекти: Ні  
Може супроводжувати: Клас D  
Супроводжується: Ні  

Опис:  
Командир Повстанців Хаосу. Координує дії групи, віддає накази та організовує атаки на персонал об'єкта.
]],

	cimedic = [[Складність: Середня  
Витривалість: Висока  
Швидкість: Висока  
Бойовий потенціал: Нормальний  
Може втекти: Ні  
Може супроводжувати: Клас D  
Супроводжується: Ні  

Опис:  
Медик Повстанців Хаосу. Використовуйте аптечку для лікування союзників та підтримки підрозділу під час місій.
]],

	cispec = [[Складність: Середня  
Витривалість: Висока  
Швидкість: Висока  
Бойовий потенціал: Високий  
Може втекти: Ні  
Може супроводжувати: Клас D  
Супроводжується: Ні  

Опис:  
Спеціаліст Повстанців Хаосу. Має турель для забезпечення вогневої підтримки та утримання стратегічних позицій.
]],

	ciheavy = [[Складність: Середня  
Витривалість: Висока  
Швидкість: Середня  
Бойовий потенціал: Дуже високий  
Може втекти: Ні  
Може супроводжувати: Клас D  
Супроводжується: Ні  

Опис:  
Важкий боєць Повстанців Хаосу. Має посилену броню та потужне озброєння для атак на персонал об'єкта.
]],

	goc = [[Складність: Середня  
Витривалість: Висока  
Швидкість: Висока  
Бойовий потенціал: Високий  
Може втекти: Ні  
Може супроводжувати: Ні  
Супроводжується: Ні  

Опис:  
Солдат ГОК. Знищуйте всі SCP, використовуйте планшет для пошуку пристрою ГОК, активуйте його та захищайте. Після успішної активації прямуйте в укриття.
]],

	gocmedic = [[Складність: Середня  
Витривалість: Висока  
Швидкість: Висока  
Бойовий потенціал: Високий  
Може втекти: Ні  
Може супроводжувати: Ні  
Супроводжується: Ні  

Опис:  
Медик ГОК. Виконує ті ж завдання, що і солдат ГОК, але додатково має аптечку для підтримки союзників.
]],

	goccom = [[Складність: Середня  
Витривалість: Висока  
Швидкість: Висока  
Бойовий потенціал: Дуже високий  
Може втекти: Ні  
Може супроводжувати: Ні  
Супроводжується: Ні  

Опис:  
Командир ГОК. Координує операції, керує підрозділом та забезпечує знищення SCP. Має димові гранати для тактичних маневрів.
]],

	SCP0492 = [[Загальна інформація:
Зомбі, створений SCP-049. Може бути одним із наступних типів:

Звичайний зомбі:
Складність: Легка | Витривалість: Нормальна | Швидкість: Нормальна | Шкода: Нормальна
Збалансований варіант з усередненими характеристиками.

Асасин-зомбі:
Складність: Середня | Витривалість: Низька | Швидкість: Висока | Шкода: Нормальна/Висока
Найшвидший, але має найменше здоров'я та шкоди.

Вибуховий зомбі:
Складність: Середня | Витривалість: Висока | Швидкість: Низька | Шкода: Нормальна/Висока
Має низьку швидкість, але високу витривалість та найбільшу шкоду.

Плюючий зомбі:
Складність: Середня | Витривалість: Висока | Швидкість: Низька | Шкода: Нормальна/Висока
Найповільніший тип зомбі, але має високу шкоду та найбільше здоров'я.
]],
}

--[[-------------------------------------------------------------------------
Weapons
---------------------------------------------------------------------------]]
lang.GenericUpgrades = {
	outside_buff = {
		name = "Любитель почіпати траву.",
		info = "Отримайте додатковий захист від куль і можливість регенерації на поверхні.\n\t• Додатковий захист від куль: [%def]\n\t• Додатковий захист від пласких куль: [flat] dmg\n\t• Опинившись на поверхні, за короткий час зцілює на [buff_hp] HP\n\t• Коли не в бою швидко відновлює [%regen_min] - [%regen_max] (в масштабі часу) отриманої шкоди від куль\n\t• Нанесення шкоди зцілює вас протягом [%heal_min] - [%heal_max] (в масштабі часу) від нанесеної шкоди\n\t• Повернення до комплексу анулює всі активні зцілення"
	}
}

lang.CommonSkills = {
	c_button_overload = {
		name = "Перевантаження",
		dsc = "Дозволяє перевантажити більшість замкнених дверей. Перевантажені двері відчиняються (або зачиняються) на короткий проміжок часу"
	},
	c_dmg_mod = {
		name = "Захист від пошкоджень",
		dsc = "Поточний захист: [mod]\nПоточний захист: [flat]\n\nЦе захист від отриманої непрямої шкоди. Він враховує лише модифікатори часу та зовнішнє покращення. Специфічні модифікатори SCP не включені!\n\nЗовнішнє покращення: [buff]",
		dmg = "ШКОДА",
		not_bought = "Не куплено.",
		not_surface = "Не працює всередині комплексу",
		buff = "\n   • Поточне відновлення: %s від отриманих кульових пошкоджень\n   • Поточне зцілення: %s від завданої шкоди",
	},
}

local wep = {}
lang.WEAPONS = wep

wep.SCP023 = {
	skills = {
		_overview = { "passive", "drain", "clone", "hunt" },
		drain = {
			name = "Виснаження витривалості",
			dsc = "Почніть виснажувати найближчих гравців. Якщо всі гравці залишають зону, здатність миттєво йде на перезарядку",
		},
		clone = {
			name = "Мімік",
			dsc = "Розмістіть міміка, який імітуватиме роботу вашої пасивки (включаючи покращення). Він буде блукати і переслідувати гравців поблизу",
		},
		hunt = {
			name = "Полювання",
			dsc = "Миттєво вбиває вашу здобич або людей поруч із нею, і переміщає вас до її тіла",
		},
		passive = {
			name = "Пасивна здібність",
			dsc = "Зіткнення з гравцями підпалює їх. Ви також не можете зіткнутися з дверима",
		},
		drain_bar = {
			name = "Виснаження",
			dsc = "Залишковий час виснаження",
		},
	},

	upgrades = {
		parse_description = true,

		passive = {
			name = "Розпечене Вугілля",
			info = "Покращує вашу пасивну здатність, збільшуючи шкоду від горіння на [+burn_power]",
		},
		invis1 = {
			name = "Невидиме Полум'я I",
			info = "Покращує вашу пасивну здібність\n\t• Ви зникаєте для віддалених гравців\n\t• Гравці, які не бачать вас, не будуть додані до списку здобичі\n\t• Це оновлення також застосовується до вашого міміка\n\t• Ви стаєте повністю невидимим на відстані [invis_range] одиниць від вас",
		},
		invis2 = {
			name = "Невидиме Полум'я II",
			info = "Покращує вашу невидимість\n\t• Ви стаєте повністю невидимим на відстані [invis_range] одиниць",
		},
		prot1 = {
			name = "Безсмертний Вогонь I",
			info = "Посилює вашу пасивну здатність, надаючи [-prot] захист від куль",
		},
		prot2 = {
			name = "Безсмертний Вогонь II",
			info = "Підвищує захист від куль до [-prot]",
		},
		drain1 = {
			name = "Виснаження Сил I",
			info = "Покращує вашу здатність виснажувати\n\t• Тривалість збільшена на [+drain_dur]\n\t• Максимальна відстань збільшена на [+drain_dist]",
		},
		drain2 = {
			name = "Виснаження Сил II",
			info = "Покращує вашу здатність виснажувати\n\t• Тривалість збільшена в [/drain_rate]\n\t• Зцілити на [%drain_heal] вкрадену витривалість",
		},
		drain3 = {
			name = "Виснаження Сил III",
			info = "Покращує вашу здатність виснажувати\n\t• Тривалість збільшена на [+drain_dur]\n\t• Максимальна відстань збільшена на [+drain_dist]",
		},
		drain4 = {
			name = "Виснаження Сил IV",
			info = "Покращує вашу здатність виснажувати\n\t• Тривалість збільшена в [/drain_rate]\n\t• Зцілити на [%drain_heal] вкрадену витривалість",
		},
		hunt1 = {
			name = "Вічний Вогонь I",
			info = "Посилює вашу мисливську здібність\n\t• КД зменшено на [-hunt_cd]",
		},
		hunt2 = {
			name = "Вічний Вогонь II",
			info = "Посилює вашу мисливську здібність\n\t• КД зменшено на [-hunt_cd]\n\t• Радіус пошуку випадкової здобичі збільшено на [+hunt_range]",
		},
	}
}

wep.SCP049 = {
	zombies = {
		normal = "Стандартний Зомбі",
		assassin = "Зомбі-Марафонець",
		boomer = "Зомбі-Камікадзе",
		heavy = "Зомбі-Плювака",
	},
	zombies_desc = {
		normal = "Стандартний зомбі\n\t• Має як легку, так і важку атаки\n\t• Гідний вибір зі збалансованою статистикою",
		assassin = "Зомбі-Марафонець\n\t• Має швидшу легку атаку \n\t• Найшвидший, але має найнижчий рівень здоров'я та шкоди",
		boomer = "Важкий зомбі-камікадзе\n\t• Має потужну атаку та здатність до вибуху\n\t• Низька швидкість пересування, але високі показники здоров'я та шкоди",
		heavy = "Важкий зомбі-плювака\n\t• Має потужну атаку та здатність плюватися\n\t• Найповільніший тип зомбі, але має високу шкоду і найбільше здоров'я",
	},
	skills = {
		_overview = { "passive", "choke", "surgery", "boost" },
		surgery_failed = "Операція не вдалася!",

		choke = {
			name = "Лікарський Дотик",
			dsc = "Душить пацієнта до смерті. Ця здатність може бути перервана при отриманні достатньої кількості пошкоджень",
		},
		surgery = {
			name = "Хірургічна Операція",
			dsc = "Виконує операцію на тілі, перетворюючи його на екземпляр SCP-049-2. Отримання шкоди перериває операцію",
		},
		boost = {
			name = "Вставай!",
			dsc = "Забезпечує прискорення для вас і всіх прилеглих екземплярів SCP-049-2",
		},
		passive = {
			name = "Пасивна здібність",
			dsc = "Зомбі поблизу вас отримують захист від куль",
		},
		choke_bar = {
			name = "Лікарський Дотик",
			dsc = "Коли шкала заповнена, пацієнт гине",
		},
		surgery_bar = {
			name = "Хірургічна Операція",
			dsc = "Час, що залишився до завершення операції",
		},
		boost_bar = {
			name = "Вставай!",
			dsc = "Час, що залишився до завершення прискорення",
		},
	},

	upgrades = {
		parse_description = true,

		choke1 = {
			name = "Лікарський Дотик I",
			info = "Покращує удушення\n\t• КД зменшено на [-choke_cd]\n\t• Поріг пошкодження збільшено на [+choke_dmg]",
		},
		choke2 = {
			name = "Лікарський Дотик II",
			info = "Покращує удушення\n\t• Швидкість удушення збільшена на [+choke_rate]\n\t• Сповільнення після удушення зменшується на [-choke_slow]",
		},
		choke3 = {
			name = "Лікарський Дотик III",
			info = "Покращує удушення\n\t• КД зменшено на [-choke_cd]\n\t• Поріг пошкодження збільшено на [+choke_dmg]\n\t• Швидкість удушення збільшено на [+choke_rate]",
		},
		buff1 = {
			name = "Вставай I",
			info = "Покращує прискорення\n\t• КД зменшено на [-buff_cd]\n\t• Тривалість прискорення збільшено на [+buff_dur]",
		},
		buff2 = {
			name = "Вставай II",
			info = "Покращує прискорення\n\t• Радіус дії збільшено на [+buff_radius]\n\t• Потужність здібності збільшена на [+buff_power]",
		},
		surgery_cd1 = {
			name = "Хірургічна Точність I",
			info = "Скорочує час операції на [surgery_time]секунд\n\t• Це покращення зберігається",
		},
		surgery_cd2 = {
			name = "Хірургічна Точність II",
			info = "Скорочує час операції на [surgery_time] секунд\n\t• Це покращення зберігається",
		},
		surgery_heal = {
			name = "Трансплантація",
			info = "Покращує ваші хірургічні здібності\n\t• Після операції ви зцілюєтесь на [surgery_heal] HP\n\t• Після операції всі зомбі поблизу зцілюються на [surgery_zombie_heal] HP",
		},
		surgery_dmg = {
			name = "Нестримний Хірург",
			info = "Отримання шкоди більше не зупиняє операцію",
		},
		surgery_prot = {
			name = "Тверда Рука",
			info = "Під час операції отримує [-surgery_prot] захисту від куль",
		},
		zombie_prot = {
			name = "Медбрат",
			info = "Кожен SCP-049-2 поблизу отримує захист від куль\n\t• Захист для кожного зомбі поблизу: [%zombie_prot]\n\t• Максимальний захист: [%zombie_prot_max]",
		},
		zombie_lifesteal = {
			name = "Переливання Крові I",
			info = "Зомбі отримують [%zombie_ls] здоров'я від нанесення базових атак",
		},
		stacks_hp = {
			name = "Ін'єкція Стероїдів",
			info = "При створенні зомбі їхнє здоров'я збільшується на [%stacks_hp] за кожну попередню операцію",
		},
		stacks_dmg = {
			name = "Радикальна Терапія",
			info = "При створенні зомбі їхня шкода збільшується на [%stacks_dmg] за кожну попередню операцію",
		},
		zombie_heal = {
			name = "Переливання Крові II",
			info = "Ви зцілюєтеся на [%zombie_heal] від будь-якої шкоди, завданої зомбі поблизу",
		}
	}
}

wep.SCP0492 = {
	skills = {
		prot = {
			name = "Захист",
			dsc = "Ви отримуєте певний захист від пошкоджень, перебуваючи поблизу SCP-049",
		},
		boost = {
			name = "Прискорення",
			dsc = "Показує, коли у вас активне прискорення SCP-049",
		},
		light_attack = {
			name = "Легка Атака",
			dsc = "Здійснює легку атаку",
		},
		heavy_attack = {
			name = "Важка Атака",
			dsc = "Здійснює важку атаку",
		},
		rapid = {
			name = "Швидка Атака",
			dsc = "Здійснює швидку атаку",
		},
		shot = {
			name = "Плювок",
			dsc = "Здійснює плювок",
		},
		explode = {
			name = "Банзай!",
			dsc = "Можна активувати, коли у вас 50 HP або менше. Надає тимчасове безсмертя і прискорення. Через деякий час ви вибухнете, завдавши шкоди в невеликому радіусі",
		},
		boost_bar = {
			name = "Прискорення",
			dsc = "Залишок прискорення",
		},
		explode_bar = {
			name = "Банзай!",
			dsc = "Час, що залишився до вибуху",
		},
	},

	upgrades = {
		parse_description = true,

		primary1 = {
			name = "Первинна Атака I",
			info = "Покращує вашу основну атаку\n\t• КД зменшено на [-primary_cd]",
		},
		primary2 = {
			name = "Первинна Атака II",
			info = "Покращує вашу основну атаку\n\t• КД зменшено на [-primary_cd]\n\t• Шкоду збільшено на [+primary_dmg]",
		},
		secondary1 = {
			name = "Вторинна Атака I",
			info = "Покращує вашу вторинну атаку\n\t• Шкоду збільшено на [+secondary_dmg]",
		},
		secondary2 = {
			name = "Вторинна Атака II",
			info = "Покращує вашу вторинну атаку\n\t• Шкоду збільшено на [+secondary_dmg]\n\t• КД зменшено на [-secondary_cd]",
		},
		overload = {
			name = "Перевантаження",
			info = "Надає додаткові [overloads] перевантаження дверей",
		},
		buff = {
			name = "Вставай!",
			info = "Посилює ваш захист і прискорення SCP-049\n\t• Потужність захисту: [%+prot_power]\n\t• Покращення прискорення: [++buff_power]",
		},
	}
}

wep.SCP058 = {
	skills = {
		_overview = { "primary_attack", "shot", "explosion" },
		primary_attack = {
			name = "Основна Атака",
			dsc = "Атакує своїм жалом. Застосовується отрута, якщо придбано відповідне покращення",
		},
		shot = {
			name = "Постріл",
			dsc = "Стріляє снарядом у напрямку вашої цілі. Снаряд має балістичну фізику. Покращення, пов'язані з пострілом, впливають на перезарядку, швидкість, розмір та ефекти цієї здатності",
		},
		explosion = {
			name = "Кривавий Вибух",
			dsc = "Здійснює вибух зіпсованої крові, що завдає величезної шкоди цілям поблизу",
		},
		shot_stacks = {
			name = "Пострілів залишилось",
			dsc = "Показує збережену кількість пострілів. Різні оновлення впливають на максимальну кількість і час охолодження",
		},
	},

	upgrades = {
		parse_description = true,

		attack1 = {
			name = "Отруйне Жало I",
			info = "Додає отруту до основних атак"
		},
		attack2 = {
			name = "Отруйне Жало II",
			info = "Посилює шкоду атаки, отрути та зменшує час перезарядки\n\t• Додає [prim_dmg] шкоди до атак\n\t• Отрута від атаки завдає [pp_dmg] шкоди\n\t• Час перезарядки зменшується на [prim_cd] сек"
		},
		attack3 = {
			name = "Отруйне Жало III",
			info = "Посилює шкоду отрути та зменшує час перезарядки\n\t• Якщо ціль не отруєна, миттєво застосовує 2 рівні отрути\n\t• Отрута від атаки завдає [pp_dmg] шкоди\n\t• Час перезарядки зменшується на [prim_cd] сек"
		},
		shot = {
			name = "Заражена Кров",
			info = "Додає отруту до атак пострілами"
		},
		shot11 = {
			name = "Сплеск I",
			info = "Збільшує шкоду та розмір снаряда, але також збільшує час перезарядки та уповільнює снаряд\n\t• Шкода снаряда збільшена на [+shot_damage]\n\t• Зміна розміру снаряда: [++shot_size]\n\t• Зміна швидкості снаряда: [++shot_speed]\n\t• Час перезарядки збільшено на [shot_cd] сек"
		},
		shot12 = {
			name = "Сплеск II",
			info = "Збільшує шкоду та розмір снаряда, але також збільшує час перезарядки та уповільнює снаряд\n\t• Шкода снаряда збільшена на [+shot_damage]\n\t• Зміна розміру снаряда: [++shot_size]\n\t• Зміна швидкості снаряда: [++shot_speed]\n\t• Час перезарядки збільшено на [shot_cd] сек"
		},
		shot21 = {
			name = "Кривава Мла I",
			info = "Постріл залишає туман при зіткненні, який завдає шкоди та отруює всіх, хто його торкається.\n\t• Пряма та вибухова шкода прибрана\n\t• Хмара завдає [cloud_damage] шкоди при контакті\n\t• Отрута від хмари завдає [sp_dmg] шкоди\n\t• Ліміт стосів пострілу: [stacks]\n\t• Час перезарядки збільшено на [shot_cd] сек\n\t• Швидкість набору стосів: [/+regen_rate]"
		},
		shot22 = {
			name = "Кривава Мла II",
			info = "Посилює туман, залишений після пострілів.\n\t• Хмара завдає [cloud_damage] шкоди при контакті\n\t• Отрута від хмари завдає [sp_dmg] шкоди\n\t• Швидкість набору стосів: [/+regen_rate]"
		},
		shot31 = {
			name = "Мультипостріл I",
			info = "Дозволяє стріляти з високою швидкістю при утриманні кнопки атаки\n\t• Відкриває можливість швидкісної стрільби\n\t• Пряма та вибухова шкода прибрана\n\t• Ліміт стосів пострілу: [stacks]\n\t• Швидкість набору стосів: [/+regen_rate]\n\t• Зміна розміру снаряда: [++shot_size]\n\t• Зміна швидкості снаряда: [++shot_speed]"
		},
		shot32 = {
			name = "Мультипостріл II",
			info = "Збільшує максимальну кількість стосів та покращує швидкість пострілів\n\t• Ліміт стосів пострілу: [stacks]\n\t• Швидкість набору стосів: [/+regen_rate]\n\t• Зміна розміру снаряда: [++shot_size]\n\t• Зміна швидкості снаряда: [++shot_speed]"
		},
		exp1 = {
			name = "Аортальний Вибух",
			info = "Розблоковує вибухову здатність, яка завдає величезної шкоди всім цілям поруч. Ця здатність активується, коли ваше здоров'я вперше падає нижче кожного кратного 1000 HP. Якщо придбано при здоров’ї менше 1000 HP, перше отримане ушкодження активує цю здатність. Попередні пороги більше не можуть бути досягнуті (навіть при зціленні)."
		},
		exp2 = {
			name = "Отруйний Вибух",
			info = "Підсилює вашу вибухову здатність\n\t• Накладає 2 рівні отрути\n\t• Радіус вибуху збільшений на [+explosion_radius]"
		},
	}
}

wep.SCP066 = {
	skills = {
		_overview = { "eric", "music", "dash", "boost" },
		not_threatened = "Ви не відчуваєте достатньої загрози для атаки!",

		music = {
			name = "Симфонія №2",
			dsc = "Якщо ви відчуваєте загрозу, ви можете випромінювати гучну музику",
		},
		dash = {
			name = "Ривок",
			dsc = "Ривок вперед. Якщо ви вдарите гравця, то прикріпитеся до нього на короткий час. Використовуйте знову, щоб від'єднатися",
		},
		boost = {
			name = "Підсилення",
			dsc = "Отримайте один із трьох підсилень, які зараз активні. Після використання воно буде замінене наступним. Сила всіх підсилень зростає з кожним пасивним рівнем (обмеження — [cap] рівнів).\n\nПоточне підсилення: [boost]\n\nПрискорення: [speed]\nЗахист від куль: [def]\nРегенерація: [regen]",
			buffs = {
				"Швидкість",
				"Захист від куль",
				"Регенерація",
			},
		},
		eric = {
			name = "Ерік?",
			dsc = "Ви запитуєте неозброєних гравців, чи вони Ерік. Отримуєте один пасивний рівень кожного разу",
		},
		music_bar = {
			name = "Симфонія №2",
			dsc = "Час, що залишився для цієї здібності",
		},
		dash_bar = {
			name = "Час прикріплення",
			dsc = "Час, що залишився для перебування на цілі",
		},
		boost_bar = {
			name = "Підсилення",
			dsc = "Час, що залишився для цієї здібності",
		},
	},

	upgrades = {
		parse_description = true,

		eric1 = {
			name = "Ерік? I",
			info = "Зменшує час перезарядки пасивної здібності на [-eric_cd]",
		},
		eric2 = {
			name = "Ерік? II",
			info = "Зменшує час перезарядки пасивної здібності на [-eric_cd]",
		},
		music1 = {
			name = "Симфонія №2 I",
			info = "Покращує вашу основну атаку\n\t• Час перезарядки зменшено на [-music_cd]\n\t• Дальність збільшено на [+music_range]",
		},
		music2 = {
			name = "Симфонія №2 II",
			info = "Покращує вашу основну атаку\n\t• Час перезарядки зменшено на [-music_cd]\n\t• Дальність збільшено на [+music_range]",
		},
		music3 = {
			name = "Симфонія №2 III",
			info = "Покращує вашу основну атаку\n\t• Шкода збільшена на [+music_damage]",
		},
		dash1 = {
			name = "Ривок I",
			info = "Покращує вашу здатність ривка\n\t• Час перезарядки зменшено на [-dash_cd]\n\t• Ви можете залишатися на цілі довше на [+detach_time]",
		},
		dash2 = {
			name = "Ривок II",
			info = "Покращує вашу здатність ривка\n\t• Час перезарядки зменшено на [-dash_cd]\n\t• Ви можете залишатися на цілі довше на [+detach_time]",
		},
		dash3 = {
			name = "Ривок III",
			info = "Покращує вашу здатність ривка\n\t• При повторному використанні ви відштовхнетеся, замість від'єднання\n\t• Під час відштовхування ви можете прикріпитися до іншого гравця\n\t• Ви не можете прикріпитися до того ж гравця, від якого тільки що відштовхнулися",
		},
		boost1 = {
			name = "Підсилення I",
			info = "Покращує вашу здатність підсилення\n\t• Час перезарядки зменшено на [-boost_cd]\n\t• Тривалість збільшена на [+boost_dur]",
		},
		boost2 = {
			name = "Підсилення II",
			info = "Покращує вашу здатність підсилення\n\t• Час перезарядки зменшено на [-boost_cd]\n\t• Сила збільшена на [+boost_power]",
		},
		boost3 = {
			name = "Підсилення III",
			info = "Покращує вашу здатність підсилення\n\t• Тривалість збільшена на [+boost_dur]\n\t• Сила збільшена на [+boost_power]",
		},
	}
}

wep.SCP096 = {
	skills = {
		_overview = { "passive", "lunge", "regen", "special" },
		lunge = {
			name = "Стрибок",
			dsc = "Стрибок вперед під час люті. Миттєво завершує лють. Після стрибка ви не з'їсте тіло",
		},
		regen = {
			name = "Регенерація",
			dsc = "Сядьте на місце та перетворюйте стоси регенерації на здоров'я",
		},
		special = {
			name = "Полювання Закінчено",
			dsc = "Зупиняє лють. Отримуйте стоси регенерації за кожну активну ціль",
		},
		passive = {
			name = "Пасивна Здібність",
			dsc = "Якщо хтось подивиться на вас, ви впадаєте в лють. Ви миттєво вбиваєте гравців, які вас розлютили",
		},
	},

	upgrades = {
		parse_description = true,

		rage = {
			name = "Гнів",
			info = "Отримання [rage_dmg] шкоди за [rage_time] секунд від одного гравця змусить вас впасти в лють",
		},
		heal1 = {
			name = "Пожирання I",
			info = "Після вбивства цілі з'їжте її тіло та отримайте захист від куль на деякий час\n\t• Зцілення за такт: [heal]\n\t• Кількість тактів: [heal_ticks]\n\t• Захист від куль: [-prot]",
		},
		heal2 = {
			name = "Пожирання II",
			info = "Покращує вашу здатність пожирання\n\t• Зцілення за такт: [heal]\n\t• Кількість тактів: [heal_ticks]\n\t• Захист від куль: [-prot]",
		},
		multi1 = {
			name = "Нескінченна Лють I",
			info = "Дозволяє вбивати кілька цілей під час люті протягом обмеженого часу після першого вбивства\n\t• Максимальна кількість цілей: [multi]\n\t• Ліміт часу: [multi_time] сек\n\t• Отримана шкода від куль після першого вбивства збільшена на [+prot]",
		},
		multi2 = {
			name = "Нескінченна Лють II",
			info = "Дозволяє вбивати ще більше цілей під час люті\n\t• Максимальна кількість цілей: [multi]\n\t• Ліміт часу: [multi_time] сек\n\t• Отримана шкода від куль після першого вбивства збільшена на [+prot]",
		},
		regen1 = {
			name = "Крик Відчаю I",
			info = "Покращує вашу здатність регенерації\n\t• Зцілення збільшене на [+regen_mult]",
		},
		regen2 = {
			name = "Крик Відчаю II",
			info = "Покращує вашу здатність регенерації\n\t• Швидкість отримання стосів збільшена на [/regen_stacks]",
		},
		regen3 = {
			name = "Крик Відчаю III",
			info = "Покращує вашу здатність регенерації\n\t• Зцілення збільшене на [+regen_mult]\n\t• Швидкість отримання стосів збільшена на [/regen_stacks]",
		},
		spec1 = {
			name = "Милосердя I",
			info = "Покращує вашу особливу здатність та додає зменшення розуму\n\t• Отримуйте на [+spec_mult] більше стосів\n\t• Втрата розуму: [sanity]",
		},
		spec2 = {
			name = "Милосердя II",
			info = "Покращує вашу особливу здатність\n\t• Отримуйте на [+spec_mult] більше стосів\n\t• Втрата розуму: [sanity]",
		},
	}
}

wep.SCP106 = {
	cancel = "Натисніть [%s], щоб скасувати",

	skills = {
		_overview = { "passive", "withering", "teleport", "trap" },
		withering = {
			name = "Згасання",
			dsc = "Накладає ефект згасання на ціль. Згасання поступово сповільнює ціль із часом. Атака по цілі, яка знаходиться в Кишеньковому Вимірі, миттєво її вбиває\n\nТривалість ефекту: [dur]\nМаксимальне сповільнення: [slow]",
		},
		trap = {
			name = "Пастка",
			dsc = "Розміщує пастку на стіні. Коли пастка активується, ціль сповільнюється, і ви можете використати цю здатність ще раз, щоб миттєво телепортуватися до пастки",
		},
		teleport = {
			name = "Телепорт",
			dsc = "Використовуйте для встановлення точки телепортації. Якщо утримувати цю здатність біля вже існуючої точки телепортації, можна вибрати місце призначення, відпустіть кнопку, щоб телепортуватися",
		},
		passive = {
			name = "Колекція Зубів",
			dsc = "Кулі не можуть вас убити, але можуть тимчасово збити з ніг. Ви також можете проходити крізь двері. Торкання гравця телепортує його в Кишеньковий Вимір. Кожен гравець, телепортований туди, дає один зуб. Зібрані зуби посилюють вашу здатність згасання",
		},
		teleport_cd = {
			name = "Телепорт",
			dsc = "Показує час перезарядки точки телепортації",
		},
		passive_bar = {
			name = "Колекція Зубів",
			dsc = "Коли ця шкала досягне нуля, вас зіб'ють з ніг",
		},
		trap_bar = {
			name = "Пастка",
			dsc = "Показує, скільки часу пастка залишатиметься активною",
		}
	},

	upgrades = {
		parse_description = true,

		passive1 = {
			name = "Колекція Зубів I",
			info = "Покращує вашу пасивну здатність\n\t• Збільшує шкоду, необхідну для того, щоб збити вас з ніг, на [+passive_dmg]\n\t• Скорочує оглушення після збиття на [-passive_cd]",
		},
		passive2 = {
			name = "Колекція Зубів II",
			info = "Покращує вашу пасивну здатність\n\t• Збільшує шкоду, необхідну для того, щоб збити вас з ніг, на [+passive_dmg]\n\t• Шкода, завдана гравцям, збільшена на [+teleport_dmg]",
		},
		passive3 = {
			name = "Колекція Зубів III",
			info = "Покращує вашу пасивну здатність\n\t• Збільшує шкоду, необхідну для того, щоб збити вас з ніг, на [+passive_dmg]\n\t• Скорочує оглушення після збиття на [-passive_cd]\n\t• Шкода, завдана гравцям, збільшена на [+teleport_dmg]",
		},
		withering1 = {
			name = "Згасання I",
			info = "Покращує вашу здатність згасання\n\t• Час перезарядки зменшений на [-attack_cd]\n\t• Базова тривалість ефекту збільшена на [+withering_dur]",
		},
		withering2 = {
			name = "Згасання II",
			info = "Покращує вашу здатність згасання\n\t• Час перезарядки зменшений на [-attack_cd]\n\t• Базова величина сповільнення збільшена на [+withering_slow]",
		},
		withering3 = {
			name = "Згасання III",
			info = "Покращує вашу здатність згасання\n\t• Час перезарядки зменшений на [-attack_cd]\n\t• Базова тривалість ефекту збільшена на [+withering_dur]\n\t• Базова величина сповільнення збільшена на [+withering_slow]",
		},
		tp1 = {
			name = "Телепорт I",
			info = "Покращує вашу здатність телепортації\n\t• Максимальна кількість точок збільшена до [spot_max]\n\t• Час перезарядки точки зменшено на [-spot_cd]",
		},
		tp2 = {
			name = "Телепорт II",
			info = "Покращує вашу здатність телепортації\n\t• Максимальна кількість точок збільшена до [spot_max]\n\t• Час перезарядки телепортації зменшено на [-tp_cd]",
		},
		tp3 = {
			name = "Телепорт III",
			info = "Покращує вашу здатність телепортації\n\t• Максимальна кількість точок збільшена до [spot_max]\n\t• Час перезарядки точки зменшено на [-spot_cd]\n\t• Час перезарядки телепортації зменшено на [-tp_cd]",
		},
		trap1 = {
			name = "Пастка I",
			info = "Покращує вашу здатність встановлення пастки\n\t• Час перезарядки пастки зменшено на [-trap_cd]\n\t• Час існування пастки збільшений на [+trap_life]",
		},
		trap2 = {
			name = "Пастка II",
			info = "Покращує вашу здатність встановлення пастки\n\t• Час перезарядки пастки зменшено на [-trap_cd]\n\t• Час існування пастки збільшений на [+trap_life]",
		},
	}
}

local scp173_prot = {
	name = "Зміцнений Бетон",
	info = "• Отримуйте [%prot] зменшення шкоди від куль\n• Ця здатність складається з іншими подібними вміннями",
}

wep.SCP173 = {
	restricted = "Обмежено!",

	skills = {
		_overview = { "gas", "decoy", "stealth" },
		gas = {
			name = "Газ",
			dsc = "Випускає хмару подразнюючого газу, яка сповільнює, затуманює зір і прискорює моргання гравців поблизу",
		},
		decoy = {
			name = "Приманка",
			dsc = "Розміщує приманку, яка відволікає і виснажує розум гравців",
		},
		stealth = {
			name = "Непомітність",
			dsc = "Активує режим непомітності. У цьому режимі ви невидимі та можете проходити крізь двері. Також ви стаєте невразливими до шкоди (зональна шкода, наприклад вибухи, все ще можуть вас вразити), але при цьому ви не можете завдавати шкоди гравцям і взаємодіяти зі світом",
		},
		looked_at = {
			name = "Замри!",
			dsc = "Показує, якщо хтось дивиться на вас",
		},
		next_decoy = {
			name = "Запас приманок",
			dsc = "Кількість доступних приманок",
		},
		stealth_bar = {
			name = "Непомітність",
			dsc = "Час, що залишився для здібності непомітності",
		},
	},

	upgrades = {
		parse_description = true,

		horror_a = {
			name = "Переважна Присутність",
			info = "Радіус жаху збільшений на [+horror_dist]",
		},
		horror_b = {
			name = "Тривожна Присутність",
			info = "Виснаження розуму від жаху збільшене на [+horror_sanity]",
		},
		attack_a = {
			name = "Швидкий Вбивця",
			info = "Радіус вбивства збільшений на [+snap_dist]",
		},
		attack_b = {
			name = "Маневрений Вбивця",
			info = "Радіус пересування збільшений на [+move_dist]",
		},
		gas1 = {
			name = "Газ I",
			info = "Радіус газу збільшений на [+gas_dist]",
		},
		gas2 = {
			name = "Газ II",
			info = "Радіус газу збільшений на [+gas_dist], а час перезарядки газу зменшений на [-gas_cd]",
		},
		decoy1 = {
			name = "Приманка I",
			info = "Час перезарядки приманки зменшений на [-decoy_cd]",
		},
		decoy2 = {
			name = "Приманка II",
			info = "• Час перезарядки приманки зменшений до 0.5 с\n• Початковий час перезарядки тепер застосовується до запасу приманок\n• Ліміт приманок збільшений до [decoy_max]",
		},
		stealth1 = {
			name = "Непомітність I",
			info = "Час перезарядки непомітності зменшений на [-stealth_cd]",
		},
		stealth2 = {
			name = "Непомітність II",
			info = "• Час перезарядки непомітності зменшений на [-stealth_cd]\n• Тривалість непомітності збільшена на [+stealth_dur]",
		},
		prot1 = scp173_prot,
		prot2 = scp173_prot,
		prot3 = scp173_prot,
		prot4 = scp173_prot,
	},
}

wep.SCP457 = {
	skills = {
		_overview = { "passive", "fireball", "trap", "ignite" },
		fireball = {
			name = "Вогняна Куля",
			dsc = "Витрати пального: [cost]\nЗапускає вогняну кулю, яка летітиме вперед, поки не зіткнеться з чимось",
		},
		trap = {
			name = "Пастка",
			dsc = "Витрати пального: [cost]\nВстановлює пастку, яка підпалює гравців, що її торкаються",
		},
		ignite = {
			name = "Внутрішня Лють",
			dsc = "Витрати пального: [cost] за кожне створене полум'я\nВипускає хвилі вогню навколо вас. Радіус цієї здібності необмежений, і кожне наступне кільце полум'я споживає більше пального. Цю здібність неможливо перервати",
		},
		passive = {
			name = "Пасивна Здібність",
			dsc = "Ви підпалюєте всіх, кого торкаєтесь. Підпалювання гравців додає пальне",
		},
	},

	upgrades = {
		parse_description = true,

		passive1 = {
			name = "Живий Факел I",
			info = "Покращує вашу пасивну здібність\n\t• Радіус вогню збільшений на [+fire_radius]\n\t• Отримання пального збільшене на [+fire_fuel]",
		},
		passive2 = {
			name = "Живий Факел II",
			info = "Покращує вашу пасивну здібність\n\t• Радіус вогню збільшений на [+fire_radius]\n\t• Шкода від вогню збільшена на [+fire_dmg]",
		},
		passive3 = {
			name = "Живий Факел III",
			info = "Покращує вашу пасивну здібність\n\t• Отримання пального збільшене на [+fire_fuel]\n\t• Шкода від вогню збільшена на [+fire_dmg]",
		},
		passive_heal1 = {
			name = "Полум'я Життя I",
			info = "Ви зцілюєтесь на [%fire_heal] від шкоди, завданої вогнем будь-якої вашої здібності",
		},
		passive_heal2 = {
			name = "Полум'я Життя II",
			info = "Ви зцілюєтесь на [%fire_heal] від шкоди, завданої вогнем будь-якої вашої здібності",
		},
		fireball1 = {
			name = "Гарячий М'яч I",
			info = "Покращує вашу здібність вогняної кулі\n\t• Час перезарядки зменшений на [-fireball_cd]\n\t• Швидкість збільшена на [+fireball_speed]\n\t• Витрати пального зменшені на [-fireball_cost]",
		},
		fireball2 = {
			name = "Гарячий М'яч II",
			info = "Покращує вашу здібність вогняної кулі\n\t• Шкода збільшена на [+fireball_dmg]\n\t• Розмір збільшений на [+fireball_size]\n\t• Витрати пального зменшені на [-fireball_cost]",
		},
		fireball3 = {
			name = "Гарячий М'яч III",
			info = "Покращує вашу здібність вогняної кулі\n\t• Час перезарядки зменшений на [-fireball_cd]\n\t• Шкода збільшена на [+fireball_dmg]\n\t• Швидкість збільшена на [+fireball_speed]",
		},
		trap1 = {
			name = "Це Пастка! I",
			info = "Покращує вашу здібність пастки\n\t• Додаткові пастки: [trap_max]\n\t• Витрати пального зменшені на [-trap_cost]\n\t• Час існування збільшений на [+trap_time]",
		},
		trap2 = {
			name = "Це Пастка! II",
			info = "Покращує вашу здібність пастки\n\t• Додаткові пастки: [trap_max]\n\t• Шкода збільшена на [+trap_dmg]\n\t• Час існування збільшений на [+trap_time]",
		},
		trap3 = {
			name = "Це Пастка! III",
			info = "Покращує вашу здібність пастки\n\t• Витрати пального зменшені на [-trap_cost]\n\t• Шкода збільшена на [+trap_dmg]\n\t• Час існування збільшений на [+trap_time]",
		},
		ignite1 = {
			name = "Внутрішня Лють I",
			info = "Покращує вашу здібність внутрішньої люті\n\t• Частота хвиль збільшена на [/ignite_rate]\n\t• Перше кільце створює [ignite_flames] додаткових вогнів",
		},
		ignite2 = {
			name = "Внутрішня Лють II",
			info = "Покращує вашу здібність внутрішньої люті\n\t• Витрати пального зменшені на [-ignite_cost]\n\t• Перше кільце створює [ignite_flames] додаткових вогнів",
		},
		fuel = {
			name = "Доставка Пального!",
			info = "Миттєво отримайте [fuel] пального",
		},
	}
}

wep.SCP682 = {
	skills = {
		_overview = { "primary", "secondary", "charge", "shield" },
		primary = {
			name = "Базова атака",
			dsc = "Атакуйте рукою прямо перед собою, завдаючи незначної шкоди",
		},
		secondary = {
			name = "Укус",
			dsc = "Утримуйте кнопку, щоб підготувати потужну атаку, яка завдасть великої шкоди в конусоподібній області перед вами",
		},
		charge = {
			name = "Ривок",
			dsc = "Після короткої затримки зробіть ривок вперед та станьте незупинним. На повній швидкості ви вбиваєте всіх на своєму шляху та отримуєте можливість пробивати більшість дверей. Ця здібність має бути розблокована у дереві покращень",
		},
		shield = {
			name = "Щит",
			dsc = "Щит поглинає всю непряму шкоду та шкоду від падіння. Ця здібність покращується відповідно до придбаних оновлень у вашому дереві навичок",
		},
		shield_bar = {
			name = "Щит",
			dsc = "Поточний рівень щита, що поглинатиме всю непряму шкоду та шкоду від падіння",
		},
	},

	upgrades = {
		parse_description = true,

		shield_a = {
			name = "Посилений Щит",
			info = "Посилює ваш щит\n\t• Потужність щита: [%shield]\n\t• Час перезарядки: [%shield_cd]",
		},
		shield_b = {
			name = "Регенеруючий Щит",
			info = "Змінює характеристики вашого щита\n\t• Потужність щита: [%shield]\n\t• Час перезарядки: [%shield_cd]\n\t• Час перезарядки починається після повного руйнування щита\n\t• Під час перезарядки щита ви відновлюєте [shield_regen] HP/с",
		},
		shield_c = {
			name = "Щит Жертви",
			info = "Змінює характеристики вашого щита\n\t• Час перезарядки: [%shield_cd]\n\t• Час перезарядки починається після повного руйнування щита\n\t• Потужність щита дорівнює вашому максимальному здоров'ю\n\t• Після руйнування ви втрачаєте [shield_hp] максимального HP",
		},
		shield_d = {
			name = "Відбивний Щит",
			info = "Змінює характеристики вашого щита\n\t• Потужність щита: [%shield]\n\t• Час перезарядки: [%shield_cd]\n\t• Час перезарядки починається після повного руйнування щита\n\t• Ваш щит блокує лише [%shield_pct] вхідної шкоди\n\t• [%reflect_pct] заблокованої шкоди відбивається назад у нападника",
		},

		shield_1 = {
			name = "Щит I",
			info = "Додає ефекти до вашого щита. Після повного руйнування щита ви отримуєте додаткову швидкість руху [+shield_speed_pow] на [shield_speed_dur] секунд",
		},
		shield_2 = {
			name = "Щит II",
			info = "Додає ефекти до вашого щита. Після повного руйнування щита ви отримуєте додаткову швидкість руху [+shield_speed_pow] на [shield_speed_dur] секунд. Додатково, кожен 1 пункт отриманої шкоди скорочує час перезарядки щита на [shield_cdr] секунд",
		},

		attack_1 = {
			name = "Посилений Удар",
			info = "Покращує вашу базову атаку\n\t• Час перезарядки зменшений на [-prim_cd]\n\t• Шкода збільшена на [prim_dmg]",
		},
		attack_2 = {
			name = "Посилений Укус",
			info = "Покращує вашу атаку укусом\n\t• Дальність збільшена на [+sec_range]\n\t• Швидкість руху під час підготовки атаки збільшена на [+sec_speed]",
		},
		attack_3 = {
			name = "Безжальний Удар",
			info = "Покращує як базову атаку, так і укус\n\t• Обидві атаки накладають ефект кровотечі\n\t• Укус при повному заряді викликає перелом",
		},

		charge_1 = {
			name = "Ривок",
			info = "Розблоковує здібність ривка",
		},
		charge_2 = {
			name = "Безжальний Ривок",
			info = "Посилює здібність ривка\n\t• Час перезарядки зменшений на [-charge_cd]\n\t• Тривалість оглушення та уповільнення зменшена на [-charge_stun]",
		},
	}
}

wep.SCP8602 = {
	skills = {
		_overview = { "passive", "primary", "defense", "charge" },
		primary = {
			name = "Атака",
			dsc = "Виконує базову атаку",
		},
		defense = {
			name = "Захисна Стойка",
			dsc = "Утримуйте для активації. Під час утримання ви поступово отримуєте захист, але також сповільнюєтесь. Відпустіть, щоб зробити ривок вперед і завдати шкоди, рівної [dmg_ratio] від поглиненої шкоди. Ця здібність не має обмеження за тривалістю",
		},
		charge = {
			name = "Ривок",
			dsc = "З часом збільшує швидкість і завдає шкоди першому гравцеві перед вами. Якщо атакований гравець знаходиться близько до стіни, він буде пришпилений до неї, і ви виконаєте потужну атаку",
		},
		passive = {
			name = "Пасивна Здібність",
			dsc = "Ви бачите гравців всередині вашого лісу і протягом певного часу після того, як вони його покинули. Гравці всередині лісу втрачають розум, а якщо у них немає розуму — вони втрачають здоров'я. Ви зцілюєтесь за рахунок відібраного розуму/здоров'я у гравців всередині лісу. Це зцілення може перевищувати ваш максимальний рівень здоров'я",
		},
		overheal_bar = {
			name = "Надлишкове Здоров'я",
			dsc = "Кількість перевищеного здоров'я",
		},
		defense_bar = {
			name = "Захист",
			dsc = "Поточний рівень захисту",
		},
		charge_bar = {
			name = "Ривок",
			dsc = "Час, що залишився для здібності ривка",
		},
	},

	upgrades = {
		parse_description = true,

		passive1 = {
			name = "Густий Ліс I",
			info = "Покращує вашу пасивну здібність\n\t• Максимальне надлишкове здоров'я збільшене на [+overheal]\n\t• Швидкість дії пасивної здібності збільшена на [/passive_rate]\n\t• Час виявлення гравців збільшений на [+detect_time]",
		},
		passive2 = {
			name = "Густий Ліс II",
			info = "Покращує вашу пасивну здібність\n\t• Максимальне надлишкове здоров'я збільшене на [+overheal]\n\t• Швидкість дії пасивної здібності збільшена на [/passive_rate]\n\t• Час виявлення гравців збільшений на [+detect_time]",
		},
		primary = {
			name = "Простий, але Небезпечний",
			info = "Покращує вашу базову атаку\n\t• Час перезарядки зменшений на [-primary_cd]\n\t• Шкода збільшена на [+primary_dmg]",
		},
		def1a = {
			name = "Швидка Броня",
			info = "Змінює вашу здібність захисної стойки\n\t• Час активації зменшений на [-def_time]\n\t• Час перезарядки збільшений на [+def_cooldown]",
		},
		def1b = {
			name = "Швидка Активація",
			info = "Змінює вашу здібність захисної стойки\n\t• Час активації збільшений на [+def_time]\n\t• Час перезарядки зменшений на [-def_cooldown]",
		},
		def2a = {
			name = "Довгий Ривок",
			info = "Змінює вашу здібність захисної стойки\n\t• Максимальна дистанція ривка збільшена на [+def_range]\n\t• Ширина ривка зменшена на [-def_width]",
		},
		def2b = {
			name = "Незграбний Ривок",
			info = "Змінює вашу здібність захисної стойки\n\t• Максимальна дистанція ривка зменшена на [-def_range]\n\t• Ширина ривка збільшена на [+def_width]",
		},
		def3a = {
			name = "Важка Броня",
			info = "Змінює вашу здібність захисної стойки\n\t• Максимальний рівень захисту збільшений на [+def_prot]\n\t• Максимальне сповільнення збільшене на [+def_slow]",
		},
		def3b = {
			name = "Легка Броня",
			info = "Змінює вашу здібність захисної стойки\n\t• Максимальний рівень захисту зменшений на [-def_prot]\n\t• Максимальне сповільнення зменшене на [-def_slow]",
		},
		def4 = {
			name = "Ефективна Броня",
			info = "Покращує вашу здібність захисної стойки\n\t• Множник конверсії шкоди збільшений на [+def_mult]",
		},
		charge1 = {
			name = "Ривок I",
			info = "Покращує вашу здібність ривка\n\t• Час перезарядки зменшений на [-charge_cd]\n\t• Тривалість збільшена на [+charge_time]\n\t• Базова шкода збільшена на [+charge_dmg]",
		},
		charge2 = {
			name = "Ривок II",
			info = "Покращує вашу здібність ривка\n\t• Дальність збільшена на [+charge_range]\n\t• Тривалість збільшена на [+charge_time]\n\t• Шкода від пришпилення до стіни збільшена на [+charge_pin_dmg]",
		},
		charge3 = {
			name = "Ривок III",
			info = "Покращує вашу здібність ривка\n\t• Швидкість збільшена на [+charge_speed]\n\t• Якщо рівень ривка перевищує 80%, будь-який удар вважається потужною атакою\n\t• Пришпилення гравця до стіни ламає йому кістки",
		},
	}
}

wep.SCP939 = {
	skills = {
		_overview = { "passive", "primary", "trail", "special" },
		primary = {
			name = "Атака",
			dsc = "Кусає всіх у конусоподібній зоні перед вами",
		},
		trail = {
			name = "ANM-C227",
			dsc = "Утримуйте кнопку, щоб залишати слід ANM-C227 позаду себе",
		},
		special = {
			name = "Виявлення",
			dsc = "Починає виявлення гравців навколо вас",
		},
		passive = {
			name = "Пасивна Здібність",
			dsc = "Ви не бачите гравців, але бачите звукові хвилі. Навколо вас є аура ANM-C227",
		},
		special_bar = {
			name = "Виявлення",
			dsc = "Залишковий час виявлення",
		},
	},

	upgrades = {
		parse_description = true,

		passive1 = {
			name = "Аура I",
			info = "Покращує вашу пасивну здібність\n\t• Радіус аури збільшений на [+aura_radius]\n\t• Шкода аури збільшена на [aura_damage]",
		},
		passive2 = {
			name = "Аура II",
			info = "Покращує вашу пасивну здібність\n\t• Радіус аури збільшений на [+aura_radius]\n\t• Шкода аури збільшена на [aura_damage]",
		},
		passive3 = {
			name = "Аура III",
			info = "Покращує вашу пасивну здібність\n\t• Радіус аури збільшений на [+aura_radius]\n\t• Шкода аури збільшена на [aura_damage]",
		},
		attack1 = {
			name = "Укус I",
			info = "Покращує вашу здібність атаки\n\t• Час перезарядки зменшений на [-attack_cd]\n\t• Шкода збільшена на [+attack_dmg]",
		},
		attack2 = {
			name = "Укус II",
			info = "Покращує вашу здібність атаки\n\t• Час перезарядки зменшений на [-attack_cd]\n\t• Дальність збільшена на [+attack_range]",
		},
		attack3 = {
			name = "Укус III",
			info = "Покращує вашу здібність атаки\n\t• Шкода збільшена на [+attack_dmg]\n\t• Дальність збільшена на [+attack_range]\n\t• Ваші атаки мають шанс викликати кровотечу",
		},
		trail1 = {
			name = "Амнезія I",
			info = "Покращує вашу здібність ANM-C227\n\t• Радіус збільшений на [+trail_radius]\n\t• Швидкість генерації зарядів збільшена на [/trail_rate]",
		},
		trail2 = {
			name = "Амнезія II",
			info = "Покращує вашу здібність ANM-C227\n\t• Шкода збільшена на [trail_dmg]\n\t• Максимальна кількість зарядів збільшена на [+trail_stacks]",
		},
		trail3a = {
			name = "Амнезія III A",
			info = "Покращує вашу здібність ANM-C227\n\t• Час існування сліду збільшений на [+trail_life]\n\t• Радіус збільшений на [+trail_radius]",
		},
		trail3b = {
			name = "Амнезія III B",
			info = "Покращує вашу здібність ANM-C227\n\t• Максимальна кількість зарядів збільшена на [+trail_stacks]",
		},
		trail3c = {
			name = "Амнезія III C",
			info = "Покращує вашу здібність ANM-C227\n\t• Швидкість генерації зарядів збільшена на [/trail_rate]",
		},
		special1 = {
			name = "Ехолокація I",
			info = "Покращує вашу спеціальну здібність\n\t• Час перезарядки зменшений на [-special_cd]\n\t• Радіус збільшений на [+special_radius]",
		},
		special2 = {
			name = "Ехолокація II",
			info = "Покращує вашу спеціальну здібність\n\t• Час перезарядки зменшений на [-special_cd]\n\t• Тривалість збільшена на [+special_times]",
		},
	}
}

wep.SCP966 = {
	fatigue = "Рівень втоми:",

	skills = {
		_overview = { "passive", "attack", "channeling", "mark" },
		attack = {
			name = "Базова атака",
			dsc = "Виконує базову атаку. Ви можете атакувати лише гравців, які мають щонайменше 10 рівнів втоми. Атаковані гравці втрачають частину рівнів втоми. Ефекти цієї атаки залежать від покращень у дереві навичок",
		},
		channeling = {
			name = "Направлення",
			dsc = "Активує здібність, вибрану в дереві навичок",
		},
		mark = {
			name = "Мітка Смерті",
			dsc = "Позначає гравця. Позначені гравці будуть отримувати рівні втоми від інших гравців поблизу",
		},
		passive = {
			name = "Втома",
			dsc = "Час від часу ви додаєте рівні втоми гравцям поблизу. Ви також отримуєте пасивні заряди за кожен доданий рівень втоми",
		},
		channeling_bar = {
			name = "Направлення",
			dsc = "Час, що залишився для здібності направлення",
		},
		mark_bar = {
			name = "Мітка Смерті",
			dsc = "Час, що залишився до зникнення мітки на гравцеві",
		},
	},

	upgrades = {
		parse_description = true,

		passive1 = {
			name = "Втома I",
			info = "Покращує вашу пасивну здібність\n\t• Швидкість дії пасиву збільшена на [/passive_rate]",
		},
		passive2 = {
			name = "Втома II",
			info = "Покращує вашу пасивну здібність\n\t• Швидкість дії пасиву збільшена на [/passive_rate]\n\t• Радіус пасиву збільшений на [+passive_radius]",
		},
		basic1 = {
			name = "Гострі Кігті I",
			info = "Покращує вашу базову атаку, збільшуючи шкоду на [%basic_dmg] за кожні [basic_stacks] пасивних зарядів. Також, накопичення пасивних зарядів відкриває:\n\t• [bleed1_thr] зарядів: Викликає кровотечу, якщо ціль не страждає від неї\n\t• [drop1_thr] зарядів: Зменшує втрату рівнів втоми у цілі до [%drop1]\n\t• [slow_thr] зарядів: Уповільнює ціль на [-slow_power] протягом [slow_dur] секунд",
		},
		basic2 = {
			name = "Гострі Кігті II",
			info = "Покращує вашу базову атаку, збільшуючи шкоду на [%basic_dmg] за кожні [basic_stacks] пасивних зарядів. Також, накопичення пасивних зарядів відкриває:\n\t• [bleed2_thr] зарядів: Викликає кровотечу при ударі\n\t• [drop2_thr] зарядів: Зменшує втрату рівнів втоми у цілі до [%drop2]\n\t• [hb_thr] зарядів: Викликає сильну кровотечу замість звичайної",
		},
		heal = {
			name = "Поглинання Крові",
			info = "Відновлює [%heal_rate] здоров'я за кожен пасивний заряд на кожен рівень втоми цілі при ударі",
		},
		channeling_a = {
			name = "Нескінченна Втома",
			info = "Розблоковує здібність направлення, що дозволяє фокусуватися на одній цілі\n\t• Пасивна здібність вимикається під час направлення\n\t• Час перезарядки: [channeling_cd] секунд\n\t• Максимальна тривалість: [channeling_time] секунд\n\t• Ціль отримуватиме 1 рівень втоми кожні [channeling_rate] секунд",
		},
		channeling_b = {
			name = "Поглинання Енергії",
			info = "Розблоковує здібність направлення, що дозволяє поглинати рівні втоми у гравців поблизу\n\t• Пасивна здібність вимикається під час направлення\n\t• Час перезарядки: [channeling_cd] секунд\n\t• Максимальна тривалість: [channeling_time] секунд\n\t• Кожні [channeling_rate] секунд забирає 1 рівень втоми у всіх гравців поблизу та додає їх до ваших пасивних зарядів",
		},
		channeling = {
			name = "Посилене Направлення",
			info = "Покращує вашу здібність направлення\n\t• Радіус направлення збільшений на [+channeling_range_mul]\n\t• Тривалість направлення збільшена на [+channeling_time_mul]",
		},
		mark1 = {
			name = "Смертоносна Мітка I",
			info = "Покращує здібність мітки:\n\t• Швидкість передачі рівнів втоми збільшена на [/mark_rate]",
		},
		mark2 = {
			name = "Смертоносна Мітка II",
			info = "Покращує здібність мітки:\n\t• Швидкість передачі рівнів втоми збільшена на [/mark_rate]\n\t• Радіус передачі рівнів втоми збільшений на [+mark_range]",
		},
	}
}

wep.SCP24273 = {
	skills = {
		_overview = { "change", "primary", "secondary", "special" },
		primary = {
			name = "Ривок / Камуфляж",
			dsc = "\nСуддя:\nРивок вперед, завдаючи шкоди всім на шляху\n\nПрокурор:\nАктивує камуфляж. Під час камуфляжу ви менш помітні. Використання здібностей, рух або отримання шкоди перериває його",
		},
		secondary = {
			name = "Екзамен / Спостереження",
			dsc = "\nСуддя:\nПочинає фокусування на цілі. Після завершення уповільнює ціль і завдає шкоди. Якщо зірвано пряму видимість, здібність переривається, і ви самі уповільнюєтесь\n\nПрокурор:\nЗалишаєте своє тіло та спостерігаєте з перспективи випадкового гравця поблизу. Ваша пасивна здібність також працює з його точки зору",
		},
		special = {
			name = "Суд / Примара",
			dsc = "\nСуддя:\nЗалишаєтесь на місці та змушуєте всіх поблизу рухатися до вас. Після завершення гравці, які знаходяться поруч, отримують шкоду та відкидаються\n\nПрокурор:\nВходите в форму примари. У цьому стані ви не отримуєте шкоди (за винятком вибухів і прямої атаки)",
		},
		change = {
			name = "Суддя / Прокурор",
			dsc = "\nПеремикається між режимами Судді та Прокурора\n\nСуддя:\nЗавдана вами шкода збільшується відповідно до рівня доказів проти цілі. Атакуючи ціль, ви знижуєте рівень її доказів. Атака гравця з повним рівнем доказів миттєво вбиває його\n\nПрокурор:\nВи уповільнені та отримуєте захист від куль. Дивлячись на гравців, ви збираєте докази проти них",
		},
		camo_bar = {
			name = "Камуфляж",
			dsc = "Залишковий час камуфляжу",
		},
		spectate_bar = {
			name = "Спостереження",
			dsc = "Залишковий час спостереження",
		},
		drain_bar = {
			name = "Екзамен",
			dsc = "Залишковий час екзамену",
		},
		ghost_bar = {
			name = "Примара",
			dsc = "Залишковий час у формі примари",
		},
		special_bar = {
			name = "Суд",
			dsc = "Залишковий час суду",
		},
	},

	upgrades = {
		parse_description = true,

		j_passive1 = {
			name = "Суворий Суддя I",
			info = "Покращує вашу пасивну здібність судді\n\t• Докази збільшують шкоду до додаткових [%j_mult]\n\t• Втрата доказів при атаці зменшена до [%j_loss]",
		},
		j_passive2 = {
			name = "Суворий Суддя II",
			info = "Покращує вашу пасивну здібність судді\n\t• Докази збільшують шкоду до додаткових [%j_mult]\n\t• Втрата доказів при атаці зменшена до [%j_loss]",
		},
		p_passive1 = {
			name = "Окружний Прокурор I",
			info = "Покращує вашу пасивну здібність прокурора\n\t• Захист від куль збільшено до [%p_prot]\n\t• Уповільнення збільшене до [%p_slow]\n\t• Швидкість збору доказів збільшена до [%p_rate] за секунду",
		},
		p_passive2 = {
			name = "Окружний Прокурор II",
			info = "Покращує вашу пасивну здібність прокурора\n\t• Захист від куль збільшено до [%p_prot]\n\t• Уповільнення збільшене до [%p_slow]\n\t• Швидкість збору доказів збільшена до [%p_rate] за секунду",
		},
		dash1 = {
			name = "Ривок I",
			info = "Покращує вашу здібність ривка\n\t• Час перезарядки зменшений на [-dash_cd]\n\t• Шкода збільшена на [+dash_dmg]",
		},
		dash2 = {
			name = "Ривок II",
			info = "Покращує вашу здібність ривка\n\t• Час перезарядки зменшений на [-dash_cd]\n\t• Шкода збільшена на [+dash_dmg]",
		},
		camo1 = {
			name = "Камуфляж I",
			info = "Покращує вашу здібність камуфляжу\n\t• Час перезарядки зменшений на [-camo_cd]\n\t• Тривалість збільшена на [+camo_dur]\n\t• Ви можете пройти [camo_limit] одиниць без переривання цієї здібності",
		},
		camo2 = {
			name = "Камуфляж II",
			info = "Покращує вашу здібність камуфляжу\n\t• Час перезарядки зменшений на [-camo_cd]\n\t• Тривалість збільшена на [+camo_dur]\n\t• Ви можете пройти [camo_limit] одиниць без переривання цієї здібності",
		},
		drain1 = {
			name = "Екзамен I",
			info = "Покращує вашу здібність екзамену\n\t• Час перезарядки зменшений на [-drain_cd]\n\t• Тривалість зменшена на [-drain_dur]",
		},
		drain2 = {
			name = "Екзамен II",
			info = "Покращує вашу пасивну здібність екзамену\n\t• Час перезарядки зменшений на [-drain_cd]\n\t• Тривалість зменшена на [-drain_dur]",
		},
		spect1 = {
			name = "Спостереження I",
			info = "Покращує вашу здібність спостереження\n\t• Час перезарядки зменшений на [-spect_cd]\n\t• Тривалість збільшена на [+spect_dur]\n\t• Захист від куль збільшено до [%spect_prot]",
		},
		spect2 = {
			name = "Спостереження II",
			info = "Покращує вашу здібність спостереження\n\t• Час перезарядки зменшений на [-spect_cd]\n\t• Тривалість збільшена на [+spect_dur]\n\t• Захист від куль збільшено до [%spect_prot]",
		},
		combo = {
			name = "Верховний Суд",
			info = "Покращує ваші здібності суду та примари\n\t• Захист під час суду збільшений до [%special_prot]\n\t• Тривалість примари збільшена на [+ghost_dur]",
		},
		spec = {
			name = "Суд",
			info = "Покращує вашу здібність суду\n\t• Час перезарядки зменшений на [-special_cd]\n\t• Тривалість збільшена на [+special_dur]\n\t• Захист збільшений до [%special_prot]",
		},
		ghost1 = {
			name = "Примара I",
			info = "Покращує вашу здібність примари\n\t• Час перезарядки зменшений на [-ghost_cd]\n\t• Тривалість збільшена на [+ghost_dur]\n\t• Зцілення збільшено до [ghost_hel] за 1 спожитий доказ",
		},
		ghost2 = {
			name = "Примара II",
			info = "Покращує вашу здібність примари\n\t• Час перезарядки зменшений на [-ghost_cd]\n\t• Тривалість збільшена на [+ghost_dur]\n\t• Зцілення збільшено до [ghost_hel] за 1 спожитий доказ",
		},
		change1 = {
			name = "Зміна I",
			info = "Час перезарядки зміни зменшено на [-change_cd]",
		},
		change2 = {
			name = "Зміна II",
			info = "Час перезарядки зміни зменшено на [-change_cd]. Крім того, зміна режиму більше не перериває камуфляж",
		},
	}
}

wep.SCP3199 = {
	skills = {
		_overview = { "passive", "primary", "special", "egg" },
		eggs_max = "У вас вже максимальна кількість яєць!",

		primary = {
			name = "Атака",
			dsc = "Виконуєте базову атаку. Влучання в ціль активує (або оновлює) стан люті, накладає ефект глибоких ран та надає пасивний і лютневий заряд.\nАтаки завдають зменшену шкоду цілям із глибокими ранами. Промах перериває лють. Якщо влучити лише в ціль із глибокими ранами, лють припиняється та застосовується штраф до зарядів.",
		},
		special = {
			name = "Атака з-за меж",
			dsc = "Активується після [tokens] успішних атак підряд. Використання миттєво припиняє лють і завдає шкоди всім гравцям із глибокими ранами. Уражені гравці також уповільнюються.",
		},
		egg = {
			name = "Яйця",
			dsc = "Після вбивства гравця ви можете відкласти яйце. Якщо ви отримаєте смертельне поранення, ви відродитесь у випадковому яйці. Відродження споживає яйце. Крім того, кожне яйце надає [prot] захисту від куль (з обмеженням у [cap]).\n\nПоточні яйця: [eggs] / [max]",
		},
		passive = {
			name = "Пасивна здібність",
			dsc = "Під час люті ви бачите розташування гравців поблизу, які не мають глибоких ран. Отримання лютневих зарядів також надає пасивні заряди. Якщо ваша атака влучає лише в гравця з глибокими ранами, ви втрачаєте [penalty] зарядів. Пасивні заряди покращують ваші інші здібності.\n\nВідновлення [heal] HP за секунду під час люті.\nБонус до шкоди від атак: [dmg]\nБонус до швидкості під час люті: [speed]\nДодаткове уповільнення від спеціальної атаки: [slow]\nСпеціальні атаки викликають [bleed] рівень(і) кровотечі.",
		},
		frenzy_bar = {
			name = "Лють",
			dsc = "Залишковий час люті",
		},
		egg_bar = {
			name = "Яйце",
			dsc = "Залишковий час до появи яйця",
		},
	},

	upgrades = {
		parse_description = true,

		frenzy1 = {
			name = "Лють I",
			info = "Покращує вашу здібність люті\n\t• Тривалість збільшена на [+frenzy_duration]\n\t• Максимальна кількість зарядів збільшена на [frenzy_max]",
		},
		frenzy2 = {
			name = "Лють II",
			info = "Покращує вашу здібність люті\n\t• Максимальна кількість зарядів збільшена на [frenzy_max]\n\t• Швидкість під час люті збільшується на [%frenzy_speed_stacks] за кожен пасивний заряд",
		},
		frenzy3 = {
			name = "Лють III",
			info = "Покращує вашу здібність люті\n\t• Тривалість збільшена на [+frenzy_duration]\n\t• Швидкість під час люті збільшується на [%frenzy_speed_stacks] за кожен пасивний заряд",
		},
		attack1 = {
			name = "Гострі кігті I",
			info = "Покращує вашу атаку\n\t• Час перезарядки зменшено на [-attack_cd]\n\t• Шкода збільшена на [+attack_dmg]",
		},
		attack2 = {
			name = "Гострі кігті II",
			info = "Покращує вашу атаку\n\t• Час перезарядки зменшено на [-attack_cd]\n\t• Шкода збільшена на [%attack_dmg_stacks] за кожен пасивний заряд",
		},
		attack3 = {
			name = "Гострі кігті III",
			info = "Покращує вашу атаку\n\t• Шкода збільшена на [+attack_dmg]\n\t• Шкода збільшена на [%attack_dmg_stacks] за кожен пасивний заряд",
		},
		special1 = {
			name = "Атака з-за меж I",
			info = "Покращує вашу спеціальну здібність\n\t• Шкода збільшена на [+special_dmg]\n\t• Уповільнення збільшене на [%special_slow] за кожен пасивний заряд\n\t• Тривалість уповільнення збільшена на [+special_slow_duration]",
		},
		special2 = {
			name = "Атака з-за меж II",
			info = "Покращує вашу спеціальну здібність\n\t• Шкода збільшена на [+special_dmg]\n\t• Уповільнення збільшене на [%special_slow] за кожен пасивний заряд\n\t• Тривалість уповільнення збільшена на [+special_slow_duration]",
		},
		passive = {
			name = "Кривавий Зір",
			info = "Радіус пасивного виявлення збільшено на [+passive_radius]",
		},
		egg = {
			name = "Великоднє яйце",
			info = "Миттєво створює нове яйце. Ця здібність дозволяє перевищувати ліміт яєць.",
		},
	}
}

wep.SCP009 = {
	name = "SCP-009",
}

wep.SCP500 = {
	name = "SCP-500",
	death_info = "Ти подавився тим SCP-500.",
	text_used = "Як тільки ви проковтнули цю пігулку, ви відчули себе краще",
}

wep.SCP714 = {
	name = "SCP-714"
}

wep.SCP1025 = {
	name = "SCP-1025",
	diseases = {
		arrest = "Зупинка серця",
		mental = "Психічнt захворювання",
		asthma = "Астма",
		blindness = "Сліпота",
		hemo = "Гемофілія",
		oste = "Остеопороз",

		adhd = "СДУГ",
		throm = "Тромбоцитемія",
		urbach = "Хвороба Урбаха-Віте",

		gas = "Тимпаніти",
	},
	descriptions = {
		arrest = "Зупинка серця - це раптова втрата кровотоку внаслідок нездатності серця ефективно перекачувати кров. Ознаки включають втрату свідомості та ненормальне або відсутнє дихання. Деякі люди можуть відчувати біль у грудях, задишку або нудоту безпосередньо перед зупинкою серця. Поширеним симптомом є біль, що віддає в одну руку, а також тривале нездужання і загальна слабкість серця. Якщо не надати допомогу протягом декількох хвилин, це зазвичай призводить до смерті.",
		asthma = "Астма - це тривале запальне захворювання дихальних шляхів легенів. Вона характеризується мінливими та рецидивуючими симптомами, обструкцією повітряного потоку та бронхоспазмами, що легко провокуються. Симптоми включають епізоди хрипів, кашлю, відчуття стиснення в грудях і задишки. Вони можуть виникати кілька разів на день або кілька разів на тиждень.",
		blindness = "Порушення зору, також відоме як погіршення зору або втрата зору, - це зниження здатності бачити до такої міри, що викликає проблеми, які неможливо виправити за допомогою звичайних засобів, таких як окуляри. До таких людей також відносять тих, у кого знижена здатність бачити через те, що вони не мають доступу до окулярів або контактних лінз. Термін 'сліпота' використовується для повної або майже повної втрати зору.",
		hemo = "Гемофілія - це переважно успадковане генетичне захворювання, яке порушує здатність організму утворювати згустки крові - процес, необхідний для зупинки кровотечі. Це призводить до тривалої кровотечі після травми, легкого утворення синців і підвищеного ризику кровотечі в суглоби або мозок. Характерні симптоми залежать від ступеня тяжкості. Загалом симптоми - це епізоди внутрішньої або зовнішньої кровотечі.",
		oste = "Остеопороз - це системне захворювання скелета, що характеризується низькою кістковою масою, мікроархітектурним погіршенням кісткової тканини, що призводить до крихкості кісток і, як наслідок, підвищує ризик переломів. Це найпоширеніша причина переломів серед людей похилого віку. До кісток, які найчастіше ламаються, належать хребці хребта, кістки передпліччя та стегна. До моменту перелому кістки зазвичай немає жодних симптомів.",

		adhd = "Синдром дефіциту уваги та гіперактивності (СДУГ) - це розлад нейророзвитку, що характеризується неуважністю, нападами надмірної енергії, гіперфіксацією та імпульсивністю, які не відповідають віку людини. У деяких людей з СДУГ також спостерігаються труднощі з регулюванням емоцій або проблеми з виконавчою функцією. Крім того, він пов'язаний з іншими психічними розладами.",
		throm = "Тромбоцитемія - це стан підвищеної кількості тромбоцитів у крові. Високий рівень тромбоцитів не обов'язково свідчить про наявність клінічних проблем і може бути виявлений при звичайному загальному аналізі крові. Однак важливо зібрати повну історію хвороби, щоб переконатися, що підвищений рівень тромбоцитів не є наслідком вторинних процесів.",
		urbach = "Хвороба Урбаха-Віте - дуже рідкісне рецесивне генетичне захворювання. Симптоми захворювання сильно відрізняються у різних людей. Хвороба Урбаха-Віте проявляється двосторонніми симетричними кальцифікатами на медіальних скроневих частках. Ці кальцинати часто вражають мигдалину. Вважається, що мигдалеподібне тіло бере участь в обробці біологічно значущих стимулів і в емоційній довготривалій пам'яті, особливо пов'язаній зі страхом..",
	},
	death_info_arrest = "Ви померли через зупинку серця"
}

wep.HOLSTER = {
	name = "Руки",
	info = "Використовуйте, щоб приховати поточний предмет"
}

wep.ID = {
	name = "ID",
	pname = "Ім'я:",
	server = "Сервер:",
}

wep.CCTV = {
	name = "Система відеоспостереження",
	showname = "Камери",
	info = "Система відеоспостереження дозволяє бачити, що відбувається на об'єкті.\nВона також надає вам можливість виявляти SCP і передавати цю інформацію на ваш поточний радіоканал",
	scanning = "Сканування...",
	scan_info = "Натисніть [%s] для сканування SCPs",
	map_info = "Натисніть [%s] щоб відкрити карту",
	scan_cd = "Почекайте перед початком нового сканування...",
	no_signal = "Нема сигналу...",
}

wep.RADIO = {
	name = "Рація",
}

wep.NVG = {
	name = "ПНБ",
	info = "Пристрій нічного бачення - пристрій, який робить темні ділянки яскравішими, а світлі - ще яскравішими.\nІноді крізь них можна побачити аномальні сутності."
}

wep.NVGPLUS = {
	name = "Покращений ПНБ",
	showname = "ПНБ+",
	info = "Покращена версія ПНБ, що дозволяє використовувати його, тримаючи в руках інші предмети.\nНа жаль, батареї вистачає лише на 10 секунд"
}

wep.THERMAL = {
	showname = "Тепловізор",
	name = "Тепловізійний пристрій"
}

wep.ACCESS_CHIP = {
	name = "Чип доступу",
	cname = "Чип доступу - %s",
	showname = "ЧИП",
	pickupname = "ЧИП",
	clearance = "Рівень допуску: %i",
	clearance2 = "Рівень допуску: ",
	hasaccess = "Надає доступ до:",
	NAMES = {
		general = "Загальний",
		jan1 = "Прибиральник",
		jan = "Прибиральник",
		jan2 = "Старший Прибиральник",
		acc = "Бухгалтер",
		log = "Логіст",
		sci1 = "Дослідник 1 рівня",
		sci2 = "Дослідник 2 рівня",
		sci3 = "Дослідник 3 рівня",
		spec = "Спеціаліст із Стримування",
		guard = "Служба Безпеки",
		chief = "Голова СБ",
		mtf = "МОГ",
		com = "Командир МОГ",
		hacked3 = "Зламано 3",
		hacked4 = "Зламано 4",
		hacked5 = "Зламано 5",
		director = "Директор Об'єкту",
		o5 = "O5",
		goc = "ГОК зламано",
	},
	SHORT = {
		general = "Загальний",
		jan1 = "Прибиральник",
		jan = "Прибиральник",
		jan2 = "Ст. Прибиральник",
		acc = "Бухгалтер",
		log = "Логіст",
		sci1 = "Досл. 1 рів.",
		sci2 = "Досл. 2 рів.",
		sci3 = "Досл. 3 рів.",
		spec = "Спец. Стримування",
		guard = "СБ",
		chief = "ГСБ",
		mtf = "МОГ",
		com = "КМД МОГ",
		hacked3 = "Злам. 3",
		hacked4 = "Злам. 4",
		hacked5 = "Злам. 5",
		director = "Директор",
		o5 = "O5",
		goc = "ГОК злам.",
	},
	ACCESS = {
		GENERAL = "Загальний",
		SAFE = "Безпечні",
		EUCLID = "Євкліди",
		KETER = "Кетери",
		OFFICE = "Офіси",
		MEDBAY = "Медблок",
		CHECKPOINT_LCZ = "КПП LCZ-HCZ",
		CHECKPOINT_EZ = "КПП EZ-HCZ",
		WARHEAD_ELEVATOR = "Ліфт до боєголовки",
		EC = "Центр Керування",
		ARMORY = "Арсенал",
		GATE_A = "Ворота А",
		GATE_B = "Ворота B",
		GATE_C = "Ворота C",
		FEMUR = "Ламач Кісток",
		ALPHA = "АЛЬФА Боєголовка",
		OMEGA = "ОМЕГА Боєголовка",
		PARTICLE = "Макромолекулярна гармата",
	},
}

wep.OMNITOOL = {
	name = "Омнітул",
	cname = "Омнітул - %s",
	showname = "Омнітул",
	pickupname = "Омнітул",
	none = "НЕМА",
	chip = "Встановлений Чип: %s",
	chip2 = "Встановлений Чип: ",
	clearance = "Рівень допуску: %i",
	clearance2 = "Рівень допуску: ",
	SCREEN = {
		loading = "Завантаження",
		name = "Омнітул v4.78",
		installing = "Встановлення нового чипа...",
		ejecting = "Виймання чипа...",
		ejectwarn = "Ви точно хочете вийняти чип?",
		ejectconfirm = "Натисніть ще раз, щоб підтвердити...",
		chip = "Встановлений Чип:",
	},
}

wep.MEDKIT = {
	name = "Аптечка (Медикаментів залишилось: %d)",
	showname = "Аптечка",
	pickupname = "Аптечка",
}

wep.MEDKITPLUS = {
	name = "Велика Аптечка (Медикаментів залишилось: %d)",
	showname = "Аптечка+",
	pickupname = "Аптечка+",
}

wep.FLASHLIGHT = {
	name = "Ліхтарик"
}

wep.BATTERY = {
	name = "Батарейка"
}

wep.GASMASK = {
	name = "Протигаз"
}

wep.HEAVYMASK = {
	name = "Важкий Протигаз"
}

wep.FUSE = {
	name = "Запобіжник",
	name_f = "Запобіжник %iA",
}

wep.TURRET = {
	name = "Турель",
	placing_turret = "Встановлення турелі",
	pickup_turret = "Повернення турелі",
	pickup = "Підняти",
	MODES = {
		off = "Вимкнути",
		filter = "Не стріляти по персоналу",
		target = "Стріляти по персоналу",
		all = "Стріляти по всім",
		supp = "Придушувальний вогонь",
		scp = "Стріляти по SCP"
	}
}

wep.ALPHA_CARD1 = {
	name = "Коди для АЛЬФА Боєголовки #1"
}

wep.ALPHA_CARD2 = {
	name = "Коди для АЛЬФА Боєголовки #2"
}

wep.COM_TAB = {
	name = "Планшет МОГ",
	loading = "Завантаження",
	eta = "ETA: ",
	detected = "Виялені суб'єкти:",
	tesla_deactivated = "Деактивовані Тесли: ",
	change = "ПКМ - змінити",
	confirm = "ЛКМ - підтвердити",
	options = {
		scan = "Сканування комплексу",
		tesla = "Запит на Тесла ворота"
	},
	actions = {
		scan = "Сканування комплекс...",
		tesla = "Вимкнення Тесла воріт...",
	}
}

wep.GOC_TAB = {
	name = "Планшет ГОК",
	info = "Персональний планшет ГОК. Містить невелику вибухівку, яка знищує планшет у разі смерті користувача",
	loading = "Завантаження",
	status = "Статус:",
	dist = "Відстань до цілі",
	objectives = {
		failed = "Пристрій знищено",
		nothing = "Невідомо",
		find = "Знайти пристрій",
		deliver = "Доставити пристрій",
		escort = "Супровід пристрою",
		protect = "Захист пристрою",
		escape = "Втеча"
	}
}

wep.GOCDEVICE = {
	name = "Пристрій ГОК",
	placing = "Розміщення пристрою ГОК..."
}

wep.DOCUMENT = {
	name = "Документи",
	info = "Пакет з кількох документів, які можуть містити цінну інформацію про SCP, комплекс та персонал",
	types = {

	}
}

wep.BACKPACK = {
	name = "Рюкзак",
	info = "Дозволяє носити більше речей",
	size = "Розмір: ",
	NAMES = {
		small = "Малий Рюкзак",
		medium = "Середній Рюкзак",
		large = "Величезний Рюкзак",
		huge = "Гігантський Рюкзак",
	}
}

wep.ADRENALINE = {
	name = "Адреналін",
	info = "Забезпечує миттєве підвищення витривалості на короткий час",
}

wep.ADRENALINE_BIG = {
	name = "Велика доза Адреналіну",
	info = "Забезпечує миттєвий приріст витривалості на значний проміжок часу",
}

wep.MORPHINE = {
	name = "Морфін",
	info = "Забезпечує тимчасовий приріст здоров'я, яке з часом зменшується",
}

wep.MORPHINE_BIG = {
	name = "Велика доза Морфіну",
	info = "Забезпечує багато тимчасового здоров'я, яке з часом зменшується",
}

wep.TASER = {
	name = "Електрошокер"
}

wep.PIPE = {
	name = "Металева труба"
}

wep.GLASS_KNIFE = {
	name = "Ніж зі скла"
}

wep.CLOTHES_CHANGER = {
	name = "Маскувальний набір (Руки)",
	info = "Для інших це звичайні руки. Додатково дозволяє красти одяг з мертвих тіл. Дивіться на мертве тіло і утримуйте ЛКМ, щоб використати",
	skill = "Маскування",
	wait = "Почекайте",
	ready = "Готово",
	id_time = "Залишок часу викраденого ID",
	progress = "Перевдягання",
	vest = "Зніміть бронежилет, щоб переодягнутися"
}

wep.DOOR_BLOCKER = {
	name = "Блокувальник дверей",
	info = "Наведіть на кнопку та утримуйте ЛКМ для заряджання. Відпустіть ЛКМ, щоб розрядити і тимчасово заблокувати двері",
	skill = "Блокувальник дверей",
	wait = "Почекайте",
	ready = "Готово",
	progress = "Заряджання"
}

wep.SNAV = {
	name = "S-NAV",
	low_battery = "Низький заряд",
	no_signal = "Нема сигналу",
}

wep.SNAV_ULT = {
	name = "S-NAV ULTIMATE",
	showname = "S-NAV+",
	low_battery = "Низький заряд",
	no_signal = "Нема сигналу",
}

wep.__slc_ammo = "Набої"

wep.CROWBAR = {
	name = "Лом",
}
wep.STUNSTICK = {
	name = "Електро-Кийок",
}

--[[-------------------------------------------------------------------------
Minigames - Global
---------------------------------------------------------------------------]]
local minigames = {}
lang.minigames = minigames

--[[-------------------------------------------------------------------------
Snake
---------------------------------------------------------------------------]]
local snake = {}
minigames.snake = snake

snake.score = "Рахунок"
snake.high_score = "Рекорд"
snake.game_over = "Гру закінчено!"
snake.paused = "Приготуйтесь!"
snake.info = "Натисніть W, A, S або D, щоб почати"
snake.restart = "Натисніть пробіл для рестарту"

--[[-------------------------------------------------------------------------
Data binds - DO NOT EDIT!
---------------------------------------------------------------------------]]
lang.__binds = {
	["badges"] = "ranks",
}

--[[-------------------------------------------------------------------------
Register language
---------------------------------------------------------------------------]]
RegisterLanguage( lang, "ukrainian","українська", "ua")
SetLanguageFlag( "ukrainian", LANGUAGE.EQ_LONG_TEXT )
